{"description": "Good software is expensive to make, and Free Software is no exception. Six years ago, the Blender Foundation crowdfunded Big Buck Bunny. What's happened since then? Countless Free Software projects have frustrated their users with missed targets, exaggerated expectations, and absent source code. While proprietary games, plugins, and even fonts race ahead with tens of millions of dollars in collected donations, Free Software lags behind with a handful of major successes.\n\nYet the primary benefits of crowdfunding provide precisely what most Free apps need: dollars, exposure and focus.  Well planned campaigns deliver fast, scalable, and sustainable results. Best of all they connect developers directly to their users, completing the development cycle without the need for corporate direction. So why does the potential of this radical method  remain largely untapped?\n\nIn this talk I'll explain how crowdfunding is the perfect fit for many Free Software projects, how the Heartbleed bug highlighted a wider resourcing crisis, and explore new models of crowdfunding that could reliably fund our software in future.\n\nDownload video: https://fscons.org/videos", "event": {"name": "FSCONS 2014", "nickname": "fscons-2014", "twitter": "fscons", "url": "https://fscons.org/2014/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "sam-tuke-the-case-for-crowdfunding-free-software-fscons-2014", "length": "47:39", "likes": "0", "recorded": "2014-10-31", "short_description": "Good software is expensive to make, and Free Software is no exception. Six years ago, the Blender Foundation crowdfunded Big Buc", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/bXoSKRcr-84/hqdefault.jpg", "title": "Sam Tuke: The case for crowdfunding Free Software (FSCONS 2014)", "tweet_video": "Sam%20Tuke%3A%20The%20case%20for%20crowdfunding%20Free%20Software%20%28FSCONS%202014%29%20https%3A//codeandtalk.com/v/fscons-2014/sam-tuke-the-case-for-crowdfunding-free-software-fscons-2014%20presented%20%40fscons", "videos": [{"code": "bXoSKRcr-84", "type": "youtube"}], "views": "17"}