{
    "description": "Damit der Crash nicht zu einem Totalausfall wird\n\nBeschreibung:\nInstallation und Konfiguration eines High-Availability-Linux-Clusters, einbinden eigener Ressourcen und Demonstration mittels eines Raspberry Pi-Clusters.\n\nEgal ob der eigene DHCP- oder Mailserver abstürzt, ein Festplatten-Crash die Konfigurationssoftware für ein Bahnunternehmen lahmgelegt oder die Überwachungsoftware bei einem System der Flugsicherung upgedatet werden muss: Downtime bedeutet Kosten, Anspannung beim Kunden und Mitarbeitern und, speziell im Fall eines ungeplanten Crashs, furchtbaren Stress für den Administrator. Durch den Einsatz eines geclusterten Systems können all diese Punkte abgefedert werden.\n\nDieser Vortrag liefert einen Überblick über die Umsetzung eines High-Availability-Linux-Clusters mittels den Open-Source-Tools Pacemaker, Heartbeat und Corosync. Wie es dadurch ermöglicht wird, ganze Maschinenausfälle und einzelne Softwareausfälle zu erkennen und eine automatische Wiederherstellung der Funktionalität zu erreichen. \nDie Erstellung und Konfiguration einzelner Cluster-Ressourcen wird erklärt, einerseits durch einbinden bestehender OCF- und LSB-Scripts und andererseits durch Integration eigener Software. Bei einem Cluster gibt es die unterschiedlichsten Anforderungen, etwa auf welchem Cluster-Node und in welcher Abhängigkeit die einzelnen Ressourcen gestartet werden müssen. Es wird daher auf die verschiedenen Möglichkeiten Ressourcen auf den Nodes gleichzeitig, entweder-oder und im Master-/Slave-Modus zu starten eingegangen. \nNach einem Absturz befindet sich das System in einem undefinierten Zustand, wie dieser aufgelöst werden kann, wird durch das Konzept des Fencings erklärt. \nDer Vortrag wird durch einen Live-Einblick mittels des mitgebrachten Raspberry-Pi Clusters unterstützt.\n\nVortragender: Michael Musenbrock",
    "favorite": "0",
    "length": "42:27",
    "likes": "1",
    "recorded": "2015-04-24",
    "speakers": ["michael-musenbrock"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/7pa0hqYDXsE/hqdefault.jpg",
    "title": "Linux Clustering",
    "videos": [
        {
            "code": "7pa0hqYDXsE",
            "type": "youtube"
        }
    ],
    "views": "46"
}