{
    "description": "Vortrag bei den Grazer Linuxtagen 2015\n\nTitel: \nWebtracking und Gegenmassnahmen\nKommerzielle Überwachung des Surfverhaltens und Erstellung von Personenprofilen.\n\nBeschreibung:\nEs wird die finanzielle Motivation der Trackingfirmen und Datensammler erklärt, warum kommerzielle Überwachung ein großes Geschäft ist. Dazu werden mehrere Technologien wie Cookies, Tracking Pixel und der Browser Fingerprint genutzt, welche erläutert werden. Zum Schluss wird die Wirksamkeit von verschiedenen Browsereinstellungen und AddOns gegen Webtracking verglichen.\n\nUnsichtbare Mächte verfolgen uns und wir werden alle überwacht! :-) Weil gegen diese dunkle Bedrohung Wünschelruten und belebtes Wasser nicht helfen, versuchen wir es mit Browsereinstellungen. \nVon allen Internetnutzerinnen und -nutzern gibt es gleich mehrere digitale Zwillinge bei den großen Datenhändlern, von denen Google und Facebook nur die bekanntesten sind. Diese unbekannten Wesen werden wie an Börsen gehandelt und in Zukunft immer mehr Einfluss auf das alltägliche Leben haben, wie z. B. bei Versicherungsbeiträgen und Kreditzinsen. \nUnsere Zwillinge werden unter anderem von unseren Browserhistorien der letzten Jahrzehnte (!) über alle Geräte hinweg mit Leben gefüllt. Um jede Nutzerin und jeden Nutzer anhand von Browser und Computer wiederzuerkennen, gibt es viele technische Möglichkeiten, die alle gleichzeitig genutzt werden. Cookies sind bereits bekannt, aber ebenfalls werden Local Shared Objects (LSOs), Tracking Pixel im Cache, HSTS Marker, der Clock Skew, Browserfingerprinting mittels Javascript und Flash sowie vieles mehr verwendet. \nWiderstand zwecklos? Nein, eine kleine nerdige Community wehrt sich hartnäckig. Wir nageln unsere Browser zu, akzeptieren Komfortverlust, installieren ein paar AddOns und müssen Freunde ausserhalb von Facebook finden. \nIn diesem Vortrag werden alltagstaugliche Einstellungen des Browsers Firefox besprochen und mehrere Varianten bezüglich der Wirksamkeit gegen Webtracking verglichen. Ebenfalls wird ein Ausblick auf Browser in virtuellen Maschinen gegeben, die Fingerprinting sehr schwierig machen und den Komfortverlust gering halten.\n\nVortragende: Mr. X und Bernhard Z.",
    "favorite": "0",
    "length": "55:29",
    "likes": "0",
    "recorded": "2015-04-24",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/fDHU0oIM9rk/hqdefault.jpg",
    "title": "Webtracking und Gegenmassnahmen - Mr. X und Bernhard Z.",
    "videos": [
        {
            "code": "fDHU0oIM9rk",
            "type": "youtube"
        }
    ],
    "views": "125"
}