{"description": "An open-source BIOS for the PC platform has many benefits, especially for non-mainstream uses, such as large clusters and embedded applications. Benefits are close control of the boot process (hence reliability), fast boot times and of course you do not have to pay royalties for the BIOS.\r\n\r\nLow-level initialization of PC hardware proves to be a very challenging task, which is very dependent on the exact chipset. Finding adequate documentation is part of the challenge. Coreboot provides this low-level hardware initialization for many PC motherboards. When the initialization is finished, Coreboot runs the payload.\r\nA Coreboot payload can be a PC-style BIOS (such as the open source SeaBIOS), but it is also possible to skip the traditional BIOS and boot loader and run a Linux kernel directly as a Coreboot payload.\r\n\r\n\r\nLennart Benschop has been a Linux user since July 1992. He obtained his PhD at the Eindhoven University of Technology in 1997. Since then he has been working at what is now called AuthenTec B.V. in Vught. He specializes in embedded software development and functional verification for cryptographic hardware. He has extensive knowledge of device driver development on the Linux platform and network security protocols such as IPsec and SSL.", "event": {"name": "T-DOSE 2011", "nickname": "t-dose-2011", "twitter": "TDOSE", "url": "http://www.t-dose.org/2011/schedule"}, "favorite": "0", "file_date": "2016-12-03", "filename": "why-coreboot-open-source-bios-lennart-benschop-t-dose-2011-eindhoven", "length": "01:02:09", "likes": "16", "recorded": "2011-11-05", "short_description": "An open-source BIOS for the PC platform has many benefits, especially for non-mainstream uses, such as large clusters and embedd", "speaker_twitters": "", "speakers": {"lennart-benschop": {"episodes": [], "hosting": [], "info": {"name": "Lennart Benschop"}, "videos": [{"event": {"name": "T-DOSE 2011", "nickname": "t-dose-2011", "twitter": "TDOSE", "url": "http://www.t-dose.org/2011/schedule"}, "filename": "why-coreboot-open-source-bios-lennart-benschop-t-dose-2011-eindhoven", "recorded": "2011-11-05", "thumbnail_url": "https://i.ytimg.com/vi/Xb6yFRI421c/hqdefault.jpg", "title": "Why Coreboot: Open Source BIOS"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/Xb6yFRI421c/hqdefault.jpg", "title": "Why Coreboot: Open Source BIOS", "tweet_video": "Why%20Coreboot%3A%20Open%20Source%20BIOS%20https%3A//codeandtalk.com/v/t-dose-2011/why-coreboot-open-source-bios-lennart-benschop-t-dose-2011-eindhoven%20presented%20%40TDOSE", "videos": [{"code": "Xb6yFRI421c", "type": "youtube"}], "views": "2124"}