{
  "description": "The last year's been very interesting for those of us who have been looking on in horror over the last decade as billions of dollars was spent on frivolous and ridiculously broad software patent litigation. The United States Supreme Court's ruling in the landmark Alice vs. CLS Bank case has finally given the lower courts some tools they could use to overturn obvious and vague patents. Many judges have found for the defendant and overturned obvious patents. For entities with the time and money to fight bad patents in court, this is fantastic news. As many as four out of five of the software patents on the books in the US might be found invalid under the new doctrines. For everyone else, this is a mixed bag. \n\nThere are still several things we need to pay attention to. Patent suits can still be brought. For entities that can't afford to fight, those disputes will be settled out of court -- without the full impact of the court's updated scope of patentability. Without legislation, it will take twenty years to cycle out the old style of broadly written patents. So, even if the United States Patent and Trade Office fixes their processes immediately we will still have a very long tail to contend with. The new scope of patentability hasn't been fully tested and there may yet turn out to be gaping loopholes that bad actors may use to undo the progress that has been made. Finally, global entities may use international trade agreements to stop or roll-back the progress made against poorly conceived patents in any country that has signed a sweeping treaty with patent language.  \n\nIn short, we aren't done yet. The best way to keep moving forward is for the global community to work together. This talk is for anyone who is wondering what the recent decisions mean for small and mid-size entities, how international treaties can impact local policy and what can be done to improve the situation.",
  "recorded": "2016-04-23",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/UR0QEQ3VqU0/hqdefault.jpg",
  "title": "LinuxFest Northwest 2016: Software Patents After Alice: A Long and Sad Tail",
  "videos": [
    {
      "code": "UR0QEQ3VqU0",
      "type": "youtube"
    }
  ]
}