{
  "description": "For better or worse, the Internet of Things has become pervasive in our lives.  I am interested in IoT at the component level: how Thingies can be built cheaply and effectively, how they can be made to communicate openly through standards, the interesting work and information these Thingies can provide that allow us to make powerful decisions to shape lives.\n\nMy belief is that by using an open approach to making Thingies and using freely available standards, protocols, and mechanisms, we can make spectacularly interesting things, share ideas, and make the world a better place.  Or at least a more interesting place. \n\n \n\nThis talk will highlight my process for making, testing, tinkering, breaking, remaking, modifying, adjusting, interacting, collecting, and putting Thingies to use.  Using common tools and hobbiest electronic components I will show my approach and decision process, lessons learned and ideas to refine and improve future revisions.\n\nI also happen to work for an open source network management platform project, The OpenNMS Group, so I will use OpenNMS to collect and present collected data from these Thingies.  I will explore different data collection approaches, make use of different collection and presentation approaches, and cover ways to handle events and make use of alerting and thresholding.  \n\nTechnologies involved will range from TCP/IP to Lua, XML, HTTP, Heka, electricity, IDEs, Arduino and other similar hardware, and some Linux systems involvement too.\n\nAttendees should have very basic familiarity with electronics, open source systems, and IP protocol communication.  I will generalize these areas for the talk.\n\nYou should walk away from this presentation with an energetic verve to build an IoT army that can take on the world and become our future machine overlords.  I kid, mostly.",
  "recorded": "2016-04-23",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/CCbDf-x05WM/hqdefault.jpg",
  "title": "LinuxFest Northwest 2016: Internet of Thingies",
  "videos": [
    {
      "code": "CCbDf-x05WM",
      "type": "youtube"
    }
  ]
}