{
    "abstract": "https://www.linuxfestnorthwest.org/2016/sessions/devil-details-switching-bsd-linux",
    "description": "When you mention Devils and Penguins — the mascots for both BSD and Linux, respectively — the first thing that might immediately come to mind is an NHL hockey game between New Jersey (the Devils) and Pittsburgh (the Penguins). But we’re not going there with this presentation because, for starters, it’s not a competition.\n\nMost Free/Open Source Software users run Linux as their operating system of choice, choosing one (or more) of the 300 or so distros currently active on DistroWatch. Not as many have crossed the street, rhetorically speaking, and taken a look at the other Open Source operating system, BSD and its many variants.\n\nAs a long time and current Linux user new to PC-BSD — essentially the BSD equivalent to Linux Mint — my intention is to:\n\n·        Outline the (many) similarities and (few) differences between Linux and BSD,\n\n·        Walk the audience through the process of moving from Linux to BSD, unless the audience is in a hurry, then I’ll run them through it,\n\n·        Describe the ease-of-use and pitfalls of day-to-day use of PC-BSD for the average user, and\n\n·        How to pitch in and make code and other contributions (e.g., documentation, translation) to BSD variants, even while doing the same for Linux distributions,\n\n·        And more!\n\nThis talk is more of an overview rather than instructional, though resources will be made available regarding where to download BSD variants and fundamental instructions on how to install it.",
    "favorite": "0",
    "length": "01:00:57",
    "likes": "35",
    "recorded": "2016-04-23",
    "speakers": [
        "michael-dexter"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/6k1Mf0c6YW8/hqdefault.jpg",
    "title": "The Devil in the Details: Switching to BSD from Linux",
    "videos": [
        {
            "code": "6k1Mf0c6YW8",
            "type": "youtube"
        }
    ],
    "views": "3227"
}