{
    "abstract": "https://beyondtellerrand.com/events/berlin-2015/speakers/steve-and-mark#talk",
    "description": "Which would you rather have: A rich design or a fast user experience? Users want both, but sometimes the interplay between design and performance feels like a fixed sum game: One side’s gain is the other side’s loss. Design and performance are indeed connected, but it’s more like the yin and yang. They aren’t opposing forces, but instead complement each other. Users want an experience that is rich and fast. The trick for us as designers and developers is figuring out how to do that.\n\nThe answer is to adopt an approach that considers both design and performance from the outset. With this approach, designs are conceived by teams of designers and developers working together. Developers benefit by participating in the product definition process. Designers benefit from understanding more about how designs are implemented. There’s an emphasis on early prototyping and tracking performance from the get-go.\n\nWith new metrics that focus on what a user actually sees as the page loads, we can now bridge the technical and language gaps that have hindered the seamless creation of great user experiences. In this presentation, Steve Souders, former Chief Performance Yahoo! and Google head performance engineer, explains how promoting a process that brings design and performance together at the beginning of a project helps deliver a web experience that is both fast and rich.\n---------------\n\nTalk & speaker bio:\nhttp://beyondtellerrand.com/events/berlin-2015/speakers/steve-and-mark\n\nMORE INFORMATION\n\nWatch this little recap video to get an impression how beyond tellerrand events look like:\nhttp://vimeo.com/69823900\n\nInformation about beyond tellerrand:\nhttp://beyondtellerrand.com/\nhttp://twitter.com/btconf",
    "favorite": "0",
    "length": "39:16",
    "likes": "1",
    "recorded": "2015-05-11",
    "speakers": [
        "steve-souders",
        "mark-zeman"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/NHQxKSI369U/hqdefault.jpg",
    "title": "Design + Performance",
    "videos": [
        {
            "code": "NHQxKSI369U",
            "type": "youtube"
        }
    ],
    "views": "80"
}