{"description": "L’écriture… Quelles différences importantes pouvons nous constater entre le geste graphique – expression forte de l’individualité – et l’utilisation d’un clavier pour la saisie d’un texte – la présence du clavier présupposant l’existence de lettres - ? Quels pourraient être les retentissements sur notre organisme de l’apprentissage de l’écriture sur tablette numérique exclusivement ? Nous vous proposons ce jour un voyage de l’invisible au visible, un moment d’aventure grâce à l’écriture…\n\n\nAuthors:\nClarisse Herrenschmidt\nClarisse Herrenschmidt est une archéologue, historienne de l'antiquité, philologue et linguiste française, née le 24 octobre 1946 à Strasbourg. Elle est chercheur au Centre national de la recherche scientifique depuis 1979 et est rattachée au Laboratoire d'Anthropologie Sociale du Collège de France.\n\nBlog: http://fr.wikipedia.org/wiki/Clarisse_HerrenschmidtElle a enseigné à l’INALCO (Histoire d’ l’Iran, Écritures et Cultures graphiques), à l’Université de Paris 8 (Anthropologie linguistique).\nSon ouvrage Les Trois Écritures. Langue, nombre, code, Paris Gallimard, 2007, a reçu le Prix Georges Dumézil de l’Académie française en 2008, le Prix Georges Picot de l’Académie des Sciences Morales et Politiques de 2008.\n\nBetty Moreau\nCoach, Formatrice RH Accompagnement centré sur l'individu en situation professionnelle\n\nBlog: http://www.adretcom.fr", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "des-tablettes-decriture-aux-tablettes-pour-ecrire", "length": "52:39", "likes": "1", "recorded": "2016-06-08", "short_description": "L’écriture… Quelles différences importantes pouvons nous constater entre le geste graphique – expression forte de l’individualit", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/9bhqLaXnj8I/hqdefault.jpg", "title": "Des tablettes d'écriture aux tablettes pour écrire", "tweet_video": "Des%20tablettes%20d%27%C3%A9criture%20aux%20tablettes%20pour%20%C3%A9crire%20https%3A//codeandtalk.com/v/devoxx-france-2015/des-tablettes-decriture-aux-tablettes-pour-ecrire%20presented%20%40DevoxxFR", "videos": [{"code": "9bhqLaXnj8I", "type": "youtube"}], "views": "116"}