{"description": "Tu es développeur ? Tu veux écrire une app performante, scalable et résiliente ? Et si en plus on faisait tourner cette app sur un cluster de raspberry pi ?L'approche monolitique, saturée de stacks entreprise n'est pas idéale. Le reactive manifesto propose qqc de plus modulaire permettant d'atteindre scalabilité et résilience.Cette session disséquera une application réactive basée sur des micro services et de l'Event Sourcing avec des outils comme Cassandra, ElasticSearch, Play2, Akka. Nous vérifierons si cette approche tient ses promesse lorsque le hardware est quelque peu contraint...\n\n\nAuthors:\nAlexandre Delegue\nAlexandre Delègue est ingénieur d'études chez SERLI, il travaille principalement autour des technologies Java / JavaEE / Spring mais aussi sur des problématiques d'intégration continue, de qualimétrie et même récemment sur un projet de centralisation des logs. Ses expériences passées l'ont également amené à travailler sur les applications de gestion ainsi que sur un site web grand public notamment sur les problématiques de sécurité, de performance et de scalabilité.​\n\nBlog: https://plus.google.com/108968818453090484968\n\nMathieu ANCELIN\nMathieu Ancelin est ingénieur d’études à SERLI, société de Conseil et d’Ingénierie du SI, où il s’est spécialisé dans les technologies Java EE avec un fort intérêt pour les frameworks de composants. Ses activités l’impliquent dans le développement de divers projets open-source comme GlassFish ou JOnAS, et il en dirige quelques-un (CDI-OSGi, Play CDI); il est membre de l’expert group de la JSR 346 (CDI 1.1). \nMathieu intervient régulièrement à l’Université de La Rochelle, à l’Université de Poitiers et dans diverses conférences (JavaOne, Solutions Linux...) pour parler de Java EE. Il est membre de l’équipe du Poitou-Charentes JUG. Vous pouvez le suivre sur twitter : @TrevorReznik", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "i-dont-always-write-reactive-applications-but-when-i-do-it-runs-on-raspberry-pi", "length": "52:57", "likes": "0", "recorded": "2016-06-08", "short_description": "Tu es développeur ? Tu veux écrire une app performante, scalable et résiliente ? Et si en plus on faisait tourner cette app sur ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/RS9CA7sHTss/hqdefault.jpg", "title": "I don't always write Reactive applications, but when I do, it runs on Raspberry Pi", "tweet_video": "I%20don%27t%20always%20write%20Reactive%20applications%2C%20but%20when%20I%20do%2C%20it%20runs%20on%20Raspberry%20Pi%20https%3A//codeandtalk.com/v/devoxx-france-2015/i-dont-always-write-reactive-applications-but-when-i-do-it-runs-on-raspberry-pi%20presented%20%40DevoxxFR", "videos": [{"code": "RS9CA7sHTss", "type": "youtube"}], "views": "78"}