{"description": "Who wants a mindless drone? Teach it to think, and it can do so much more. But how do you take it from Toy Story to Terminator? This session’s speaker discusses a new open source library, Autonomous4j, for autonomous drone development. Combining this library and some components from his mad science toolkit, he demonstrates how to get your Internet of Things off the ground and do some real cloud computing. In the session, you’ll learn how to write an autonomous drone program with Java 8; deploy it to the drone’s positronic brain, an onboard Raspberry Pi; have the Pi guide an AR.Drone to accomplish a task; monitor it via a JavaFX console; and create your own robot overlord. Demos are included: you’ve been warned! This presentation will feature an AR Drone flying autonomously\n\n\nAuthor:\nJames Weaver\nJames L. (Jim) Weaver is a Java and JavaFX developer, author, and speaker with a passion for helping rich-client Java and JavaFX become preferred technologies for new application development. Books that Jim has authored include Inside Java, Beginning J2EE, and Pro JavaFX 2.  His professional background includes 15 years as a systems architect at EDS, and the same number of years as an independent developer. As an Oracle Java Evangelist, Jim speaks internationally at software technology conferences. Jim blogs at http://javafxpert.com, tweets @javafxpert, and may be reached at james.weaver AT oracle.com.", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "iot-java-and-autonomous-drones", "length": "46:19", "likes": "0", "recorded": "2016-06-08", "short_description": "Who wants a mindless drone? Teach it to think, and it can do so much more. But how do you take it from Toy Story to Terminator? ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/IwjchV4O698/hqdefault.jpg", "title": "IoT, Java, and Autonomous Drones", "tweet_video": "IoT%2C%20Java%2C%20and%20Autonomous%20Drones%20https%3A//codeandtalk.com/v/devoxx-france-2015/iot-java-and-autonomous-drones%20presented%20%40DevoxxFR", "videos": [{"code": "IwjchV4O698", "type": "youtube"}], "views": "140"}