{"description": "Java EE 7 was released 18 months ago and from J2EE to Java EE 7, much has changed but we are not done yet! Through the years, Java EE has always reinventing itself. Java EE 8 will be no exception to this rule! In this session, we will look at the Java EE 8 plans. We will review the various new JSRs that will be part of Java EE 8 (e.g. MVC JSR, JSON-B JSR, Security JSR, ...). We will obviously also looks how the existing technologies will evolves for Java EE 8 (eg. Servlet 4 with bring HTTP/2 support, JMS's plan to replace Message Driven Beans, CDI/EJB alignment, JAX-RS 2.1, etc). We will conclude this session by looking at how you can get involved in those works. This session will give you a good understanding on what Java EE 8 will looks like.\n\n\nAuthor:\nDavid Delabassee\nDavid Delabassee is a Principal Product Manager working in the GlassFish team at Oracle. Prior to Oracle, David spent 10 years at Sun Microsystems focusing on Java end-to-end (from the smart card to the high end server), all the related technologies and the developer tools. He has been involved in Java projects since the early days of this technology. In his spare time, he enjoy tinkering and playing with technologies such as Java, Arduino, Processing, Linux, etc.", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "java-ee-8-a-snapshot-overview", "length": "50:30", "likes": "0", "recorded": "2016-06-08", "short_description": "Java EE 7 was released 18 months ago and from J2EE to Java EE 7, much has changed but we are not done yet! Through the years, Ja", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/YUT60OFSjiI/hqdefault.jpg", "title": "Java EE 8, a snapshot overview", "tweet_video": "Java%20EE%208%2C%20a%20snapshot%20overview%20https%3A//codeandtalk.com/v/devoxx-france-2015/java-ee-8-a-snapshot-overview%20presented%20%40DevoxxFR", "videos": [{"code": "YUT60OFSjiI", "type": "youtube"}], "views": "62"}