{"description": "Java 9 is just around the corner, and yet many of us developers have yet to use Java 8 features in an application. The goal of this presentation is to move beyond slide-sized examples of streams and lambdas, and to show how to build a fully working end-to-end application using just the core libraries available in the latest version of Java.In this session, Trisha will build a Java 8 application live. This application will consume a real-time feed of high velocity data, contain services that make sense of the data, and present it in a JavaFX dashboard. Along the way, we’ll encounter Java 8 streams, lambdas, new ways of working with collections, and probably bump into the new date and time API.\n\n\nAuthor:\nTrisha Gee\nTrisha has developed Java applications for a range of industries, including finance, manufacturing and non-profit, for companies of all sizes. She has expertise in Java high performance systems, is passionate about enabling developer productivity, and dabbles with Open Source development. Trisha blogs regularly on subjects that she thinks developers and other humans should care about, she’s a leader of the Sevilla Java User Group, a key member of the London Java Community, a MongoDB Master and a Java Champion. She believes we shouldn't all have to make the same mistakes again and again, so now she works for JetBrains where she can tell developers about all the cool stuff she's learnt so far.", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "java-8-in-anger", "length": "52:31", "likes": "0", "recorded": "2016-06-08", "short_description": "Java 9 is just around the corner, and yet many of us developers have yet to use Java 8 features in an application. The goal of t", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/ehwjiw871uc/hqdefault.jpg", "title": "Java 8 in Anger", "tweet_video": "Java%208%20in%20Anger%20https%3A//codeandtalk.com/v/devoxx-france-2015/java-8-in-anger%20presented%20%40DevoxxFR", "videos": [{"code": "ehwjiw871uc", "type": "youtube"}], "views": "98"}