{"description": "Un temps annoncé en perte de vitessse, GWT amorce en 2015 un retour en force conforté par une nouvelle organisation et de profondes modifications de l'environnement de développement. Les outils les plus complexes de Google (Google SpreadSheet, Google Inbox, ....) ont été portés en GWT. Le support de Java 8, des lambdas expression du Super Dev Mode et des Web Component en font la technologie de choix pour le développeur Java. Cette session résume les nouveautés de la dernière version et dessine la roadmap des années à venir. Le tout illustré d'exemples de code et de démonstrations.\n\n\nAuthor:\nSami Jaber\nArchitecte et formateur JEE/.NET, Sami Jaber est le fondateur de la société DNG Consulting, référence dans le monde du développement d'applications Web. Il a plus de 15 ans d'expérience dans le domaine des architectures distribuées transactionnelles et accompagne les entreprises dans leur démarche de migration vers les nouvelles technologies.\nAuteur du livre \"Programmation GWT 2\" paru chez Eyrolles, il intervient régulièrement lors de conférences techniques en France et à l'étranger. L’adresse de son blog est http://www.samijaber.com.", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "le-retour-en-force-de-gwt", "length": "48:16", "likes": "4", "recorded": "2016-06-08", "short_description": "Un temps annoncé en perte de vitessse, GWT amorce en 2015 un retour en force conforté par une nouvelle organisation et de profon", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/ZFDRtM6thsY/hqdefault.jpg", "title": "Le retour en force de GWT", "tweet_video": "Le%20retour%20en%20force%20de%20GWT%20https%3A//codeandtalk.com/v/devoxx-france-2015/le-retour-en-force-de-gwt%20presented%20%40DevoxxFR", "videos": [{"code": "ZFDRtM6thsY", "type": "youtube"}], "views": "284"}