{"description": "A travers une série de démos, vous découvrirez les meilleurs outils pour développer votre application web en 2015:Prototypez avec atom, emmet, et firebaseAbandonnez votre IDE: utilisez les devtoolsIndustrialisez votre projet avec yeomanMaitrisez grunt ou gulp: asset pipeline, tests, sourcemapsDéveloppez pour les mobiles avec votre styleguideTests sur devices: créez et maintenez un browserlabDéployez dans le cloud avec JavaScriptAnalysez la qualité de votre codeOptimisez vos performances avec web page test et les audits chrome\n\n\nAuthor:\nPhilippe Antoine\nPhilippe est SCRUM Master chez Xebia mais pas seulement: HTML5 n'a plus de secret pour lui et javascript est sa deuxième langue maternelle. Le jour il développe en équipe des applications web mobiles, la nuit il éxpérimente les dernières nouveautés techniques. Toujours disponible pour des dicussions passionnées, vous le croiserez surement dans les différents évenements à Paris: Devoxx, JavaCamp, ParisJS, Coding Dojo, Agile Tour...\n\nPhilippe is SCRUM Master at Xebia, but not only: HTML5 has no secret for him, and he speaks javascript fluently.\nHe loves to work with his team on web application by day, and experiment bleeding edge technology at night.", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "les-nouveaux-outils-du-developpeur-web", "length": "56:22", "likes": "15", "recorded": "2016-06-08", "short_description": "A travers une série de démos, vous découvrirez les meilleurs outils pour développer votre application web en 2015:Prototypez ave", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/XSrVztKxC6Q/hqdefault.jpg", "title": "Les nouveaux outils du développeur web", "tweet_video": "Les%20nouveaux%20outils%20du%20d%C3%A9veloppeur%20web%20https%3A//codeandtalk.com/v/devoxx-france-2015/les-nouveaux-outils-du-developpeur-web%20presented%20%40DevoxxFR", "videos": [{"code": "XSrVztKxC6Q", "type": "youtube"}], "views": "1896"}