{"description": "Les applications sont de plus en plus interconnectées. Une architecture type WOA (Web Oriented Architecture) et l’utilisation des micros-services nécessitent de faire de plus en plus d’appel à différents services web. Comment&nbsp;composer&nbsp;un résultat à partir de ces différents services ?RxJava offre une manière élégante de faire de l’asynchrone et de la composition au sein de son application. A travers une session de live-coding, nous vous montrerons comment&nbsp;transformer&nbsp;un code synchrone en un code asynchrone via&nbsp;RxJava, et les possibilités offertes par ce modèle de programmation.\n\n\nAuthors:\nBrice Dutheil\nD'abord dans l'embarqué puis ayant rejoins le monde des projets d'envergure dans le bancaire, le voyage, la messagerie instantanée. C'est au contact de ces expérience que je suis devenu commiteur opensource sur Mockito. Aujourd'hui je continue de croire en l'open source. Demain je veux pousser les architectures orientées évènement dans des projets qui ont besoin de scalabilité, typiquement en proposant des outillages comme RxJava ou vert.x.\n\nBlog: http://arkey.pro\n\nDavid Wursteisen\nDavid s'est rapidement intéressé à l’eXtreme Programming et est devenu un « Test Addicted » !\n\nPour lui le développement logiciel n'est pas qu'une affaire de technique. Son rôle est d'aider ses clients à prendre en compte d'autres aspects pour que leurs développements informatiques ne soient plus un frein à leur activité mais un atout.\n\nBlog: http://blog.soat.fr/author/david-wursteisen/", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "rxjava-from-future-to-rx", "length": "30:46", "likes": "3", "recorded": "2016-06-08", "short_description": "Les applications sont de plus en plus interconnectées. Une architecture type WOA (Web Oriented Architecture) et l’utilisation de", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/TT8TLS2Ac0o/hqdefault.jpg", "title": "RxJava - From Future To Rx", "tweet_video": "RxJava%20-%20From%20Future%20To%20Rx%20https%3A//codeandtalk.com/v/devoxx-france-2015/rxjava-from-future-to-rx%20presented%20%40DevoxxFR", "videos": [{"code": "TT8TLS2Ac0o", "type": "youtube"}], "views": "240"}