{"description": "Chez Booking.com, un flux constant d'événements provient des différents systèmes et applications internes. Ces \"events\" sont des données critiques, et doivent être stockés pour être analysés en temps réel, ou bien sur du moyen et long terme. Ces données sont très peu structurées et de nature changeante, rendant difficile l'utilisation d'outils standards d'analyse.Cette présentation montre comment fut construit un système de stockage complet avec analyse temps-réel, basé sur Riak.Riak est une base de donnée NoSQL distribuée hybride très robuste et rapide.Les points abordés seront: sérialisation et aggrégation des données, la configuration de Riak, les solutions pour diminuer la consommation de bande passante du cluster, l'implémentation de l'analyse temps-réel grace aux fonctions avancées de Riak: MapReduce, Secondary Indexes, commit-hooks.\n\n\nAuthor:\nDamien Krotkine\nDamien Krotkine is a software engineer at Booking.com (world’s leading online hotel and accommodation reservations company). He currently works on the events subsystem, where he helps gathering, storing, managing and analyzing big quantities of data in real-time.\n\nPreviously, he has been working in various fields like Linux Distribution, e-commerce, online real-time advertising.\n\nHe's an active member of the Perl community, maintaining some NoSQL related modules ( Redis driver, Riak client, Bloomd client ... )", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "stockage-et-analyse-temps-reel-devenements-avec-riak-chez-bookingcom", "length": "51:44", "likes": "0", "recorded": "2016-06-08", "short_description": "Chez Booking.com, un flux constant d'événements provient des différents systèmes et applications internes. Ces events sont des d", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/jzrSdDfcy2k/hqdefault.jpg", "title": "Stockage et analyse temps réel d'événements avec Riak chez Booking.com", "tweet_video": "Stockage%20et%20analyse%20temps%20r%C3%A9el%20d%27%C3%A9v%C3%A9nements%20avec%20Riak%20chez%20Booking.com%20https%3A//codeandtalk.com/v/devoxx-france-2015/stockage-et-analyse-temps-reel-devenements-avec-riak-chez-bookingcom%20presented%20%40DevoxxFR", "videos": [{"code": "jzrSdDfcy2k", "type": "youtube"}], "views": "94"}