{"description": "Postgres SQL is a plain old SQL DB. Very powerful and very consistent, in some case, project needs an ACID database, but schemaless… With JSON support, postgres is a very interesting tool to provide ACID and some very interesting function (time management, localisation function and data types...) and the schemaless noSQL point of view with json and indexed json. This talk show some great usage and some insigth to build some great application with postgres.\n\n\nAuthor:\nQuentin Adam\nClever Cloud help you to solve definitively the hosting on your projects : just push your app, it work! \n\nI'm a web fan entrepreneur.\nWork on innovative technologies, cloud computing, and social interactions.\nI come from the tech part of the web, but now i have some marketing, commercial or strategies skills.\n\nSpécialisations : java,  javascript, actionscript,  apache,  bind,  bsd,  ccna,  css,  customer relations,  dhcp,  dns,  flash, ldap,  linux,  macintosh os,  unix,  vision,  xhtml,  cloud, JVM, entrepreneurship, strategy, web, SI, HTML5, open web, API design, data modelisation, management", "event": {"name": "Devoxx France 2015", "nickname": "devoxx-france-2015", "twitter": "DevoxxFR", "url": "https://www.devoxx.fr/2015/index.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "why-postgres-sql-deserve-nosql-fan-respect", "length": "47:24", "likes": "1", "recorded": "2016-06-08", "short_description": "Postgres SQL is a plain old SQL DB. Very powerful and very consistent, in some case, project needs an ACID database, but schemal", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/SsQ6Aw9kPpw/hqdefault.jpg", "title": "Why postgres SQL deserve noSQL fan respect", "tweet_video": "Why%20postgres%20SQL%20deserve%20noSQL%20fan%20respect%20https%3A//codeandtalk.com/v/devoxx-france-2015/why-postgres-sql-deserve-nosql-fan-respect%20presented%20%40DevoxxFR", "videos": [{"code": "SsQ6Aw9kPpw", "type": "youtube"}], "views": "125"}