{"description": "Dataskydd.NET is a Swedish organisation registered in 2015. Prior to official registration Dataskydd.NET has been the only Swedish language website posting continuous updates on the European data protection reform since autumn 2012. Dataskydd.NET works to promote data protection and privacy in law, as well as in technologies.\n\nSince autumn 2014, Dataskydd.NET has a particular focus on municipal level involvement in data protection law and technologies. While the results of our original running through of municipal websites is anything but encouraging, there are some notable challenges:\n\n- Even municipalities that are willing to make privacy-preserving investments are unable to get clear advise on what the law says, and how it is means to be applied, from government authorities.\n- A non-zero number of municipalities have implemented proper privacy-protections against third-party disclosure of website visitor behaviour, in spite of poor advise from the government.\n- There is a substantial lack of guidance for municipalities that want to take a step in the right direction, and a lot of commercial efforts to get municipalities to take steps in the wrong direction.\n\nWe will present our \"privacy protecting municipal websites\" project at FSCONS 2015, including:\n\n- our ready-made handbook with ideological and technical advice to municipalities.\n- our tools for monitoring website privacy compliance in Sweden.\n- simple principles for web developers to keep in mind when they are interacting with clients and the world. \n\nPrivacy defeatism is no longer sexy - it's time to put in that extra sweat that makes it possible for everyone to enjoy data privacy even as they're browsing the web. We will present why this is both simple and achievable.\n\nDownload video: https://fscons.org/videos", "event": {"name": "FSCONS 2015", "nickname": "fscons-2015", "twitter": "fscons", "url": "https://fscons.org/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "dataskyddnet-data-protection-for-websites-made-simple-fscons-2015", "length": "30:56", "likes": "0", "recorded": "2015-11-07", "short_description": "Dataskydd.NET is a Swedish organisation registered in 2015. Prior to official registration Dataskydd.NET has been the only Swedi", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/e58DwnjSjGE/hqdefault.jpg", "title": "Dataskydd.NET: Data protection for websites made simple (FSCONS 2015)", "tweet_video": "Dataskydd.NET%3A%20Data%20protection%20for%20websites%20made%20simple%20%28FSCONS%202015%29%20https%3A//codeandtalk.com/v/fscons-2015/dataskyddnet-data-protection-for-websites-made-simple-fscons-2015%20presented%20%40fscons", "videos": [{"code": "e58DwnjSjGE", "type": "youtube"}], "views": "16"}