{"abstract": "https://confengine.com/agile-india-2016/proposal/1623", "description": "Great teams make great products, but what fuels this greatness? It's the common understanding and passion for the product but more importantly the singularity of purpose and the feedback loop and how the users are responding to the teams work. \n\nThe new world of product development is no longer about scope management and delivering the project on time and within budget but it's now more about hypothesis validation and learning from the users and their behaviors.\n\nThe dynamics of product development is changing.  As more and more organizations are moving towards maturing their agile software development approach the traditional barriers of roles are being broken creating new opportunities and fostering a shift in the mindset. Instead of being tied down to scope management and delivering the project on time, Agile teams are focused and inspired by hypothesis validation and learning from the users and their behaviors.\n\nIn this case study we will go over how a portfolio of 12 SCRUM Teams adopted a more outcome approach and how they shifted their mindset from project delivery in Agile way to adopting the Experiment-Measure-Learn-Repeat loop which plays a crucial role in teams overall motivation, performance and moved from being SCRUM Teams to \"Product Teams\".\n\nWe will also see how we experimented with different team formats and how exposing the team members to different events and user research changed the way they perceived the information of the problem they were solving via features and user stories.", "event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "beyond-user-stories-taking-your-team-to-next-level-of-awesome-by-kalpesh-shah", "length": "53:46", "likes": "3", "recorded": "2016-03-14", "short_description": "Great teams make great products, but what fuels this greatness? It's the common understanding and passion for the product but mo", "speaker_twitters": " @AgileBrightSpot", "speakers": {"kalpesh-shah": {"episodes": [], "hosting": [], "info": {"country": "Phoenix, AZ, USA", "name": "Kalpesh Shah", "twitter": "AgileBrightSpot"}, "videos": [{"event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "filename": "beyond-user-stories-taking-your-team-to-next-level-of-awesome-by-kalpesh-shah", "recorded": "2016-03-14", "thumbnail_url": "https://i.ytimg.com/vi/UsMkSHEyltU/hqdefault.jpg", "title": "Beyond User Stories: Taking your Team to Next Level of Awesome !!!"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/UsMkSHEyltU/hqdefault.jpg", "title": "Beyond User Stories: Taking your Team to Next Level of Awesome !!!", "tweet_video": "Beyond%20User%20Stories%3A%20Taking%20your%20Team%20to%20Next%20Level%20of%20Awesome%20%21%21%21%20https%3A//codeandtalk.com/v/agile-india-2016/beyond-user-stories-taking-your-team-to-next-level-of-awesome-by-kalpesh-shah%20presented%20%40agileindia%20by%20%40AgileBrightSpot", "videos": [{"code": "UsMkSHEyltU", "type": "youtube"}], "views": "251"}