{"abstract": "https://confengine.com/agile-india-2016/proposal/2065", "blasters": ["conferences"], "description": "<h3>Sounds starts to be good at 2:30</h3>\n\nFive years ago, <a href=\"https://twitter.com/jackerhack\">Kiran Jonnalagadda</a> and I started to build <a href=\"https://hasgeek.com/\">HasGeek</a> with the belief that there is need for conversations and communities around more and more focussed technology topics.\nWe were clear that we wanted build technology communities and drill focus in every conference we'd launch under the HasGeek banner.\n<p>\nWe were also determined to build the conferences and business in line with the following principles:\n<p>\nContent is always independent of sales.\nIn other words, sponsors are not entitled to speak by virtue sponsoring at the conference.\nIndividuals are invited to propose a talk.\nNo one is \"invited\" to \"speak\" (neither is proposing a guarantee to speak).\nAll proposers have to go through rigorous scrutiny in order to make it on the stage.\n<p>\nSpeakers have to speak about open source technology and ensure there is a concrete takeaway for the audience in terms of insight or practice.\nFinally, participants are the primary customers.\nSponsors are secondary.\nConsequently, participants' privacy is key for the conference's goodwill.\nTheir data will not be shared without their permission.\nFive years down and we have been agile and slow in various aspects of organizing conferences and building our business.\n<p>\nIn this talk, we will share what it takes to build a startup in an agile and expedient manner around assets such as goodwill, trust and networks.\nGoodwill, trust and networks are critical for any startup's success.\nThe key takeaway for the audience is to identify their strategies and practices for building these assets and build a business or community or both in an agile manner.\n<p>\n<ul>\n   <li><a href=\"https://en.wikipedia.org/wiki/BarCamp\">BarCamp</a></li>\n   <li>Where do developer go to have conversation about their technology?</li>\n   <li>Institutional knowledge got lost as the organizers changed from event to event, year to year.</li>\n   <li>Each conference has a clear focus, and clear intended audience.</li>\n   <li>Each conference has only a single track. So the conversation is focused.</li>\n   <li>Curating Conversation: Conference editorial: First hand picked speakers, then the community started to vote which talks and speakers they want to hear?</li>\n   <li>Later editorial pannel created from members of the community.</li>\n</ul>\n\nTalks about the \"why\" and \"why not\" instead of the \"how\" that can be found on the Internet.\n\nHow do you make the conference participants to be active and contribute.\n\n", "event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "favorite": "0", "featured": "2016-12-28", "file_date": "2016-12-03", "filename": "building-a-startup-around-conversations-and-communities-by-zainab-bawa", "length": "43:41", "likes": "0", "recorded": "2016-03-14", "short_description": "Sounds starts to be good at 2:30 Five years ago, Kiran Jonnalagadda and I started to build HasGeek with the belief that there is", "speaker_twitters": " @zainabbawa", "speakers": {"zainab-bawa": {"episodes": [], "hosting": [], "info": {"country": "Bangalore, India", "github": "zainabbawa", "home": "https://medium.com/@zainabbawa", "name": "Zainab Bawa", "twitter": "zainabbawa"}, "videos": [{"event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "filename": "building-a-startup-around-conversations-and-communities-by-zainab-bawa", "recorded": "2016-03-14", "thumbnail_url": "https://i.ytimg.com/vi/a_eS9T5OxP4/hqdefault.jpg", "title": "Building a startup around conversations and communities"}]}}, "tags": [{"link": "conferences", "text": "conferences"}], "thumbnail_url": "https://i.ytimg.com/vi/a_eS9T5OxP4/hqdefault.jpg", "title": "Building a startup around conversations and communities", "tweet_video": "Building%20a%20startup%20around%20conversations%20and%20communities%20https%3A//codeandtalk.com/v/agile-india-2016/building-a-startup-around-conversations-and-communities-by-zainab-bawa%20presented%20%40agileindia%20by%20%40zainabbawa%20%23conferences", "videos": [{"code": "a_eS9T5OxP4", "type": "youtube"}], "views": "36"}