{"abstract": "https://confengine.com/agile-india-2016/proposal/2028", "description": "There are so many stories in the market of both successful pivoting and failure cases. Some see Pivoting as the backfire of shallow design and result of not having thought through before launch. However, most see Pivoting as a powerful tool used by wise developers and product owners to retain their acquired customers.\n\nWhatever may be the reason - its not news that businesses evolve, change and PIVOT. As Alan Spoon says -\n\n“Pivoting” is a familiar word in the startup world.  When your first business model isn’t working (and this happens more often than not), the CEO and team pivot to plan B.  These are deep breath moments! But pivoting doesn’t necessarily mean desperation.  It can be a tool to discover additional growth--growth you might otherwise have overlooked. Businesses can grow beyond their initial dreams by re-imagining their assets and talents, thinking more broadly about the customer problems they solve, and accessing growth capital to seize the new high ground.\n\nKeeping this understanding of Pivoting in the background, we at PoolWallet are proud to share our story of launch, growth, not so good growth, how we found our key bottlenecks (Any guesses how many users we interviewed?) and what were our conclusions and how much we decided to pivot. How we validated our thoughts on Pivoting (ever tried talking to an investor?). Basically trying to share with you our launch, less than good response, re-launch, validations we took seriously, feedbacks we kept aside and results of the same. All of this with minimum budget spend.", "event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "fail-fast-pivot-faster-by-smita-mishra", "length": "48:57", "likes": "0", "recorded": "2016-03-14", "short_description": "There are so many stories in the market of both successful pivoting and failure cases. Some see Pivoting as the backfire of shal", "speaker_twitters": " @smita_qazone", "speakers": {"smita-mishra": {"episodes": [], "hosting": [], "info": {"country": "New Delhi, India", "home": "http://www.qazone.in/", "name": "Smita Mishra", "twitter": "smita_qazone"}, "videos": [{"event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "filename": "fail-fast-pivot-faster-by-smita-mishra", "recorded": "2016-03-14", "thumbnail_url": "https://i.ytimg.com/vi/hbcgY1cipk0/hqdefault.jpg", "title": "Fail Fast Pivot Faster"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/hbcgY1cipk0/hqdefault.jpg", "title": "Fail Fast Pivot Faster", "tweet_video": "Fail%20Fast%20Pivot%20Faster%20https%3A//codeandtalk.com/v/agile-india-2016/fail-fast-pivot-faster-by-smita-mishra%20presented%20%40agileindia%20by%20%40smita_qazone", "videos": [{"code": "hbcgY1cipk0", "type": "youtube"}], "views": "69"}