{"abstract": "https://confengine.com/agile-india-2016/proposal/1934", "description": "Getting teams to do agile is a beginning; getting it scaled to enterprise is progress; becoming agile at the portfolio and business level is success. How do we get pass the team level to program management level. Scaling agile frameworks comes to the rescue. Or do they ? Many product companies are tied down by stage gate processes coming from the era of Cooper's product development aproaches. They are good and are needed. But they can be an obstacle if they hamper business agility. \n\nUnderstanding the purpose and spirit of stages, gates and milestones are key to aligning with Agile. Often they are linked to project management controls and the need for marketing to be sure of meeting target dates. But these become counter productive if its still a scrum-fall at the ends. Since regulated industries still require stage-gated approaches to conform to constraints in their QMS and business needs, agile principles and the stage gate need to exist side by side.\n\nIn this experience report, you will get to learn how the advantages of stage gates can be leveraged while at the same time achieving the goals of agile in an effective way. This is not agile at the team level where we have teams executing agile, but at the product development - portfolio level. How are the efforts and releases coordinated and orchestrated keeping in mind the constraints of stage gates and milestones.", "event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "how-to-become-business-agile-by-vineed", "length": "27:30", "likes": "0", "recorded": "2016-03-14", "short_description": "Getting teams to do agile is a beginning; getting it scaled to enterprise is progress; becoming agile at the portfolio and busin", "speaker_twitters": " @Vineet_Bhatia", "speakers": {"vineed": {"episodes": [], "hosting": [], "info": {"country": "London, UK", "home": "http://www.vineetbhatia.london/", "name": "Vineed", "twitter": "Vineet_Bhatia"}, "videos": [{"event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "filename": "how-to-become-business-agile-by-vineed", "recorded": "2016-03-14", "thumbnail_url": "https://i.ytimg.com/vi/-ibQ5zQgLyw/hqdefault.jpg", "title": "How to become business agile"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/-ibQ5zQgLyw/hqdefault.jpg", "title": "How to become business agile", "tweet_video": "How%20to%20become%20business%20agile%20https%3A//codeandtalk.com/v/agile-india-2016/how-to-become-business-agile-by-vineed%20presented%20%40agileindia%20by%20%40Vineet_Bhatia", "videos": [{"code": "-ibQ5zQgLyw", "type": "youtube"}], "views": "39"}