{"abstract": "https://confengine.com/agile-india-2016/proposal/1916", "description": "The CIO invited me into his office and closed the door. Before he took me for a tour of his operation, he had a few stories to share. Important stories. Last year’s project was a disaster. Late, lots of quality issues, in short, a failure in every dimension. His boss, the CEO, had just presented him with a very personal ultimatum: deliver the next project by April 4th, \"or else\". \n\n\"Or else what,\" I asked?\n\nHis team was burned out and scared. They were a hard-working and dedicated group, but fear and demoralization had set in and he didn't know what to do next. That’s why he wanted to talk to me, he had heard things about my company, things that seemed too good to be true, but he had to hear them firsthand. He wanted hope, inspiration, and a practical way to get there.\n\nI told him about my own journey from joy to fear to disillusionment back to joy. It was simple, but, of course, simple isn’t easy. I wasn’t sure he and his organization were ready; \"manufactured fear\" is a powerful drug.\n\nIn this talk, I will share with you what I shared with him. I will explore what an intentionally joyful culture must choose as its focus. I will discuss what joy looks like, feels like, how it is organized. Along the way, you will be confronted by paradoxical approaches of how workplace noise increases productivity, how two people at one computer outperforms hero-based organizations 10-to-1, how rigor and discipline emanate from a shared-belief system, how transparency conquers fear, how all of the disciplines you study including agile, lean, and six sigma when done well are really about building human relationships at the intersections of business and technology, between project management and software development, between development and design and how quality can be a natural result of a team built on trust. This is not a theoretical talk, but rather a talk built from well over a decade of experience of leading a team focused on “the business value of joy”. There will be lots of room for discussion with the audience. The audience will begin to understand why thousands of people make the journey to Ann Arbor, Michigan every year to see The Menlo Software Factory firsthand, and why so many more are reading about it in Joy, Inc. – How We Built A Workplace People Love.", "event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "keynote-build-a-workplace-people-love-just-add-joy-by-richard-sheridan-at-agile-india-2016", "length": "01:03:49", "likes": "0", "recorded": "2016-03-14", "short_description": "The CIO invited me into his office and closed the door. Before he took me for a tour of his operation, he had a few stories to s", "speaker_twitters": " @menloprez", "speakers": {"richard-sheridan": {"episodes": [], "hosting": [], "info": {"country": "MI, USA", "home": "http://www.menloinnovations.com/joyinc/", "name": "Richard Sheridan", "twitter": "menloprez"}, "videos": [{"event": {"name": "Agile India 2016", "nickname": "agile-india-2016", "twitter": "agileindia", "url": "http://2016.agileindia.org/"}, "filename": "keynote-build-a-workplace-people-love-just-add-joy-by-richard-sheridan-at-agile-india-2016", "recorded": "2016-03-14", "thumbnail_url": "https://i.ytimg.com/vi/Xhzg0XWFq4Y/hqdefault.jpg", "title": "Keynote: Build a Workplace People Love – Just add Joy"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/Xhzg0XWFq4Y/hqdefault.jpg", "title": "Keynote: Build a Workplace People Love – Just add Joy", "tweet_video": "Keynote%3A%20Build%20a%20Workplace%20People%20Love%20%E2%80%93%20Just%20add%20Joy%20https%3A//codeandtalk.com/v/agile-india-2016/keynote-build-a-workplace-people-love-just-add-joy-by-richard-sheridan-at-agile-india-2016%20presented%20%40agileindia%20by%20%40menloprez", "videos": [{"code": "Xhzg0XWFq4Y", "type": "youtube"}], "views": "439"}