{
  "description": "DrupalSouth Gold Coast 2016\nhttps://goldcoast2016.drupal.org.au/\n\nBackdrop CMS: What I love about it as a site builder. How is it different from Drupal 7 and 8.\nRoom: Doghouse Agency (Level 2)\nFri, 28-Oct, 11:30\nIntermediate - Building\nGrigorios Netsas\n\nI was first introduced to the world of Drupal about 7 years ago when I started building a website for my own business. I have been a member of the community ever since and I am known in d.org as klonos. I mainly hang around the issue queues helping triage issues as well as providing guidance to newcomers. I enjoy testing new features, trying to \"kick the tires\" and find bugs. I then return to the issue queues either to report the bugs or (recently) to file pull requests fixing the issues. Site building is not my primary means of income - I am a Computer & Network Engineer by trade. In fact, I simply build small sites for friends and family and some of my customers. I consider myself just a CMS enthusiast. Others prefer to have a beer over barbie while watching footie in their free time. I do Drupal and Backdrop. That's my thing.\n\nI have been following the Backdrop CMS project since the first week the fork was announced and at some point a few months ago I was nominated to become a member of the Project Management Committee, representing the non-coder, site builder part of the community. I am thrilled to hold such an important role and although my time is very limited, I have made a promise to try my best to be worthy of this great honor.\n\nDuring this session I will talk about and demonstrate to my fellow site builders all the new features and user experience improvements that we have implemented over the past couple of years. I will also talk about our roadmap and about the ideas that we have to improve Backdrop. I will explain how things are different in Backdrop compared to Drupal 7 and 8 and will be more than happy to answer any of their questions as time permits.\n\nIf you are a beginner to intermediate site builder with some experience in Drupal and would like to explore ways to make your life easier, this session is for you. Also, if you already own a Drupal 7 website and are concerned about the end of support after Drupal 9 is released, but at the same time you do not have the budget, time or energy to upgrade to Drupal 8, then also this session is for you. Come join us.\n\nhttps://goldcoast2016.drupal.org.au/session/backdrop-cms-what-i-love-about-it-site-builder-how-it-different-drupal-7-and-8",
  "recorded": "2016-10-26",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/I7HwaJE8Z0Q/hqdefault.jpg",
  "title": "Session: \"Backdrop CMS: What I love about it as a site builder. How is it different\" by G. Netsas",
  "videos": [
    {
      "code": "I7HwaJE8Z0Q",
      "type": "youtube"
    }
  ]
}