{
    "description": "DrupalSouth Gold Coast 2016\nhttps://goldcoast2016.drupal.org.au/\n\nMedecins Sans Frontieres Australia - A Drupal Case Study\nRoom: Acquia (Level 2)\nFri, 28-Oct, 11:30\nIntermediate - Planning\nDuarte Garin\n\nA while ago Digital Garden launched the new Medicines Sans Frontieres (Doctors without Borders) website in Drupal and we would like to share this case study with the community. As we are UX focused digital agency we will be presenting our process from initial discovery, prototyping in Axure to design and frontend development, while focusing on Drupal best practices.\n\nWe will detail our approach to design and frontend development as it’s focused on design components rather than page templates and how that can be leveraged with things like Paragraphs. The main sections of the presentation would be: \n\nDiscovery - A collaborative process leveraging Drupal’s focus on a content first approach, persona development and user journey mapping as well as all the work from an information architecture perspective\n\nPrototyping - Developing interactive, high fidelity prototypes to detail all the user journeys and interaction with the website. Also discussing the advantages of a high-fidelity prototype to allow things like effective user testing.\n\nDesign - Present our mobile first approach to design, focusing on components rather than pages and creating a comprehensive style-guide detailing our component library\n\nDevelopment - Present the frontend approach to the project as well as how we managed to implement the component approach to content managed through the use of modules like Paragraphs. Discuss the frontend tools used to create a mobile first theme and workflow from design to testing.\n\nDeployment - Discuss the used deployment workflow strategy for the projectThis was a very interesting project for us and it’s exciting to see MSF worldwide switching Drupal, so we are keen to share the experience with the community.\n\nhttps://goldcoast2016.drupal.org.au/session/medecins-sans-frontieres-australia-drupal-case-study",
    "favorite": "0",
    "length": "48:47",
    "likes": "0",
    "recorded": "2016-10-26",
    "speakers": [
        "duarte-garin"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/cpx2VGcQVOE/hqdefault.jpg",
    "title": "Medecins Sans Frontieres Australia - A Drupal Case Study",
    "videos": [
        {
            "code": "cpx2VGcQVOE",
            "type": "youtube"
        }
    ],
    "views": "51"
}