{
  "description": "DrupalSouth Gold Coast 2016\nhttps://goldcoast2016.drupal.org.au/\nSession: \"Module a Week or: How I Learned to Stop Worrying and Love the Open Source\"\n\nRoom: Realityloop (Level 2)\nThu, 27-Oct, 11:30\nBeginner - Inventing\nDave Sparks & Dan Morrison and others\n\nSparks Interactive have been working with Drupal for almost 10 years (since 4.7!) and were among the first bringing Drupal projects live for NZ Government and commercial clients in our local markets. We’ve supported conferences, meetups and code sprints with cash and kind all along they way and champion Drupal as our first and only website content management framework.\n\nYet we have also always been a client services company, engaging with clients and building websites for them, in exchange for money. In common with many of our peers we depend on billable hours for our cashflow, and run lean in a small local market which sees a lot of ups and downs. Contributions back to the community have been largely developer led, dependent on individual initiative and as a consequence sporadic and sparsely supported.\n\nWe’ve tried many ways over the years to change this, with mixed success. It seemed that nothing less than a fundamental rethink of everything, from workflow, to business model, to individual work habits and how we talk to one another, would make good on the change we all wanted to see.\n\nSo that’s what is happening.\n\nTo surface that we're committing to submitting a Module a Week for the rest of 2016. \n\nThis talk will feature perspectives from the business owner (Dave Sparks), technical lead (Dan Morrison), and other Sparks’ team members in a multi-handed talk that will be an honest opening up about the process of opening our work and embracing open source as more than just a way of describing software.\n\nhttps://goldcoast2016.drupal.org.au/session/module-week-or-how-i-learned-stop-worrying-and-love-open-source",
  "recorded": "2016-10-26",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/OrpZzVMcQV8/hqdefault.jpg",
  "title": "Session: \"Module a Week or: How I Learned to ... Love the Open Source\" by  Dave Sparks,...",
  "videos": [
    {
      "code": "OrpZzVMcQV8",
      "type": "youtube"
    }
  ]
}