{
  "description": "Room: Acquia (Level 2)\nThursday, 27-Oct-2016, 10:30\nBeginner - Planning\nPamela Barone\n\nLet's be honest: Estimation is guessing. Ideally, we're making educated guesses and we're pretty confident. But the secret to nailing estimates is not in perfecting the art of guessing. It's in perfecting the art of definition.\n\nWhen estimates go horribly wrong, it's usually not because the thing took longer than we thought. It's because the thing we thought we were estimating turned into something else entirely.\n\nHave you ever had a really simple request from a client turn into an absolute nightmare? And it left you wondering, \"How on earth did this happen?\"\n\nMost likely, it was a lack of clarity on exactly what you were estimating. That might seem really obvious, but as Drupal experts, it's really easy for us to overlook things, or assume clients know what we know. It was clear to you and your team, and it was clear to your client, but \"it\" was completely different for each of you. \n\nI'll review some of my worst estimating disasters to arrive at simple strategies for how to avoid them. Rather than actually improving your estimation skills, it's about improving your client translation skills, to figure out exactly what you're supposed to be delivering. \n\nThis session is aimed at anyone involved with estimating things, whether you're a PM struggling with this, a developer frustrated by it, or a client who wants to better understand it.\n\nFamiliarity with Drupal is not required to follow the session, but Drupal expertise is definitely required in order to execute it properly.\n\nhttps://goldcoast2016.drupal.org.au/session/why-estimations-go-wrong-and-how-avoid-it",
  "recorded": "2016-10-26",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/z8XJ3Qj3Bjo/hqdefault.jpg",
  "title": "Session: \"Why estimations go wrong and how to avoid it\" by  Pamela Barone",
  "videos": [
    {
      "code": "z8XJ3Qj3Bjo",
      "type": "youtube"
    }
  ]
}