{"description": "Raspberry Pi ist ein Mini-PC von der Größe einer Kreditkarte der für unter 40 Euro erworben werden kann. Das Internet ist voll von Informationen, Ideen und Anleitungen rund um die Hardware. Mein Vortrag wird von der Anwendung als Home Theater Personal Computer, kurz HTPC, handeln. Dabei sind keine Vorkenntnisse erforderlich, man muss noch nicht einmal Linux Erfahrung mitbringen. Ähnlich wie bei Android läuft das System mit Linux, aber der Benutzer arbeitet mit der intuitiven grafischen Oberfläche bzw. der Applikation XBMC. Der Vortrag beginnt mit der Vorstellung der Hardware und welche Komponenten zum Betrieb noch zusätzlich benötigt werden. Danach wird gezeigt, wie man das System auf einem Windows- und Linux-System installiert. Die Oberfläche der HTPC Software XBMC wird vorgestellt und einige Funktionen und Add-ons näher erläutert. Der Vortrag ist auch für Leute geeignet die sich nur für XBMC interessieren, da nur wenige Teilbereiche Raspberry Pi spezifisch sind.\n\nhttp://glt13-programm.linuxtage.at/events/178.de.html", "event": {"name": "Grazer LinuxTage 2013", "nickname": "grazer-linuxtage-2013", "twitter": "linuxtage", "url": "https://glt13.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "raspberry-pi-als-htpc-mit-xbmc-martin-strohmayer", "length": "46:39", "likes": "5", "recorded": "2013-04-20", "short_description": "Raspberry Pi ist ein Mini-PC von der Größe einer Kreditkarte der für unter 40 Euro erworben werden kann. Das Internet ist voll v", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/4Jhj8L80zac/hqdefault.jpg", "title": "Raspberry Pi als HTPC mit XBMC - Martin Strohmayer", "tweet_video": "Raspberry%20Pi%20als%20HTPC%20mit%20XBMC%20-%20Martin%20Strohmayer%20https%3A//codeandtalk.com/v/grazer-linuxtage-2013/raspberry-pi-als-htpc-mit-xbmc-martin-strohmayer%20presented%20%40linuxtage", "videos": [{"code": "4Jhj8L80zac", "type": "youtube"}], "views": "1902"}