{"description": "Bryan Hunter\n\nElixir is an expressive functional programming language that has borrowed a great deal from Ruby, Clojure, Python, and Node.js. Node with its sweetspot of rapidly producing back-ends has taken over the world, and it has had countless successes. Node isn’t right for all problems though. Many Node developers who have found themselves outside of its sweetspots are discovering that Elixir makes a great lifeline, and they’re embracing a polyglot approach. Wow? Why Elixir?\n\nElixir delivers familiar modern tooling, simplified distribution, massive concurrency, and carrier grade fault-tolerance. Elixir code runs on the Erlang VM and compiles to the same binary format (BEAM file) as Erlang, so it has zero-penalty access to Erlang libraries including OTP. Just like Erlang, it supports hot code loading and scales beautifully (scales-up to many cores, scales-out to many machines). What does it look like? What are the pieces and the tools? How do I get started? Sound exciting? Good! Come join the fun!", "event": {"name": "Nodevember 2015", "nickname": "nodevember-2015", "twitter": "nodevember", "url": "http://lanyrd.com/2015/nodevember/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "what-every-nodejs-developer-should-know-about-elixir-549848", "length": "34:21", "likes": "24", "recorded": "2015-11-14", "short_description": "Bryan Hunter Elixir is an expressive functional programming language that has borrowed a great deal from Ruby, Clojure, Python, ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/LfAQkSERJiE/hqdefault.jpg", "title": "What every Node.js developer should know about Elixir", "tweet_video": "What%20every%20Node.js%20developer%20should%20know%20about%20Elixir%20https%3A//codeandtalk.com/v/nodevember-2015/what-every-nodejs-developer-should-know-about-elixir-549848%20presented%20%40nodevember", "videos": [{"code": "LfAQkSERJiE", "type": "youtube"}], "views": "3376"}