{"description": "Apart from the question which source code editor is better, few issues get a more heated reception among software engineers than the one whether software should be patentable. This is particularly true in Europe, where the 1978 European Patent Convention (EPC) explicitly forbids patents on \"computer programs as such\". Yet, judicial decisions from the European Patent Office (EPO) and a failed attempt at European legislation have turned this seemingly clear phrase into a quagmire.\nIn the USA anything under the sun can be patented: the USPTO granted no less than 145,000 patents on software inventions in the late nineties and early naughts. The quality of these patents was notoriously low, thanks to nonexistent prior art databases and a self-imposed limit of about eight hours for examiners to search and judge a patent application. Still, many of these patents were upheld in courts and actively enforced, thus proving to many that software patents were a significant threat to innovation in the field of software. In addition, the US legal landscape has created business opportunities for so-called patent trolls, that do not produce or contribute anything themselves, but use patents to extract money from true innovators.\nIn this presentation IT-lawyer and patent attorney Arnoud Engelfriet will discuss software patents: what are they, how is it possible they are being granted, what do the courts say about software patents and how can software engineers and open source projects deal with them? If you think software patents are illegal in Europe or that open source can never infringe a software patent, you should definitely attend.", "event": {"name": "T-DOSE 2012", "nickname": "t-dose-2012", "twitter": "TDOSE", "url": "http://www.t-dose.org/2012/schedule"}, "favorite": "0", "file_date": "2016-12-03", "filename": "t-dose-2012-open-source-arnoud-engelfriet-software-patents-whats-the-problem", "length": "01:02:03", "likes": "3", "recorded": "2012-10-27", "short_description": "Apart from the question which source code editor is better, few issues get a more heated reception among software engineers than", "speaker_twitters": "", "speakers": {"arnoud-engelfriet": {"episodes": [], "hosting": [], "info": {"name": "Arnoud Engelfriet"}, "videos": [{"event": {"name": "T-DOSE 2008", "nickname": "t-dose-2008", "twitter": "TDOSE", "url": "http://www.t-dose.org/2008/schedule"}, "filename": "t-dose-2008-gplv3-compliance-arnoud-engelfriet-ywein-van-den-brande", "recorded": "2008-10-25", "thumbnail_url": "https://i.ytimg.com/vi/zvoVE8J_vj8/hqdefault.jpg", "title": "GPLv3 compliance"}, {"event": {"name": "T-DOSE 2012", "nickname": "t-dose-2012", "twitter": "TDOSE", "url": "http://www.t-dose.org/2012/schedule"}, "filename": "t-dose-2012-open-source-arnoud-engelfriet-software-patents-whats-the-problem", "recorded": "2012-10-27", "thumbnail_url": "https://i.ytimg.com/vi/X6SjVVg8k7k/hqdefault.jpg", "title": "Software patents, what's the problem?"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/X6SjVVg8k7k/hqdefault.jpg", "title": "Software patents, what's the problem?", "tweet_video": "Software%20patents%2C%20what%27s%20the%20problem%3F%20https%3A//codeandtalk.com/v/t-dose-2012/t-dose-2012-open-source-arnoud-engelfriet-software-patents-whats-the-problem%20presented%20%40TDOSE", "videos": [{"code": "X6SjVVg8k7k", "type": "youtube"}], "views": "216"}