{"description": "Three types of people will read your CV when you apply for a job: the HR person or recruiter, who's generally non-technical; the hiring manager, who's usually a senior technical person; and the developers sat across from you in the interview, wildly searching through your CV for something interesting to talk about. Your CV needs to speak to all three of them.\n\nThis talk covers how to write a Perl CV that will get you past the HR person or recruiter, and convince them to put you forward for the best roles. It covers how to show the hiring manager that you know Perl well enough to be worth talking to (or are a Perl superstar, depending on what role you're working towards). And finally, it covers giving the interviewing developers enough interesting stuff to talk to you about that they don't fall back on brain-teasers they read on Reddit.", "event": {"name": "London Perl Workshop 2014", "nickname": "london-perl-workshop-2014", "twitter": "LondonPerl", "url": "http://act.yapc.eu/lpw2014/"}, "favorite": "0", "file_date": "2016-12-10", "filename": "lpw2014-peter-sergeant-pete-how-to-write-a-perl-cv-that-will-get-you-hired-mp4-ff", "length": "27:05", "likes": "1", "recorded": "2014-11-08", "short_description": "Three types of people will read your CV when you apply for a job: the HR person or recruiter, who's generally non-technical; the", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/BNRVKngFOCY/hqdefault.jpg", "title": "LPW2014 Peter Sergeant ‎pete‎   ‎How to write a Perl CV that will get you hired‎  mp4 ff", "tweet_video": "LPW2014%20Peter%20Sergeant%20%E2%80%8Epete%E2%80%8E%20%20%20%E2%80%8EHow%20to%20write%20a%20Perl%20CV%20that%20will%20get%20you%20hired%E2%80%8E%20%20mp4%20ff%20https%3A//codeandtalk.com/v/london-perl-workshop-2014/lpw2014-peter-sergeant-pete-how-to-write-a-perl-cv-that-will-get-you-hired-mp4-ff%20presented%20%40LondonPerl", "videos": [{"code": "BNRVKngFOCY", "type": "youtube"}], "views": "256"}