{"abstract": "https://events.drupal.org/dublin2016/sessions/drupal-8s-multilingual-apis-building-entire-world", "description": "Are you interested in writing contributed modules, themes or distributions for Drupal 8? Then this is the session for you. In this session, we'll look at the most important APIs you would use to integrate with and best practices to use to ensure that your project is fully multilingual-ready.\n\nThis session will be valuable to all contributors even those whose projects are not inherently multilingual. Even if your project is not immediately intended to be multilingual, having a multilingual-capable module, theme or distribution makes your solution appealing to a much broader audience and is likely to provide value to global users.\n\nDrupal 8 is a great platform to work with not only because it is so multilingual capable out-of-the-box, but also because you can easily expand while maintaining the translatability of your data. Drupal 8’s multilingual core offers a robust multilingual foundation, making the integration process much more seamless.\n\nThe majority of Drupal 8's APIs are designed to support multilingual by default and make sane assumptions about common scenarios. As a result, there are several important things to keep in mind to build the best integration possible.\n\nIn this session, we will walk through:\n\nWorking with language APIs, and the language your data is in.\n\nMaking your output strings translatable: t() and its friends, but also in twig templates\n\nWhy you should and how to code translatable content entities.\n\nCustomizing your field properties translatability so site builders can choose.\n\nConfiguration translation: translating your configuration entities\n\nIntended Audience\n\nDrupal developers working with contrib or custom modules that are designed for multilingual or non-English sites would benefit from this session (that means nearly every Drupal developer out there).\n\nDrupal themers intending to make their theme templates translation ready.\n\nAttendees will walk away with knowledge to add Drupal 8 multilingual support to your modules, themes and distributions.\n\nSkill Levels\n\nThis session is suitable for beginners or intermediate Drupal users. It is best if you come to the session with some exposure to OOP, Drupal 8 code and twig templates, but even if you don’t have that foundation I’m sure you can catch up.\n\nImproving Drupal Multilingual\n\nTo make multilingual Drupal 8 APIs even better, please get involved with the Drupal 8 Multilingual Initiative! You can also sprint with us before, during, and after the main DrupalCon Dublin session days. You do not need to know how to code to help. Testers, reviewers, writers, and designers are very welcome.\n\nAbout the Speaker\n\nChristian López (penyaskito on Drupal.org) works at Lingotek - The Translation Network, writing their open source integration for Drupal 8. This integration provides Drupal users the ability to extract their data and content and translate it using a cloud-based translation management system. This workflow pushed the development team to test the limits of the Drupal 8 multilingual APIs.\n\nChristian has presented about Drupal 8’s multilingual capabilities at several camps around Europe. He is a frequent speaker at Spanish DrupalCamps and presented at international events like Drupal Dev Days 2016 (Milano, Italy), DrupalNorth 2016 (Montreal, Canada), DrupalCamp Leuven 2015 (Belgium), Drupalaton 2015 (Hungary) or DrupalCamp Vienna 2015 (Austria).\n\nChristian has been a contributor to the Drupal 8 Multilingual Initiative since Drupal Dev Days in Barcelona in 2012.", "event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-dublin-2016-drupal-8s-multilingual-apis-building-for-the-entire-world", "length": "48:38", "likes": "4", "recorded": "2016-09-26", "short_description": "Are you interested in writing contributed modules, themes or distributions for Drupal 8? Then this is the session for you. In th", "speaker_twitters": " @penyaskito", "speakers": {"christian-lopez-espinola": {"episodes": [], "hosting": [], "info": {"country": "Seville, Spain", "github": "penyaskito", "home": "http://penyaskito.com/", "name": "Christian López Espínola", "twitter": "penyaskito"}, "videos": [{"event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "filename": "drupalcon-dublin-2016-drupal-8s-multilingual-apis-building-for-the-entire-world", "recorded": "2016-09-26", "thumbnail_url": "https://i.ytimg.com/vi/ldwKLMyEA30/hqdefault.jpg", "title": "Drupal 8's Multilingual APIs: Building for the Entire World"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/ldwKLMyEA30/hqdefault.jpg", "title": "Drupal 8's Multilingual APIs: Building for the Entire World", "tweet_video": "Drupal%208%27s%20Multilingual%20APIs%3A%20Building%20for%20the%20Entire%20World%20https%3A//codeandtalk.com/v/drupalcon-dublin-2016/drupalcon-dublin-2016-drupal-8s-multilingual-apis-building-for-the-entire-world%20presented%20%40drupalconeur%20by%20%40penyaskito", "videos": [{"code": "ldwKLMyEA30", "type": "youtube"}], "views": "344"}