{"abstract": "https://events.drupal.org/dublin2016/sessions/when-good-good-enough-how-perfectionism-holding-you-back", "description": "Hello. My name is Derek, and I'm a recovering perfectionist. Today I'm here to share my story. It is a tale of woe and passion and joy and redemption.\n\nDo you belong in a room of recovering perfectionists? The first step is admitting to a problem. You know you're a perfectionist if:\n\nYour co-workers think you are brilliant but never want to work with you.\nYou avoid tasks in which success is uncertain, and you abandon ones that don't go as planned.\nYou reject pull requests when function summaries don't start with a third-person, singular, present-tense verb.\nYou can't seem to give feedback without coming off as critical.\nYou frequently receive positive feedback but don't take it to heart.\nYou find yourself frustrated at the end of almost every day.\nWe'll review some of the archetypal character defects that lead to perfectionism and how they might affect your code, your job, your business, and your life. Most vitally, I'll talk about how I came to accept these shortcomings and in doing so found freedom from them. Finally, we'll see how these lessons apply to the Drupal community and can lead to healthier, safer, more effective interactions at every level. Come along on a magical journey where I share my experience, strength and hope about finding good (with generous measures of peace and sanity) at the expense of perfect. Spoiler: My presentation is going to be awesome and, despite hours of futile attempt at the opposite, riddled with glorious imperfection.", "event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-dublin-2016-when-good-is-good-enough-how-perfectionism-is-holding-you-back", "length": "41:50", "likes": "2", "recorded": "2016-09-26", "short_description": "Hello. My name is Derek, and I'm a recovering perfectionist. Today I'm here to share my story. It is a tale of woe and passion a", "speaker_twitters": "", "speakers": {"derek-deraps": {"episodes": [], "hosting": [], "info": {"country": "Atlanta, GA, USA", "github": "derekderaps", "home": "http://kalmuna.com/", "name": "Derek DeRaps"}, "videos": [{"event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "filename": "drupalcon-dublin-2016-when-good-is-good-enough-how-perfectionism-is-holding-you-back", "recorded": "2016-09-26", "thumbnail_url": "https://i.ytimg.com/vi/y606JlLdvPU/hqdefault.jpg", "title": "When \"Good\" Is Good Enough: How Perfectionism Is Holding You Back"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/y606JlLdvPU/hqdefault.jpg", "title": "When \"Good\" Is Good Enough: How Perfectionism Is Holding You Back", "tweet_video": "When%20%22Good%22%20Is%20Good%20Enough%3A%20How%20Perfectionism%20Is%20Holding%20You%20Back%20https%3A//codeandtalk.com/v/drupalcon-dublin-2016/drupalcon-dublin-2016-when-good-is-good-enough-how-perfectionism-is-holding-you-back%20presented%20%40drupalconeur", "videos": [{"code": "y606JlLdvPU", "type": "youtube"}], "views": "141"}