{"abstract": "https://events.drupal.org/dublin2016/sessions/improving-drupal-contributor-experience", "description": "The Drupal Community Working Group (CWG) upholds the Drupal Code of Conduct in order to maintain a friendly and welcoming community for the Drupal project. Since its inception, the CWG has dealt with numerous issues related to contributor frustration and burnout. The Drupal 8 development cycle in particular resulted in an increased number of reported issues that threatened to undermine morale and productivity within the community. The CWG is concerned that if the root causes of these kinds of issues remain unaddressed, they will continue to surface and ultimately result in fewer people who are motivated to contribute to the Drupal project.\n\nThis session will explore some of the root causes of contributor frustration and burnout in the community and offer some ideas for how to help improve the contributor experience moving forward. As part of our ongoing efforts to maintain documentation and processes focused on the health of the community, the CWG has spent the last few months conducting research, including a survey and interviews of dozens of Drupal contributors, to better understand the issues that they’ve experienced.   \n\nWe will share the results of this research and how it informs our understanding of the problem as well as possible solutions. Some ideas that we will discuss include more formalized mentorship programs, leadership training, better community conflict resolution resources, and more. Instead of focusing on specific technical issues or the behavior of individuals, our goal is to help answer the question, \"What can our community do to improve the experience of contributing to Drupal for everyone?\" \n\nAttendees will not only gain insight into the kinds of issues that people experience when contributing to Drupal and other open source projects, but also learn about some important non-technical tools and techniques that can help improve communication and make it easier for people to become more engaged members of our community.", "event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-dublin-2016-improving-the-drupal-contributor-experience", "length": "52:39", "likes": "3", "recorded": "2016-09-26", "short_description": "The Drupal Community Working Group (CWG) upholds the Drupal Code of Conduct in order to maintain a friendly and welcoming commun", "speaker_twitters": " @gdemet", "speakers": {"george-demet": {"episodes": [], "hosting": [], "info": {"country": "Evanston, IL, USA", "home": "https://www.palantir.net/", "name": "George DeMet", "twitter": "gdemet"}, "videos": [{"event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "filename": "drupalcon-dublin-2016-improving-the-drupal-contributor-experience", "recorded": "2016-09-26", "thumbnail_url": "https://i.ytimg.com/vi/p4hJ5yEGKPc/hqdefault.jpg", "title": "Improving the Drupal Contributor Experience"}, {"event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "filename": "drupalcon-new-orleans-2016-finding-your-purpose-as-a-drupal-agency", "recorded": "2016-05-09", "thumbnail_url": "https://i.ytimg.com/vi/r0tqzEXeRQA/hqdefault.jpg", "title": "Finding Your Purpose as a Drupal Agency"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/p4hJ5yEGKPc/hqdefault.jpg", "title": "Improving the Drupal Contributor Experience", "tweet_video": "Improving%20the%20Drupal%20Contributor%20Experience%20https%3A//codeandtalk.com/v/drupalcon-dublin-2016/drupalcon-dublin-2016-improving-the-drupal-contributor-experience%20presented%20%40drupalconeur%20by%20%40gdemet", "videos": [{"code": "p4hJ5yEGKPc", "type": "youtube"}], "views": "116"}