{"abstract": "https://events.drupal.org/dublin2016/sessions/weathercom-weather-company-inspiration-extend-tmgmt", "description": "At The Weather Company, Weather Means Business. Its complex weather data and forecast technology is available in 2.2 billion locations, and is updated every 15 minutes. This is no small feat, especially when you have to deliver a variety of content (including news, health and travel articles) in over 35 languages. To keep up with the business, Weather's IT department is developing against agile development principles. Smartling has been working with The Weather Company to achieve agility for localization.\n\n\n\nSmartling has learned a lot from the partnership with The Weather Company. It has advanced the company's vision for how translation at scale can be optimized. Smartling decided to use TMGMT for its Drupal 8 integration. Meet Smartling, and hear about our vision on extending this awesome module.\n\n\nThis session is for business and technical users of Drupal who are curious to learn how the largest user of Drupal manages local language content with minimal IT effort and resources to manage translation. Attendees will walk away empowered to think differently about how translation is changing with software.", "event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-dublin-2016-the-weather-company-as-an-inspiration-to-extend-tmgmt", "length": "41:12", "likes": "0", "recorded": "2016-09-26", "short_description": "At The Weather Company, Weather Means Business. Its complex weather data and forecast technology is available in 2.2 billion loc", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/dOjCHxjdF18/hqdefault.jpg", "title": "The Weather Company as an inspiration to extend TMGMT", "tweet_video": "The%20Weather%20Company%20as%20an%20inspiration%20to%20extend%20TMGMT%20https%3A//codeandtalk.com/v/drupalcon-dublin-2016/drupalcon-dublin-2016-the-weather-company-as-an-inspiration-to-extend-tmgmt%20presented%20%40drupalconeur", "videos": [{"code": "dOjCHxjdF18", "type": "youtube"}], "views": "82"}