{"abstract": "https://events.drupal.org/dublin2016/sessions/spatial-drupal", "description": "Mapping is a very powerful yet neglected aspect of Drupal site building. In most applications we see plotted flags on a map to the nearest restaurant or beer place. The contributed landscape of Drupal modules offers a broad variety of tools, with a few patches we are able to produce rich data applications.\n\nFor the past two years we've been collaborating with the open source GIS and Building information community. Utilising the potential of Open Source and Open Standards.\n\nWhere Geography meets infrastructural works, city planning and individual building architecture to utilise Drupal as a collaboration platform. Building Information Model, this project emerged from a research paper committed to the DDSS conference 2014 Organised by the Technical University of Eindhoven. It contributes to the development of IFC based web applications in practice and demonstrates a way of linking machine to human readable data, thus making the data accessible to people without the knowledge of Computer Aided Design (CAD) software.\n\nOpen semantic web Exposing the collected data of GeoJSON, RDFx and SPARQL to visualisation-, search- and other web systems.\n\nThis way, the world of the CMS meets 3D visualisation and gets integrated with real-time monitoring. Drupal will facilitate documents, discussions, calculations, calendars, workflows and other non geometry specific data. Other services are to exposed in the same user interface.\n\nThe Internet of everyThing Next is to integrate real time sensors in urban- and building infrastructure so the model and the reality can match and strengthen one another.\n\nThis will not be a showcase session, it will focus on the site building and architecture. Democratising complex information structures and next generation Drupal Systems.\n\nWhat level of knowledge should attendees have before walking into your session? Understand English\nWhat will your session accomplish and what will attendees walk away having learned? Use of Drupal in different contexts", "event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-dublin-2016-spatial-drupal", "length": "41:02", "likes": "0", "recorded": "2016-09-26", "short_description": "Mapping is a very powerful yet neglected aspect of Drupal site building. In most applications we see plotted flags on a map to t", "speaker_twitters": " @idevit", "speakers": {"floris-van-geel": {"episodes": [], "hosting": [], "info": {"country": "The Netherlands", "home": "https://www.drupal.org/u/idevit", "name": "Floris van Geel", "twitter": "idevit"}, "videos": [{"event": {"name": "DrupalCon Dublin 2016", "nickname": "drupalcon-dublin-2016", "twitter": "drupalconeur", "url": "https://events.drupal.org/dublin2016"}, "filename": "drupalcon-dublin-2016-spatial-drupal", "recorded": "2016-09-26", "thumbnail_url": "https://i.ytimg.com/vi/fX4vT0KBAl8/hqdefault.jpg", "title": "DrupalCon Dublin 2016: Spatial Drupal"}, {"event": {"name": "T-DOSE 2014", "nickname": "t-dose-2014", "twitter": "TDOSE", "url": "http://www.t-dose.org/2014/schedule"}, "filename": "t-dose-2014-open-singularity-education-drupal-floris-van-geel", "recorded": "2014-10-25", "thumbnail_url": "https://i.ytimg.com/vi/M40yOrOAnBc/hqdefault.jpg", "title": "Open Singularity, Education & Drupal"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/fX4vT0KBAl8/hqdefault.jpg", "title": "DrupalCon Dublin 2016: Spatial Drupal", "tweet_video": "DrupalCon%20Dublin%202016%3A%20Spatial%20Drupal%20https%3A//codeandtalk.com/v/drupalcon-dublin-2016/drupalcon-dublin-2016-spatial-drupal%20presented%20%40drupalconeur%20by%20%40idevit", "videos": [{"code": "fX4vT0KBAl8", "type": "youtube"}], "views": "102"}