{
    "description": "Debian GNU/Linux in der molekularen Pathologie\nTux meets NGS-Sequencing\n\nNeue Sequenziermethoden „Next-Generation-Sequencing\" (NGS) erlauben es große Teile des humanen Genoms für die klinische Diagnostik und die Forschung verfügbar zu machen. Die Mengen an Proben sowie großen Datenmengen erfordern allerdings eine gut aufgestellte Bioinformatik und elektronische Ablaufplanung.\n\nDie Medizinische Universität Graz hat den Trend zu Hochdurchsatzverfahren in der genetischen Diagnostik erkannt und das Labor für diagnostische Genomanalyse (DGA) am Institut für Pathologie eingerichtet. In diesem Labor wurde die NGS Technik über die Ion Torrent Plattform etabliert und für die Forschung und die klinische Diagnostik vorbereitet. Die großen Datenmengen die mit diesen Techniken gewonnen werden stellen eine besondere Herausforderung für klinische Laboratorien und beteiligte Forschungsgruppen dar. Im DGA-Labor wurde auf Basis von Debian GNU/Linux ein Labor-Informationssystem erstellt das die zentrale Probenverwaltung, die Ablaufplanung sowie die Auswertung der Sequenzierdaten bis zum fertigen Analyseergebnis beinhaltet. Im Vortrag wird auf die Gründe für die Entscheidung für freies Betriebssystem, die Vorteile von Debian GNU/Linux und die Herausforderungen in der Umsetzung eingegangen. Abschließend wird ein Überblick über den diagnostischen Ablauf sowie eine Zusammenfassung der Forschungsprojekte der Forschungsgruppe \"Translationale Genomanalyse\" präsentiert.\n\nLink: \nhttp://glt14-programm.linuxtage.at/events/273.de.html",
    "favorite": "0",
    "length": "43:02",
    "likes": "1",
    "recorded": "2014-04-04",
    "speakers": ["karl-kashofer"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/0JS1NNbfVZo/hqdefault.jpg",
    "title": "Debian GNU/Linux in der molekularen Pathologie",
    "videos": [
        {
            "code": "0JS1NNbfVZo",
            "type": "youtube"
        }
    ],
    "views": "259"
}