{
    "abstract": "https://confengine.com/agile-india-2016/proposal/2065",
    "description": "Five years ago, Kiran Jonnalagadda and I started to build HasGeek with the belief that there is need for conversations and communities around more and more focussed technology topics. We were clear that we wanted build technology communities and drill focus in every conference we'd launch under the HasGeek banner.\n\nWe were also determined to build the conferences and business in line with the following principles:\n\nContent is always independent of sales. In other words, sponsors are not entitled to speak by virtue sponsoring at the conference.\nIndividuals are invited to propose a talk. No one is \"invited\" to \"speak\" (neither is proposing a guarantee to speak). All proposers have to go through rigorous scrutiny in order to make it on the stage.\nSpeakers have to speak about open source technology and ensure there is a concrete takeaway for the audience in terms of insight or practice.\nFinally, participants are the primary customers. Sponsors are secondary. Consequently, participants' privacy is key for the conference's goodwill. Their data will not be shared without their permission.\nFive years down and we have been agile and slow in various aspects of organizing conferences and building our business.\n\nIn this talk, we will share what it takes to build a startup in an agile and expedient manner around assets such as goodwill, trust and networks. Goodwill, trust and networks are critical for any startup's success. The key takeaway for the audience is to identify their strategies and practices for building these assets and build a business or community or both in an agile manner.",
    "recorded": "2016-03-14",
    "speakers": [
        "zainab-bawa"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/a_eS9T5OxP4/hqdefault.jpg",
    "title": "Building a startup around conversations and communities",
    "videos": [
        {
            "code": "a_eS9T5OxP4",
            "type": "youtube"
        }
    ]
}