{
    "abstract": "https://confengine.com/agile-india-2016/proposal/2330",
    "description": "At Philips, we have been focusing on shifting organizational mindset and behavior and incorporating an Agile mindset.\n\nIt is a normal practice for organizations to adapt Agile by first conducting Agile training for teams, adapting Scrum ceremonies and mechanically applying Agile practices. The biggest challenge that an organization faces is on how to shift the mindset of the team and the leaders towards Agile. Moreover how to shift the people practices, that have been strongly aligned to traditional set up.\n\nIt is important for organizations to understand that Agile is a cultural shift and additional interventions should be introduced to make this cultural shift. \n\nAt Philips we looked at various aspects to bring in a holistic shift in the culture, mindset and behaviors :-\n\nThe first step was towards building a purpose driven organization with a strong vision that intrinsically motivates people towards creating customer value – rather than being too focused on financial results and internal metrics.\nSecondly, for Agile teams to be successful, focus is on mowing the ownership to the teams. This includes teams to not just acclimatize Agile values and principles but also to start driving the change. This involved creating change practices and interventions that facilitated this process.\nA culture change is a transformation in team behavior and competence. The team should be able to adapt and give feedback to each other on these competencies. Feedback souk is now getting embedded as a regular ceremony.\nTo shift the ownership to the team, the traditional organization structure needs to change. Traditional hierarchical structures represent flow of control and authority that is top down. Lateral Career paths are making way to Career Lattice. Managers have started playing the role of facilitators and performance coaches. \nThe people practices like hiring, performance management, learning and development, recognition practices, decision making process are getting transformed to allow a bottoms up approach.\nWe are seeing that the real shift in culture happens when organization become truly external and customer  focused and shifts its focus from internal controls to more flexibility.",
    "favorite": "0",
    "length": "51:00",
    "likes": "1",
    "recorded": "2016-03-14",
    "speakers": [
        "raj-karunakaran"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/FoZvmxNZd9Y/hqdefault.jpg",
    "title": "Building a Agile Culture: Our experience at Philips",
    "videos": [
        {
            "code": "FoZvmxNZd9Y",
            "type": "youtube"
        }
    ],
    "views": "140"
}