{
  "description": "One common problem any delivery team struggles is to have a common understanding of \"why\" a product or feature is being built. The documents such as Project Charter, vision document etc. tries to solve this problem, but it’s common to see such documents exist in the repository, hardly known or read by anyone in the team. And this document rarely gets updated too. Ask your team members what is the goal of the project? You may be surprised to know how many actually know about it.\n\nThe so called \"vision\" or \"goal\" usually rests within Product Manager/Owner or any other stakeholder. There is no forum to converse about these goals or ideas as a team. The planning meetings [iteration or release planning] are supposed to take care of this, but there is no standard guidelines defined which would help to brainstorm these in a typical release/iteration planning meetings.\n\nThis is where Impact Mapping comes into the picture. It is a \"Strategic planning technique\", defined by Gojko Azdic, explained in the book Impact Mapping. It is a very simple technique based on the idea of \"asking the right questions\" which are:\n\nWhy are we building what we are building? i.e., Goal(s) of the product\nWho we think are the actors who’ll get impacted?\nHow do we expect to change the actors’ behavior?\nWhat are we going to do to create the impacts? i.e. the feature list / deliverables\nFinally, by connecting the deliverables to impacts and goals, a map shows a chain of reasons that leads to feature suggestion. \n\nFundamental of Impact Mapping is that Impact means a change in behavior of an actor which usually results in a positive impact either by Reduction in the Cost or Improvement in ROI for the business.\n\nIf you closely watch the sections in Impact Mapping, what to build i.e. the features or the so called backlog comes only at the end, whereas in the typical planning meeting we usually start with a backlog.\n\nThe above questions need to be answered by the entire team [the IT team, the business people and any other stakeholders, if any], and avoids the common anti-patterns during planning meetings:\n\nAd-hoc planning\nWrong Assumptions\nPet features\nThe hands on workshop will cover the above mentioned concepts of Impact Mapping in detail along with exercising the same.\n\nBelow are a few comments that we received from our customers after being part of the Impact Mapping session:\n\n“It made me think about the real goals my product has to achieve during the initial launch.”\n“Wow, this is a great way of visualizing”\n\nConference: http://2016.agileindia.org\nSlide and Other details: https://confengine.com/agile-india-2016/proposal/1672",
  "recorded": "2016-03-14",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/r7hY08bv1Cg/hqdefault.jpg",
  "title": "Deliver with Impact by Leena S N",
  "videos": [
    {
      "code": "r7hY08bv1Cg",
      "type": "youtube"
    }
  ]
}