{
    "abstract": "https://confengine.com/agile-india-2016/proposal/1470",
    "description": "We need good agile managers, if we hope to sustain rapid adaptation and innovation. Agile managers deliver coherent chunks of value, rapidly adapt to changing circumstances, and experiment with new approaches. Because they depend on their teams to support their own agile needs, they demand agility from their teams.\n\nManagement talent is rare, and agile management talent even rarer. Gallup has surveyed thousands of managers, finding that low-talent managers, unfortunately a majority, create dysfunctional teams, build unsupported products and produce little sustained value. So developing high-talent agile managers matters.\n\nAgile managers adopt five agile base patterns for themselves: they measure economic progress, proactively experiment to improve, limit work-in-process by time and cost, radiate collective responsibility, and collaboratively solve systemic problems. It turns out these patterns have analogues in high-talent (non-agile) manager talents. That’s a relief, because we can focus agile manager development on extending the talents good managers already have.\n\nIn this workshop, we'll explore agile manager characteristics, and management dysfunctions. We'll create approaches to move good general managers to good agile managers. We'll explore strategies for dealing with mediocre managers, whether they are peers or superiors. And we'll learning how to improve our own management agility.\n\nThis talk comes from well-documented experience. I have held management roles from Team Lead through VP Engineering and CEO. At Citrix, Skype, Amway and other large companies, I used agile to help manage a 24-member user-experience department, three different agile coach teams and a 50-member data science department. Much of this work has been described in conference papers and detailed blog posts.",
    "favorite": "0",
    "length": "01:30:04",
    "likes": "1",
    "recorded": "2016-03-14",
    "speakers": [
        "dan-r-greening"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/MYZPfUyxo7U/hqdefault.jpg",
    "title": "Develop Agile Managers, or Agile Dies",
    "videos": [
        {
            "code": "MYZPfUyxo7U",
            "type": "youtube"
        }
    ],
    "views": "68"
}