{
    "abstract": "https://confengine.com/agile-india-2016/proposal/1461",
    "description": "Whether a team is brand-new or seasoned veterans at working together, explicitly defining and/or refining a team working agreement will help the team to align on how they will work together effectively to meet their common goal. In this fast-paced hands-on session, participants will go through the process of building a team working agreement using LEGO Serious Play (LSP).\n\nCreating a team working agreement helps team members set the stage for effective communication and high performance by making assumptions about ‘what really matters to us’ and ‘how we will work together?’ explicit and negotiable.  Great working agreements address some difficult topics - what values do we share? how do we want to deal with conflict when it comes up? how will we handle problems within the team? - which are often challenging to discuss openly and honestly, especially when a team is first assembled.  \n\nThis session will show you how to use LEGO Serious Play to encourage a frank and fearless discussion in order to kickstart these discussions so that a team can quickly create a powerful set of simple guiding principles for working together.  Participants will learn about the importance of team working agreements in creating team cohesion and common understanding of shared values and operational guidelines, and experience hands-on how to use the LEGO Serious Play cycle of build-share-reflect to have a participatory discussion to identify shared values, explore reactions to conflict, and build a set of simple guiding principles.",
    "favorite": "0",
    "length": "54:47",
    "likes": "3",
    "recorded": "2016-03-14",
    "speakers": [
        "ellen-grove"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/ONfFo6n2d-k/hqdefault.jpg",
    "title": "Everything Is Better When We Stick Together",
    "videos": [
        {
            "code": "ONfFo6n2d-k",
            "type": "youtube"
        }
    ],
    "views": "563"
}