{
  "description": "In May 2015, I got involved in coaching a products organization in improving their agile practices. This was a unique coaching experience for me because of some interesting experiments that I did:\n\nI focused on coaching and literally zero consulting. \nMy coaching stance was only limited to showing them the way, initially training them on the essence of agility, and later on to simply shine light on areas that needed their attention, and if needed, share ideas from the industry.\nI spent just 1day every month with the teams to only focus on my coaching sessions, and a few hours during that time to review the progress.\nThe teams and the leadership would decide on what they wanted to do, and how much they wanted to change.\nIn ~6 months that I coached them, I found that the team has matured to a very high level of self-organization. They changed their process, their key roles and responsibilities, and self-organized into a very high-performing teams (which was corroborated not just from the high-energy levels of their teams but also the project metrics).\n\nI call this model Minimum Viable Coaching, and it was helpful in demonstrating how a coaching could be made extremely effective if there is a client who is willing to trust its team in their ability to self-change, with minimal guidance (more of direction than really support) from an external coach. It also requires a coach to think in terms of minimum self-interests (read commercial interests) but focus on what will make the client successful in the long run.\n\nIn this experience report, I will share my approach and experiences, and offer some ideas on how the coaching can be elevated to a true coaching where the enterprise becomes self-organizing on their own.",
  "recorded": "2016-03-14",
  "abstract": "https://confengine.com/agile-india-2016/proposal/1924",
  "speakers": ["tathagat-varma"],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/rir2jw-peRI/hqdefault.jpg",
  "title": "Minimum Viable Coaching   an experience report",
  "videos": [
    {
      "code": "rir2jw-peRI",
      "type": "youtube"
    }
  ]
}
