{
    "abstract": "https://confengine.com/agile-india-2016/proposal/1945",
    "description": "A successful startup/product company needs to master the art of validating early product ideas quickly and effectively. Whether you are building a product, service or a new feature, the two most important questions to find out early are:\n\nare we solving the right problem?\nif yes, how do we pitch the idea to the target customer to generate a favourable action?\nDuring this session, we'll focus on various safe-fail experimentation techniques used by Lean Startups for quickly identifying and validating the customer's value hypothesis, without having to build the real product. You will leave this session equipped with various MVP design techniques, that will allow you to rapidly discover a viable product/service that delights your customers, without spending a lot of time and effort. \n\nTraditionally, entrepreneurs believed that the only way to test their product/service hypothesis was to build the best-in-class product/service in that category, launch it, and then pray. Most often, products/services fail, not because they cannot be built or delivered. But because, they lack the market-fitment and customer appeal.\n\nTo avoid these risks, these days startups are focusing on building a \"Minimum Viable Product\" (MVP), a product that includes just enough core features to allow useful feedback from early adopters. This reduces the time to market and allows the company to build subsequent customer-driven versions of the product. Hence mitigating the likelihood of wasting time on features that nobody wants. MVPs are typically deployed to a subset of customers, such as early adopters that are more forgiving, more likely to give valuable feedback.\n\nHowever the problem with MVPs is that companies still spend too much time building stuff and very little time learning. Don't forget the purpose of MVP is validated learning NOT building. This session will give you ideas on how to quickly formulate and test your value and growth hypothesis in a scientific framework using extremely cheap MVP techniques collectively referred to as MVP Design Hacks.",
    "recorded": "2016-03-14",
    "speakers": [
        "naresh-jain"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/tsnulivr9Qo/hqdefault.jpg",
    "title": "MVP Design Hacks",
    "videos": [
        {
            "code": "tsnulivr9Qo",
            "type": "youtube"
        }
    ]
}