{
    "abstract": "https://confengine.com/agile-india-2016/proposal/1880/the-decline-and-fall-of-agile-antifragile-mindset-to-rescue",
    "description": "What started off as a trial-and-error approach to improve the state of software development by a bunch of tinkerers, is today dominated by management consultants, \"Thou-Shall\" codified frameworks and rigid, expensive tools. Over the last 20 years, we've gone from, \"I'm not sure, let's try this in a small-safe environment\" to \"you/your-team sucks; you guys have a very poor agile maturity because you are not doing _x_y_z_ (not conforming to the standards).\" Along the way, we've lost the purpose of being agile .i.e. to embrace uncertainty and simplicity. Instead we've been forced to believe that consistency via top-down standardisation and predictability by increasing the rigour on process is our eternal quest. Anything that sounds simple and works 80% of the cases is discarded as being naive. What once drove thought-leader into agile, is now driving them insane. This is the unfortunate fate of Agile.\nLuckily there has been some fresh perspectives from Nassim Taleb, author of Antifragile. His work explains how some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. More importantly why antifragility is beyond resilience or robustness.\nIn this talk, I'll use some of Nassim's thoughts (and some of my own) to explain what is wrong with our current approach to Agile and how we can bring life back into Agile. Particularly how we can leverage Volatility, Uncertainty, Complexity, and Ambiguity to make product development more antifragile.",
    "favorite": "0",
    "length": "49:33",
    "likes": "5",
    "recorded": "2016-03-14",
    "speakers": [
        "naresh-jain"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/h62n09XtS-A/hqdefault.jpg",
    "title": "The Decline and Fall of Agile - Antifragile Mindset to Rescue",
    "videos": [
        {
            "code": "h62n09XtS-A",
            "type": "youtube"
        }
    ],
    "views": "502"
}