{
    "abstract": "https://confengine.com/agile-india-2016/proposal/1856",
    "description": "In this session, we will study how two scaling approaches, LeSS and SAFe, affect the fundamentals of the organization: leading flow, unity, and learning. A critical choice is the balance between program execution and long term evolution. We will give valuable thinking tools for choosing the correct approach.\n\nScaling Agile is easily misunderstood. Do you want to handle bigger programs and more teams or do you want to have more value with less hassle? Or do you want to widen the Agile adoption to the whole of the organization: culture, business, and leadership.\n\nBoth Large-Scale Scrum (LeSS) and Scaled Agile Framework (SAFe) have a history with Nokia and use it as a reference. The pattern of Coordination Chaos (http://www.slideshare.net/gosei/coordination-chaos) was one of the main reasons leading to the infamous “Burning Platform” of Nokia Mobile Phones. It is a core challenge in scaling. Most big organizations around the world face similar problems. Nokia provides a relevant story to understand and compare what these approaches offer.\n\nAnother challenge is learning. Big corporations often use the machine metaphor for the organization. This management thinking optimizes resources and cost, locally and in the short term. It treats learning as cost, especially learning outside of one’s special role. Let’s contrast this with a Scrum team (the team + the product owner + the Scrum master). It cross-learns inside the team. It inspects and adapts at the market. Here learning creates value. This is what you want to scale up.\n\nWe will look at the approaches by using organizational control theory created by William G. Ouchi where he defines three main control mechanisms; bureaucratic, market and clan control. This explains why teamwork is the only way. Even having the same basis the frameworks differ how control is achieved, and it has an impact on long-term sustainability.\n\nThe flow of work is analyzed looking at batching of work, length of detailed planning horizon and organizational structures.\n\nFinally, we will point out the main questions you should look at when selecting LeSS or SAFe. What is their transformational power. Are they aiming at a fundamental change from Taylorian organization to Lean and Agile.",
    "favorite": "0",
    "length": "50:06",
    "likes": "0",
    "recorded": "2016-03-14",
    "speakers": [
        "ran-nyman"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/TP-VnK0EnLY/hqdefault.jpg",
    "title": "The transformational power of LeSS and SAFe",
    "videos": [
        {
            "code": "TP-VnK0EnLY",
            "type": "youtube"
        }
    ],
    "views": "318"
}