{
    "abstract": "https://confengine.com/agile-india-2016/proposal/2309",
    "description": "Are you interested in succeeding with Agile in large, complex distributed development projects? Being Agile in a distributed environment has been a subject of controversy over the years, which is not surprising given the importance placed on face-to-face communication in the twelve principles of the Agile Manifesto.\n\nThis workshop will address the opportunities, challenges and concerns that are commonly faced by organizations in keeping to this manifesto when their Agile teams are geographically distributed.\n\nAgile teams need to work together very closely as cross-functional teams, instead of silos with hand-offs after long project phases. Agile teams also need to engage customers and stakeholders frequently to ensure that they are meeting customer needs, adapting to changing requirements and delivering high-quality software. The transparency inspired by Agile makes any challenges related to this level of daily communication, collaboration and teaming, painfully obvious to teams and individuals. However, many large-scale and distributed Agile teams are successfully and boldly rising to meet the challenges with great success.What makes the difference between thriving versus just merely surviving?\n\n In this session, we will explore how organizations can create cultures, nurture individuals, and build teams to create high performing Distributed Agile teams in a globally competitive world. Dipesh will also share some innovative ideas in addition to tricks, tips, and proven methods that have inspired and helped people and organizations to 'be Agile' rather than just 'do Agile'.  The Agile Manifesto puts more emphasis on individuals and interactions over processes and tools and we want to keep it that way no matter where they are!\n\nBring your greatest distributed teaming challenges and and be ready to be inspired during this active and engaging session.",
    "favorite": "0",
    "length": "01:26:09",
    "likes": "4",
    "recorded": "2016-03-14",
    "speakers": [
        "dipesh-pala"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Mh-_kkGxFQ8/hqdefault.jpg",
    "title": "Unleashing the full potential of your Distributed Agile Teams",
    "videos": [
        {
            "code": "Mh-_kkGxFQ8",
            "type": "youtube"
        }
    ],
    "views": "45"
}