{
    "description": "Human Rights Perspectives on Intellectual Property Problems\n\nWe all know that there are many things wrong with the intellectual property law regime and that it is in different ways unsuitable for today's society. Finding convincing arguments to influence policies and laws is a must. International Human Rights Law provides a language of internationally recognized standards which we all could use to bring across our point for more freedom and equality.\n\nCopyright as a law and a mindset is today receiving increasing criticism from many different perspectives. Some of them are rather intuitive, - based on the general understanding of freedom in a liberal society - some are economic, sociological, etc. The idea of claiming human rights to stop the expansion of copyright is not a new one either. Freedom of expression has long been a flagship for many anti-copyright movements, especially in the U.S.\nInternational Human Rights law, however, is an indivisible body of specialised international law norms, aimed at expressing and protecting the very core of human existence -- his or her dignity. In the discussion about copyright there is a group of human rights we have to take into consideration. Among them not only the right of freedom of expression, the right to education, the right to participate in cultural life, but also the authors' right to benefit from protection of their moral and material interests. All of them have to be protected.\nWhat kind of balance do human rights offer when implementing these rights? How does/should it influence the copyright law? During this talk I will try to answer these questions and will encourage to see human rights as a helpful tool of advocacy, but also as a binding international law states and individuals have to observe.\n\nDownload video: http://videos.fscons.org/fscons/2013/lilla_horsalen_-_2013-11-10_1615_-_human_rights_perspectives_on_intellectual_property_problems_-_aurelija_lukoseviciene_-_8.ogv",
    "recorded": "2013-11-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/z5WigDOOob0/hqdefault.jpg",
    "title": "Aurelija Lukoseviciene: Human Rights Perspectives on Intellectual Property Problems",
    "videos": [
        {
            "code": "z5WigDOOob0",
            "type": "youtube"
        }
    ]
}