{
  "description": "An essential part of building a language technology\ninfrastructure \"for the rest of us\" is reuse and flexibility.\nMost of the languages not covered by existing language technology\ndo not have computer programs with an ability to process text or\nspeech in their language. Making such programs is not an easy\ntask: The dominating languages combine an abundance of accessible\ntext resources with an impoverished inflectional structure.\nMethodologies for these languages capitalise upon this, and use\nstatistical and list-based methods where the primitives are the\nwords (character strings between spaces). The majority of the\nlanguages of the world are in the opposite situation, and combine\na paucity of textual resources with a rich morphological\nstructure, ranging from 8 forms of each noun in Scandinavian to\nmore than thousand forms of each verb in Finnish. An on top comes\nthe productive compounding of Northern Europe.\n\nWe will present the infrastructure and tools used and developed by\nthe Divvun and Giellatekno groups at the University of Tromsø to\ndevelop proofing tools, localisation, intelligent language\nlearning resources and other linguistic resources for almost 40\nminority languages. The main importance in this infrastructure\nlies in its portability and reusability. The available resources\nto do the required work to develop these resources are limited,\nand thus one can not afford to redo the same or similar work\nagain and again in different projects, the way it often is done\nfor the largest language communities in the world.\n\nSumming up: Our approach makes language technology solutions for\ncomplex or lesser-resourced languages possible, and our\nopen-source infrastructure makes it an efficient and doable\napproach for the larger OS community. Join in!\n\n\nDownload video: http://videos.fscons.org/fscons/2013/c362_-_2013-11-10_1515_-_an_open_source_infrastructure_for_language_technology_-_trond_trosterud_-_sjur_norstebo_moshagen_-_35.ogv",
  "recorded": "2013-11-08",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/VOy_APEQSV0/hqdefault.jpg",
  "title": "Trond Trosterud & Sjur Nørstebø Moshagen: An Open Source Infrastructure for Language Technology",
  "videos": [
    {
      "code": "VOy_APEQSV0",
      "type": "youtube"
    }
  ]
}