{
    "description": "Keep Calm and Code New Laws\nIt looks like we did it again.\n\nOn the surface of reality, everything looks just fine. It looks like never in our history have we been so creative, so inspiring and so productive in every possible way.\n\nOn the surface of reality, everything looks just fine. It looks like never in our history have we been so creative, so inspiring and so productive in every possible way. Click randomly on any TED talk or any other of the two zillion inspiring conferences happening in every second on this planet and you will see that we are almost there, that there are just few steps or clicks away to eliminate poverty, cure every disease, make governments accountable and transparent with promising web platforms that will save the world.\n\nBut, somehow if we look away from the keyboard (our beloved Internet machines), it doesn't look like something has really changed\n\nWe've managed to centralize/monopolize the Internet into the hands of a few huge companies, who in turn hold all information, resources, knowledge and data. We've managed to build an illusion that millions of startups are not just outsourced research and development for those few companies. We somehow believe in the fact that its completely normal that majority of startups or micro business will die in the first two years and those few happy ones will be bought over by the big companies and achieve their ultimate dream to be young and rich.\n\nWith leading countries pumping industrial military sized budgets in the next few years into cyber war, tools and cyber soldiers, there is a small chance that the Internet will not turn into one big battlefield in which all of our personal computers will be used as a zombie units of silent and invisible war. Our dependence on the networked technology in every possible field of our professional, private everyday life will turn us into the victims, future cyber refugees or unconscious cyber soldiers.\n\nOur beloved gadgets and personal computers will become and they already are the biggest surveillance system ever existed. All the information about our every segment of our lives are there at the fingertips of the governments, government agencies, huge private companies or cyber criminal groups or individuals, and we are doing all of this voluntarily. Governments that are finally starting to realize the importance of our big network are trying to push (in every few weeks) new laws that will legalize Internet surveillance, making exchange of knowledge and information regulated and impossible.\n\nAnd finally, we manage to destroy the narrative. Journalism is not needed anymore because we are not able to consume more than 144 letters in one subject. Books are not needed because we don't have time to read them. We are producing much more information that we are able to consume and we will never have the time to try to understand what all of those information really mean.\n\nBut one can say, that it is ok, it 's something that we usually do. We manage to mess up with every type of media we create. Remember radio, or even better cable tv? From empowering and decentralized media into the mashup of mass produced trash and ultimately a propaganda machine. Somehow this time it feels a bit different, maybe because we are so massively participating in it.\n\nThis anarchy of destroying our past and our present opened this endless potential to just take the power back.We, the people never had this weaponry in our hands before. A single person was never this powerful ever. THIS is what we should awake in people.\n\nSo, What Do?\n\nKeep calm and rethink everything.\nFor the moment lets just slow down a bit. Do we really need to consume so much? Do we really need to share everything about every segment of our personal life? Do we really need to participate in all of this. Should we all emigrate to \"dark net\", invent some new Internet and leave this one to die? Have no idea. But what is for certain; we should talk and discuss about it.\n\nKeep calm and code new laws.\nKeep your eyes open and follow every little movement in the creation of new legislation. Our network of networks was not made to be an ultimate surveillance machine and the end of privacy. It was also not made to serve old and obsolete business giants built on proprietary content and distribution. Analyze, understand, create awareness, defend or attack. Courtrooms and parliaments will be our battlefield of Internet freedom.\n\nKeep calm and consume and share differently.\nBecome an info vegan, build your own independent micro peer networks of information between trusted and loved peers. Create your own social networks and reclaim your own content and information in order to be free to share them the way you want to share.",
    "recorded": "2013-11-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Tl6FjyPFiEY/hqdefault.jpg",
    "title": "Vladan Joler: Keep Calm and Code New Laws",
    "videos": [
        {
            "code": "Tl6FjyPFiEY",
            "type": "youtube"
        }
    ]
}