{
    "description": "Surveillance through big data sets, like social networks, makes it increasingly uncomfortable to be publicly weird. The best new technical ideas have always come from innovative thinkers who question the way things are done. Ubiquitous surveillance makes it not just uncomfortable, but sometimes downright dangerous to be a person who breaks the mold. Strange behavior creates anomalous data, which can lead to closer surveillance, investigation of one's acquaintances and occasionally a warrant-holding officer on the doorstep.\n\nIn this talk, we'll review the history and current legal status of privacy before exploring what might happen to privacy in the not-too-distant future. Going offline is not a viable option. Collaboration is at the heart of innovation, so independent thinkers must be able to find each other. Understanding what's at stake isn't enough. There are also social, economic and technical challenges to building a weird-friendly web. This talk will identify the scope of the problem to help craft the right solution.\n\nA one-size-fits-all web reinforces the status quo and exacerbates historical inequities. To make a web that is a source of inspiration and collaboration, users need to be able to craft their own experiences, which requires fine-grained control over what is \"\"important,\"\" what constitutes harassment or spam, and who has access to their thoughts, ideas, artwork and code. The future of weirdness will be built with the freedom to try new things, design different systems, and create code that doesn't value advertisers over users. We have social, political, and technical work to do if we want to preserve a safe space for the next generation of world-changers!\"",
    "favorite": "0",
    "length": "49:32",
    "likes": "2",
    "recorded": "2015-08-21",
    "speakers": [
        "deb-nicholson"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/U3ipdhcEVLg/hqdefault.jpg",
    "title": "Surveillance and the Erosion of Wierdness",
    "videos": [
        {
            "code": "U3ipdhcEVLg",
            "type": "youtube"
        }
    ],
    "views": "94"
}