{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nA multidisciplinaridade no desenvolvimento de softwares livres educacionais\nTrilha: Educação - Educação\nAutores:\nAna Rute Mendes\nPaula Rodrigues Furtado\nApresentação:\nDia 13 às 15:00 na sala 41C (60 minutos)  vídeo\nDescrição:  Um problema recorrente ao lidar com softwares educacionais livres é a distância entre como o software foi concebido (geralmente, por profissionais que   não atuam com educação) e as reais necessidades dos usuários finais que, levando-se em conta a área de educação, na maioria das vezes são usuários pouco familiarizados com novas tecnologias.\nEsta palestra fará um panorama do cenário de softwares educacionais livres no Brasil e apresentará os resultados de uma pesquisa de usabilidade que contrapõe a visão de educadores que utilizam a plataforma e como ela foi concebida, realizada sobre a plataforma de MOOCs(Massive Open Online Courses) chamada TIM Tec, desenvolvida pelo Hacklab e distribuida em software livre.\nSerá debatida também a importância de uma equipe multidisciplinar durante a concepção de soluções para esta área e como o software livre pode trazer impactos significativos para ampliar o acesso à informação/educação e novas tecnologias. Ainda neste tópico, haverá uma reflexão sobre a importância da comunicação dentro de times multidisciplinares e da flexibilidade na busca de uma linguagem que seja compreensível por profissionais de diferentes áreas. \nA educação é uma área bastante defasada quanto à utilização de soluções tecnológicas. O desenvolvimento colaborativo de softwares livres pode ser uma saída positiva para o avanço da área, mas para isso é necessário o envolvimento de profissionais de educação nesses projetos, o que implica em um esforço coletivo para o desenvolvimento dos novos letramentos dessas pessoas, para a flexibilização da linguagem para que seja possível a mediação entre os diferentes profissionais e na propagação dos conceitos e ideais por trás da comunidade de software livre para não-desenvolvedores.",
    "favorite": "0",
    "length": "47:37",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Ca36J2AkdZU/hqdefault.jpg",
    "title": "A multidisciplinaridade no desenvolvimento de softwares livres educacionais",
    "videos": [
        {
            "code": "Ca36J2AkdZU",
            "type": "youtube"
        }
    ],
    "views": "23"
}