{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nA nova Instrução Normativa do Software Público Brasileiro\nTrilha: Ecossistema - Cultura, Filosofia, e Política\nAutores:\nGustavo Rodrigues Silveira\nLUIZ FERNANDO DE FREITAS MATOS\nApresentação:\nDia 13 às 12:00 na sala 41D (60 minutos)  vídeo\nDescrição:  O Software Público Brasileiro - SPB é um software livre que atenda às necessidades de modernização da administração pública de qualquer dos Poderes da  União, dos Estados, do Distrito Federal e dos Municípios e cujo compartilhamento sem ônus no Portal do Software Público resulte diretamente na economia de recursos públicos, passando assim a ser tratado como um recurso benéfico para a administração pública e para a sociedade.\n\nA disponibilização de um SPB pode ser feita por qualquer pessoa física ou jurídica que seja titular dos direitos de propriedade do software. As regras para disponibilização estão disponíveis na Instrução Normativa de 17 de Janeiro de 2011 da Secretaria de Tecnologia da Informação do Ministério do Planejamento.\n\nA referida IN está passando por um processo de revisão desde o início de 2015. A minuta da nova versão traz como principais melhorias a ampliação do número de licenças de softwares aceitas pelo modelo e a eliminação da obrigatoriedade de registro no INPI. \n\nNa nova IN o código-fonte deverá ser licenciado sob um ou mais modelos de licença livre de software compatíveis com GNU GPL (Licença Pública Geral), ou algum outro modelo de licença livre a ser aprovado pela STI/MP. Na IN 01/2011 apenas softwares licenciados pela licença GPL 2.0 eram aceitos. Além disso foi evidenciada a eliminação da obrigatoriedade de registro no INPI, tornando o seu registro opcional.\n\nAs alterações realizadas criam um processo mais simples e atraente para a comunidade, que poderá concentrar seus esforços em produzir e compartilhar software.\n\nO processo de elaboração da IN seguiu um modelo colaborativo e transparente. Foram realizadas consulta e audiência pública que contou com 493 contribuições. \n\nEsta proposta de palestra visa apresentar o processo de revisão da IN 01/2011, as principais alterações realizadas na norma, bem como os benefícios esperados com as evoluções realizadas no modelo de disponibilização do Software Público Brasileiro.",
    "favorite": "0",
    "length": "52:30",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/EftiBFvY7kE/hqdefault.jpg",
    "title": "A nova Instrução Normativa do Software Público Brasileiro",
    "videos": [
        {
            "code": "EftiBFvY7kE",
            "type": "youtube"
        }
    ],
    "views": "18"
}