{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nComo criamos uma cultura de software livre na universidade de brasília\nTrilha: Educação - Educação\nAutores:\nThiago Ribeiro mostrar currículo\nArthur J Sturzbecher mostrar currículo\nApresentação:\nDia 15 às 14:00 na sala 41C (60 minutos)  vídeo\nDescrição:  Como os alunos da universidade de brasília estão criando um ecossistema de desenvolvimento de software livre?\n\nA universidade de brasília possui um cu  rso de engenharia de software, dentro desse curso existe o laboratório chamado LAPPIS - Laboratório avançado de pesquisa, produção e inovação de software, e tem como sua base o desenvolvimento e pesquisa com software livre.\n\nAssim, os alunos do laboratório criaram um ambiente colaborativo, e trazem práticas aos alunos da própria universidade, expondo a importância da colaboração com software livre durante a graduação. Levando aos alunos conhecer melhor as vantagens de se colaborar com  software livre e a sua importância.\n\nDentro das nossas particações, como laboratório estão:\n\n- 2 alunos participantes do google summer of code (2014 e 2015) além de 4 submissões em 2016 (aguardando resultado)\n- 1 Mini debconf em brasília\n- 1 debian developer\n- 2 alunos paritipantes da debconf 2015\n- 4 alunos no time de ruby do debian e 3 alunos participantes da sprint de ruby do debian em 2016\n- Várias contribuições com softwares livres como Gitlab, Noosfero, Colab, gems ruby, etc.\n- Dentre várias outras contribuições.\n\nO nosso objetivo nessa palestra será mostrar como chegamos nesses resultados, e como você poderia aplicar o mesmo no contexto da sua universidade, trazendo assim o ecossistema de software livre para sua escola/universidade.",
    "favorite": "0",
    "length": "38:01",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/vA7jwzE_0kg/hqdefault.jpg",
    "title": "Como criamos uma cultura de software livre na universidade de brasília",
    "videos": [
        {
            "code": "vA7jwzE_0kg",
            "type": "youtube"
        }
    ],
    "views": "7"
}