{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nDesenvolvimento de jogos educacionais adaptados para crianças especiais\nTrilha: Educação - Educação\nAutores:\nJonas Rodrigues Ramires mostrar currículo\nCarlos Souza Rodrigues Filho\nLeonardo Silva Moraes\nBehatris Fiorentini\nApresentação:\nDia 16 às 17:00 na sala 41C (60 minutos)  vídeo\nDescrição:  O projeto TIME, tendo em vista as dificuldades da grande maioria dos profissionais de escolas regulares em desenvolver técnicas e formas de ensino que  estimulem e façam com que crianças com necessidades especiais tenham um melhor aprendizado, consiste na criação de jogos educativos adaptados para crianças com necessidades especiais que visam facilitar o aprendizado de tais. A metodologia consiste em pesquisas sobre as necessidades especiais, desenvolvimento dos jogos, aplicação dos jogos e após esses processos, analise de seus efeitos para obter conclusões de sua eficiência. No meio acadêmico, o uso da informática trás muitos benefícios, favorecendo a interação entre alunos e professores, e pretende-se descobrir se isso pode ajudar a estimular o processo de aprendizagem de crianças com necessidades especias. Sendo o computador, em especial os jogos, instrumentos tão fascinantes para as crianças, introduzi-los como parte das disciplinas convencionais com jogos educativos adaptados, seria uma forma de desenvolver o raciocínio, diferenciando o modo de ensino e possivelmente facilitando e estimulando a aprendizagem das crianças com necessidades especiais, além de ajudar os professores com mais uma ferramenta de ensino.",
    "favorite": "0",
    "length": "36:55",
    "likes": "1",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/psDAJp7cHuU/hqdefault.jpg",
    "title": "Desenvolvimento de jogos educacionais adaptados para crianças especiais",
    "videos": [
        {
            "code": "psDAJp7cHuU",
            "type": "youtube"
        }
    ],
    "views": "81"
}