{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nDesenvolvendo Bots para Telegram em Python\nTrilha: Desenvolvimento - Linguagens de programação\nAutores:\nLeandro Toledo de Souza\nApresentação:\nDia 13 às 16:00 na sala 41E (60 minutos)  vídeo\nDescrição:  O objetivo dessa palestra é guiar o público sobre a utilização de uma biblioteca em Python para o desenvolvimento de bots (software concebido para sim  ular ações humanas repetidas vezes de maneira padrão, da mesma forma como faria um robô) no Telegram.\nO desenvolvimento da palestra inicia com uma abordagem ao Telegram, aplicação multiplataforma de mensageiro instantâneo com clientes em código aberto, concorrente ao WhatsApp. O Telegram tem conquistado espaço frente ao WhatsApp devido a inúmeras features. A API de bots, a mais recente, permite que seus usuários automatizem atividades ou interajam de forma diferente com outros utlizadores. Como por exemplo, o uso do bot @gif que permite pesquisar por GIFs sem sair do aplicativo, ou @mau_mau_bot para jogar UNO! com amigos.\nDado o devido contexto, será então apresentada uma biblioteca em Python, linguagem conhecida por sua fácil curva de aprendizagem - no entanto assume-se que o público tenha conhecimento básico em linguagem de programação. A simplicidade da biblioteca permite, sem muito esforço, criar Bots para o Telegram. Alguns exemplos serão apresentados junto a um guia prático de como começar a usá-la.\nNa terceira parte da palestra vale a pena destacar algumas features da biblioteca, como a classe Updater - que permite criar Bots multithread sem muito trabalho, JobQueue - para agendamento de tarefas e InlineQueries - que permite que um Bot seja utilizado sem sair da janela de conversação atual.\nFinalmente, encerra-se com relatos da experiência de ter construído um software livre pela primeira vez, um discurso prático de como contribuir com a biblioteca, a metodologia de desenvolvimento utilizada e mais sobre a comunidade que se formou por trás do desenvolvimento.\n\nLinks:\npython-telegram-bot (biblioteca mais popular para Telegram API Bots entre utilizadores de Python)\nhttps://github.com/leandrotoledo/python-telegram-bot\nhttps://www.linkedin.com/in/leandrotoledodesouza (autor da biblioteca e palestrante)",
    "favorite": "0",
    "length": "41:18",
    "likes": "18",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/r6OdnDokzAQ/hqdefault.jpg",
    "title": "Desenvolvendo Bots para Telegram em Python",
    "videos": [
        {
            "code": "r6OdnDokzAQ",
            "type": "youtube"
        }
    ],
    "views": "849"
}