{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nSoftware Educacional Livre para Dispositivos Móveis\nTrilha: Educação - Educação\nAutores:\nPaulo Francisco Slomp mostrar currículo\nAndré Ferreira Machado mostrar currículo\nApresentação:\nDia 16 às 9:00 na sala 41B (60 minutos)  vídeo\nDescrição:  Apresentaremos o resultado de um trabalho de coleta, avaliação, seleção e classificação de informações a respeito de mais de 300 aplicativos educacion  ais para celulares e tablets. Professores, estudantes, pais e demais internautas podem acessar a Tabela Dinâmica http://ufrgs.br/soft-livre-edu/dispositivos-moveis e consultar as informações sobre programas que podem ser utilizados para aprendizagem de diversas matérias, como Física, Geografia, Matemática, Química e Idiomas, entre outras. A ferramenta wiki de edição coletiva está organizada de forma a exibir inicialmente o ordenamento alfabético das áreas do conhecimento com diferenciação através de cores, facilitando a visualização. Os usuários podem reordenar os dados conforme a faixa etária dos estudantes, de acordo com o nível de ensino – Educação Infantil, Anos Iniciais e Finais do Ensino Fundamental, Ensino Médio e Superior. Todos os aplicativos possuem licenças livres, como GNU-GPL, Apache, MIT, BSD, etc. A comunidade pode adicionar diretamente novos aplicativos sem que seja necessária permissão dos autores iniciais. É possível alterar o conteúdo, inclusive de forma anônima, corrigindo eventuais erros e imprecisões. A licença Creative Commons BY-SA permite republicação, trabalhos derivados e inclusive uso comercial. Comunidades de outros países podem participar, pois há tradução da tabela para o inglês, o espanhol, o francês, o italiano e o português europeu.",
    "favorite": "0",
    "length": "40:31",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/rHkq1AKEwVM/hqdefault.jpg",
    "title": "Fisl 17 - Software Educacional Livre para Dispositivos Móveis",
    "videos": [
        {
            "code": "rHkq1AKEwVM",
            "type": "youtube"
        }
    ],
    "views": "19"
}