{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nMineração de Dados, Internet das Coisas e Dados Abertos\nTrilha: Tópicos Emergentes - Dados Abertos\nAutores:\nMarcos Vinicius Fidelis mostrar currículo\nApresentação:\nDia 16 às 12:00 na sala 41C (60 minutos)  vídeo\nDescrição:  Atualmente os dados estão pulverizados em disponíveis através da nuvem, em dados públicos e nas próprias empresas. Dados estão distribuídos em diverso  s dispositivos e fontes geradoras tais como celulares, sensores, coletores de dados, máquinas, equipamentos, veículos e eletrodomésticos.\nAcrescente-se a isto os dados de redes sociais, e rapidamente percebe-se que a capacidade de analisar dados é muito menor que a disponibilidade de dados.\nPor isto  a Mineração de Dados (Data Mining) é uma das principais áreas dos próximos anos. Esta é a área capaz de extrair conhecimento de grandes bases de dados, convencionais ou não, e capaz de transformar dados e relacionamentos, aparentemente ocultos, em conhecimento útil para a tomada de decisão ou para a avaliação de resultados.\nO coração deste processo está na organização dos dados. Esse primeiro passo é uma tarefa desafiadora, porque as corporações contam com diversas fontes de informações e elas precisam de uma base única, limpa e de qualidade para realizar a análise.\nVisando a formação dos próximos Cientistas de Dados, pretendo nesta palestra apresentar os conceitos relacionados a esta área, apresentando através de uma abordagem clara e prática, a mineração de dados com o Software WEKA, que é uma das principais ferramentas de código livre e aberto, e que compõe a ferramenta de Business Intelligence chamada Pentaho.\nSerão apresentados os principais conceitos e uma experiência prática envolvendo Dados Abertos, Internet das Coisas e Mineração de Dados.\nEsta palestra é voltada para aqueles que desejam entender como criar parâmetros para entender o comportamento do consumidor, identificar afinidades entre as escolhas de produtos e serviços, prever hábito de compras, analisar comportamentos habituais para prever fraudes e muito mais.",
    "favorite": "0",
    "length": "43:34",
    "likes": "2",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/EwxGcowBStM/hqdefault.jpg",
    "title": "Fisl 17 - Mineração de Dados, Internet das Coisas e Dados Abertos",
    "videos": [
        {
            "code": "EwxGcowBStM",
            "type": "youtube"
        }
    ],
    "views": "145"
}