{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nOmniDB, aplicação livre brasileira para gerenciamento de múltiplos SGBDs\nTrilha: Administração - Bancos de Dados\nAutores:\nRafael Thofehrn Castro mostrar currículo\nEduardo Todt mostrar currículo\nWilliam Ivanski mostrar currículo\nLuis Felipe Thofehrn Castro mostrar currículo\nApresentação:\nDia 15 às 11:00 na sala 41E (60 minutos)  vídeo\nDescrição:  A ideia da aplicação surgiu ao gerenciar dados diariamente no ambiente real de trabalho da equipe, onde percebeu-se a necessidade de uma ferramenta ot imizada para manipular bases de dados de diferentes tecnologias, local ou remotamente. Em muitas situações o processo dependia de determinados SGBDs, muitas vezes inacessíveis devido ao seu custo, e por esse motivo passamos a estudar formas de converter bancos de dados entre diferentes SGBDs.\n\nVerificando as alternativas disponíveis, identificou-se que elas apresentavam um conjunto de limitações que não se adequavam às necessidades do local de trabalho. Dentre estas, uma funcionalidade seria a de integrar a conversão de banco de dados entre diferentes SGBDs na própria ferramenta de gerência, dado que esta funcionalidade geralmente está presente em ferramentas de alto custo.\n\nA partir deste levantamento, percebeu-se pertinente o desenvolvimento de uma ferramenta capaz de atender estas demandas, o qual se concretizou com a primeira versão oficial, que já suportava os seguintes SGBDs: PostgreSQL; MySQL; Oracle; Firebird e SQLite.\n\nA próxima decisão foi distribuí-la para uso público na forma de uma ferramenta gratuita, onde criamos uma identidade e um espaço de divulgação. Começamos a receber um feedback internacional positivo, onde destacou-se o interesse generalizado pelo acesso ao código-fonte, além da inclusão de novas tecnologias.\n\nDiante destas demandas, já se incluiu suporte aos SGBDs SQL Server e Access, e  agora estamos no processo de testes para disponibilizar a funcionalidade de conversão para o público e refinando o código para em breve disponibilizá-lo, o qual estará disponível antes da realização do evento FISL17.\n\nAssim, buscamos com esta palestra compartilhar a experiência do desenvolvimento desta ferramenta e apresentar o projeto para a comunidade livre, que possivelmente beneficiar-se-á dela.\n\nMais detalhes sobre a ferramenta disponíveis em: www.omnidb.com.br",
    "favorite": "0",
    "length": "30:52",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/nO6CkbMhES4/hqdefault.jpg",
    "title": "OmniDB, aplicação livre brasileira para gerenciamento de múltiplos SGBDs",
    "videos": [
        {
            "code": "nO6CkbMhES4",
            "type": "youtube"
        }
    ],
    "views": "19"
}