{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nPrivacidade digital: defendendo direitos, dados e dispositivos\nTrilha: Tópicos Emergentes - Privacidade e Vigilância\nAutores:\nCarlos Morais dos Santos mostrar currículo\nApresentação:\nDia 15 às 10:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Cada vez mais pessoas interagem mais na web e possuem mais conteúdo digital. Mais e mais também aumentam as considerações sobre a privacidade do indiv íduo, desde os escândalos envolvendo programas de vigilância em massa na internet até malware específico para espionagem. Pessoas mal-intencionadas e sem muitos recursos podem ter acesso aos arquivos de um smartphone, de uma conta de e-mail, de uma página privada da web, ou mesmo monitorar o tráfego de rede de alguém. Ao promover campanhas para a segurança pública que focam na agregação em massa e acumulação de dados do cidadão e atuam em cima de uma quantidade mínima deles, algumas entidades de governo deixam evidente que também não estão respeitando os direitos individuais, mas se utilizando das mesmas práticas que os criminosos.\nE o que as pessoas podem fazer para se proteger? Nesta apresentação para o público geral é discutida a motivação do cidadão de bem em manter-se anônimo e ter seu conteúdo protegido, é traçado um comparativo entre a legislação brasileira e a estadunidense no tema, são citados casos recentes desta prática e então apresentadas técnicas e softwares livres para proteção, como as possibilidades de ofuscação dos dados em seus dispositivos pessoais e da comunicação na internet. Na conclusão é lançada uma reflexão sobre alguns de nossos direitos mais básicos, e a situação na qual eles se encontram comprometidos com a desculpa de serem preservados.",
    "favorite": "0",
    "length": "50:18",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/g9xVhO6sCZ4/hqdefault.jpg",
    "title": "Privacidade digital defendendo direitos, dados e dispositivos",
    "videos": [
        {
            "code": "g9xVhO6sCZ4",
            "type": "youtube"
        }
    ],
    "views": "10"
}