{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nPSL 2.0 - A arquitetura e engenharia unificadas para a Cadeia Produtiva do SL\nTrilha: Ecossistema - Negócios, Migrações e Casos\nAutores:\nCarlos Alberto Jacques de Castro mostrar currículo\nSady Jacques\nApresentação:\nDia 14 às 15:00 na sala 41A (120 minutos)  vídeo\nDescrição:  O movimento de software livre com sotaque brasileiro é a origem da ASL.Org. Depois de duas edições do FISL organizado pela PROCERGS, a realização do e  vento em 2003 estava ameaçada. Então o grupo organizado no PSL-RS fundou a ASL.Org. Desde então a ASL.Org organiza o evento, marco político e organizativo que anualmente anima, organiza e orienta esse processo virtuoso de transformar a Informática Pública no Brasil. Essa é uma iniciativa estratégica porque os nossos equívocos políticos e econômicos tornaram a Informática Pública cada vez mais dependente e dominada pelas corporações do macrossetor.\nA ASL.Org se contrapõe a essa circunstância impulsionando o processo virtuoso apoiado no desenvolvimento de recursos e serviços de trabalhadores/profissionais e de capital locais. É um esforço difícil, mas um balanço justo mostra que alguns componentes essenciais dessa plataforma – Informática Pública – hoje têm participação relevante do software livre e em todos eles a ASL.Org foi importante para essa ocupação e para sustentá-la mesmo com o assédio dos “serviços das nuvens”.\nE o mais “inovador” e exclusivo foi o desdobramento do software livre no conceito mais evoluído na perspectiva da Informática Pública, o software público - que mesmo tendo uma implementação difícil, traz perspectivas muito potentes desde que o Estado [nacional] se liberte da “condição colonial” dominante na C&T e P&D no Brasil.\nO Projeto Software Livre é a mola-mestra da economia do desenvolvimento da Informática Pública. O Movimento vai construindo o ambiente econômico, cultural e institucional que integra com relações solidárias entre todos os agentes que o constituem para nele “conviver” e efetivar as ações de coordenação, cooperação, colaboração e compartilhamento que organizam, fazem funcionar e evoluir o ecossistema da Informática Pública. A medida que o ecossistema se desenvolve, o Projeto será absorvido até tornar-se uma cadeia produtiva integral, quando o ecossistema completar a sua maturidade.",
    "favorite": "0",
    "length": "01:37:58",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/iJvQIQ2SKbI/hqdefault.jpg",
    "title": "PSL 2 0   A arquitetura e engenharia unificadas para a Cadeia Produtiva do SL",
    "videos": [
        {
            "code": "iJvQIQ2SKbI",
            "type": "youtube"
        }
    ],
    "views": "3"
}