{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nSocial Good Hack - Como hackear para o bem social?\nTrilha: Educação - Inclusão Digital\nAutores:\nRafael da Silva Rodrigues mostrar currículo\nApresentação:\nDia 14 às 10:00 na sala 41C (60 minutos)\nDescrição:  Nessa palestra contarei a história da Ousee e de como desenvolvemos um arranjo tecnológico aliado a práticas inovadoras em educação para impactar posi tivamente a sociedade. O projeto surgiu da inquietação de 2 estudantes de TI que desejavam compartilhar seus conhecimentos com a comunidade, passou por vários laboratórios de negócios sociais como social good brasil lab, negócios sociais SEBRAE/SC e Choice Up da Artemisia. Hoje, o projeto consiste em uma formação profissionalizante em TI aliada ao desenvolvimento de habilidades socioemocionais, através de uma plataforma de e-learning gamificada e um programa de e-volunteering.\n\nAdaptamos um sistema de educação corporativo que usa tecnologia de ponta, o LMS Konviva (http://www.konviva.com.br) com uma metodologia open source que compila práticas inovadoras de educação, a Experience Learning (http://www.perestroika.com.br/experiencelearning/), oferecendo formação em TI gratuita para quem está na base da pirâmide social. Uma compilação de metodologias e tecnologias testadas e validadas durantes anos, que estamos adaptando para atender a realidade de um contexto social. Nesse sentido que utilizamos o termo hackear: uma mescla tecnológica e metodológica direcionada para um público que geralmente vive à margem desse contexto. Entenda mais em: http://edu.ousee.com.br/.\n\nDesenvolvemos um programa de e-volunteering, que via WhatsApp, conecta duas pontas da sociedade: os que tiveram mais oportunidades com os que tiveram menos oportunidades, conectando universitários e jovens recém formados a jovens aprendizes. A proposta é realizar um sistema de “matches” similar ao Tinder, conectando “aprendiz e mentor” através das suas afinidades psicológicas com o objetivo de criar novas referências sociais e estimular uma experiência de aprendizagem mais vinculada e conectada com o mundo real. Entenda mais em:https://ousee.typeform.com/to/yHNgT2.",
    "favorite": "0",
    "length": "56:51",
    "likes": "2",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/oESzi3zcpUU/hqdefault.jpg",
    "title": "Social Good Hack   Como hackear para o bem social",
    "videos": [
        {
            "code": "oESzi3zcpUU",
            "type": "youtube"
        }
    ],
    "views": "25"
}