{"description": "Javascript has always been a language with very little syntactic sugar—for better or worse. With ES6/2015, and future iterations,though, Javascript is gaining a more and more abstract and expressive syntax. To some it might appear that our language—which already seems accessible and approachable for beginners— is becoming even more accessible and approachable. However, both the humanities and CS education research have proven that abstraction, while a powerful tool for knowledgeable practitioners, can be an equally powerful foil for beginners. As we enter the era of language-level abstractions in ES6/2015, we are charged with the task of rethinking how we teach JavaScript. Through an interdisciplinary montage I will identify the problem of teaching abstraction as a ubiquitous demand across nearly every domain, and align the issues of creativity and critical thinking in the humanities with issues in computer science. The talk will conclude with a discussion of how the discipline of computer science and that of the humanities can inform each other to produce more effective and creative solutions to both developing and teaching abstractions.", "event": {"name": "JSConf USA 2015", "nickname": "jsconf-us-2015", "twitter": "jsconf", "url": "http://2015.jsconf.us/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "ashley-williams-if-you-wish-to-learn-es62015-from-scratch-you-must-first-invent-the-universe", "length": "25:49", "likes": "721", "recorded": "2015-05-27", "short_description": "Javascript has always been a language with very little syntactic sugar—for better or worse. With ES6/2015, and future iterations", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/DN4yLZB1vUQ/hqdefault.jpg", "title": "Ashley Williams: If you wish to learn ES6/2015 from scratch, you must first invent the universe", "tweet_video": "Ashley%20Williams%3A%20If%20you%20wish%20to%20learn%20ES6/2015%20from%20scratch%2C%20you%20must%20first%20invent%20the%20universe%20https%3A//codeandtalk.com/v/jsconf-us-2015/ashley-williams-if-you-wish-to-learn-es62015-from-scratch-you-must-first-invent-the-universe%20presented%20%40jsconf", "videos": [{"code": "DN4yLZB1vUQ", "type": "youtube"}], "views": "49269"}