{"description": "When you weren't looking, someone stuck a synthesizer into your favorite web browser. The Web Audio API is widely supported and makes it easy—and more importantly, fun—to create, process, and control audio in the browser. We can spin up oscillators, adjust gain, tweak frequencies, and slap on some funky delay. Additionally, we can also take existing sounds and manipulate them to our heart's content. We can grab input from cameras and microphones and use them as we see fit. But, the fun doesn't stop there—we still have the rest of the browser's media APIs at our disposal. We'll talk a little bit about the Web Audio API. We'll explore the browser as a vehicle for creative expression. We'll fire up some audio contexts and connect some nodes. We'll also leverage the getUserMedia Web API, WebSockets, and others to build unique musical instruments that could only be possible in the web browser. We'll not only talk about the API itself, but also some of the fundamental concepts for working with audio and making music.", "event": {"name": "JSConf USA 2015", "nickname": "jsconf-us-2015", "twitter": "jsconf", "url": "http://2015.jsconf.us/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "steve-kinney-building-a-musical-instrument-with-the-web-audio-api-jsconf-us-2015", "length": "30:13", "likes": "65", "recorded": "2015-05-27", "short_description": "When you weren't looking, someone stuck a synthesizer into your favorite web browser. The Web Audio API is widely supported and ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/56spBAgOYfg/hqdefault.jpg", "title": "Steve Kinney: Building a musical instrument with the Web Audio API | JSConf US 2015", "tweet_video": "Steve%20Kinney%3A%20Building%20a%20musical%20instrument%20with%20the%20Web%20Audio%20API%20%7C%20JSConf%20US%202015%20https%3A//codeandtalk.com/v/jsconf-us-2015/steve-kinney-building-a-musical-instrument-with-the-web-audio-api-jsconf-us-2015%20presented%20%40jsconf", "videos": [{"code": "56spBAgOYfg", "type": "youtube"}], "views": "3536"}