{"description": "Programming languages exist to allow programmers to make sense of complex real-world problems. What real world scenarios lend themselves to modelling by objects, and which to functions?\n\nThe first time I met objects was in Turbo Pascal in about 1990. I was completely baffled. I eventually got comfortable with objects in c++, and had that turned on its head by Smalltalk. Then Java objects came along and made me write too much code. Ruby was a breath of fresh air, but it took me 8 years before I really grokked the object model in Ruby. Lately with all the interest in functional languages, I've been glimpsing some overlaps between functions and objects.\n\nI'm still not sure if CLOS is a good idea though.\n\nAccompanied by real-world code examples in Ruby, naturally.\n\nShot by Just Shoot Me Digital - http://www.jsmdigital.co.za/\nMusic is Coma's U Dub by Nokom electro - http://www.jamendo.com/en/track/39238/coma-s-u-dub", "event": {"name": "Rubyfuza 2014", "nickname": "rubyfuza-2014", "twitter": "rubyfuza", "url": "http://www.rubyfuza.org/2014.html"}, "favorite": "0", "file_date": "2016-12-03", "filename": "what-is-an-object-really-or-when-is-an-object-actually-a-function-john-anderson", "length": "41:03", "likes": "0", "recorded": "2014-02-06", "short_description": "Programming languages exist to allow programmers to make sense of complex real-world problems. What real world scenarios lend th", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/uWI-UFm2qAE/hqdefault.jpg", "title": "What is an object, really? OR  When is an object actually a function? - John Anderson", "tweet_video": "What%20is%20an%20object%2C%20really%3F%20OR%20%20When%20is%20an%20object%20actually%20a%20function%3F%20-%20John%20Anderson%20https%3A//codeandtalk.com/v/rubyfuza-2014/what-is-an-object-really-or-when-is-an-object-actually-a-function-john-anderson%20presented%20%40rubyfuza", "videos": [{"code": "uWI-UFm2qAE", "type": "youtube"}], "views": "48"}