{
  "description": "A well-known and respected leader in the Free software community, computer industry veteran Simon Phipps has been involved at a strategic level in some of the world's leading technology companies. In addition to senior leadership positions he has worked in such hands-on roles as field engineer, programmer and systems analyst, as well as run a software publishing company. He worked with OSI standards in the eighties, on the first commercial collaborative conferencing software in the nineties, and helped introduce both Java and XML at IBM. He was a founding Director of the Open Mobile Alliance.\n\nToday he is Chief Strategy Officer at ForgeRock, an independent software vendor devoted to true open source development of an identity-oriented software platform, I3.\n\nHe takes an active interest in several Free and Open Source software organisations, serving as a Director of the Open Source Initiative and on the advisory board of Open Source for America. A widely read thought-leader, he publishes regularly both on his own blog and in many other places such as IDG's ComputerWorldUK. He is part of FossAlliance, a group of proven international consultants for free and open source software.\n\nIn mid-2000 he joined Sun Microsystems where he helped pioneer Sun's employee blogging, social media and community engagement programmes. In 2005 he was appointed Chief Open Source Officer, coordinating Sun's extensive participation in Free and Open Source software communities until he left in 2010. In that role he oversaw the conversion to Free software of the full Java platform, the Solaris UNIX operating system, the SPARC architecture and the rest of Sun's broad software portfolio, all under OSI-approved Free licenses.\n\nHe has been an outspoken advocate of the value of Open Document Format (ODF) and other truly open standards for businesses and governments. He has been an advisor to local and national government agencies across Europe, the Pacific Rim and Latin America as they have devised and implemented strategies around Free and Open Source software and is a co-founder of the FossAlliance consulting alliance.\n\nHe holds a degree in electronic engineering and is a Chartered Engineer and Fellow of the British Computer Society. His personal home page and blog is http://www.webmink.com.\n\nTalk: Keynote",
  "recorded": "2011-11-05",
  "speakers": ["simon-phipps"],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/xFUgh7Rwf6o/hqdefault.jpg",
  "title": "Simon Phipps",
  "videos": [
    {
      "code": "xFUgh7Rwf6o",
      "type": "youtube"
    }
  ]
}
