{
    "description": "http://www.CityTV.nl\nhttp://www.t-dose.org/\n\nT-Dose 2016, Digital personal locker - your open source ehealth privacy box, Maurice Verheesen.\n\nPaper: \n\nYour personal data is very valuable. Unfortunately you have less and less control over this data. Especially data about your health. There are a number of large worldwide initiatives that suggest the idea to store this type of data in the cloud. Not just of individuals, but on a national and even on European level. Meaning all citizens. You don't have much choice. Hospitals, researchers, insurance companies and tech companies making the choice for you.\n\nI believe users need a choice. Maybe you don't want your data in a cloud. Maybe you want your data close and under your direct control. Allowing you to share want you think is ok. A free, open and controllable box, compatible with those large initiatives, but where the user is in control of his/her own data. I like to call this box the Digital Personal Locker. In this talk I'll explain what it is, why it's necessary and how you can join the initiative. I also will show the technical design and hope for critical discussion with you about this! Feedback about what's missing or plain wrong is very very welcome.\n\nRight now I'm gathering the people that are already doing something similar. Think about the Freedombox, the WhiteBox and connecting these people with organisations like the SIDN, the Dutch Tech Center for Life Sciences, NLnet and a group of people who don't want their data stored in Philips - SalesForce eHealth cloud (yes you read that correctly, your health data in a US based cloud of a marketing company!).\n\nHope to see you at the presentation and please give feedback and be critical. We need to do this right, open and secure.",
    "recorded": "2016-11-12",
    "speakers": [
        "maurice-verheesen"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/3g4cIQHaZmA/hqdefault.jpg",
    "title": "Digital personal locker - your open source ehealth privacy box",
    "videos": [
        {
            "code": "3g4cIQHaZmA",
            "type": "youtube"
        }
    ]
}