{"description": "Modern JavaScript libraries and frameworks have become the de facto standard in web application development. However, the great strides in innovation have created framework-specific security vulnerabilities that most modern JavaScript security scanners are not programmed to search for. Personal research with intentionally vulnerable applications as well as live production code has shown that many popular scanners do not detect common application vulnerabilities.\n\nThis talk will discuss some common security pitfalls developers make when working with popular client-side JavaScript frameworks. Intentionally vulnerable applications developed with Backbone.js, Angular.js, Ember.js, and Meteor,js will be attacked and exploited live. Github links to the vulnerable applications used in this presentation will be released after the presentation. Through strengthening the security posture of JavaScript applications, we can take strides towards creating a more secure Internet.\n\nIntro music by @halfbyte", "event": {"name": "JSConf Europe 2015", "nickname": "jsconf-eu-2015", "twitter": "jsconfeu", "url": "http://2015.jsconf.eu/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "anand-vemuri-what-your-scanner-doesnt-tell-you-can-hurt-you-jsconf-eu-2015", "length": "24:37", "likes": "21", "recorded": "2015-09-25", "short_description": "Modern JavaScript libraries and frameworks have become the de facto standard in web application development. However, the great ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/GPce5lNUhtc/hqdefault.jpg", "title": "Anand Vemuri: What Your Scanner Doesn’t Tell You CAN Hurt You | JSConf EU 2015", "tweet_video": "Anand%20Vemuri%3A%20What%20Your%20Scanner%20Doesn%E2%80%99t%20Tell%20You%20CAN%20Hurt%20You%20%7C%20JSConf%20EU%202015%20https%3A//codeandtalk.com/v/jsconf-eu-2015/anand-vemuri-what-your-scanner-doesnt-tell-you-can-hurt-you-jsconf-eu-2015%20presented%20%40jsconfeu", "videos": [{"code": "GPce5lNUhtc", "type": "youtube"}], "views": "980"}