{
    "description": "Whether it is Dallin Oaks quote that reads ““Desires dictate our priorities, priorities shape our choices, and choices determine our actions.” Or Mahatma Gandhi’s quote that goes “Action expresses priorities”, the message I want to bring to the audience is as simple as “It is all about prioritization at the end of the day”. While this applies to all of us in all disciplines, it is even more relevant for us as testers in today’s world of increasing task scope and complexity. Whether it be manual or automated testing, what test matrices to use, what test data to incorporate, what defects we want to pick to defend, what tests to automate, what tool to leverage for automation, the overall success of a quality effort, is based on smart choices that a tester makes. Smart choices are not possible without educated prioritization strategies. For example, if I were an attendee in the Selenium conference even deciding which track session to attend amongst the varied options I have, is a choice driven by an underlying prioritization technique. This proposal is aimed at discussing and presenting core prioritization strategies and mapping them with very specific software testing and test automation examples that the attendees can take back and apply in their day to day practices with immediate effect. One would be amazed to see the varied styles of prioritization that are available – being privy into them and understanding them with examples, will help the attendee choose which style of prioritization works best with their personality and leverage them right away.\n\nMore details: https://confengine.com/selenium-conf-2016/proposal/2507\n\nConference: http://2016.seleniumconf.in",
    "favorite": "0",
    "length": "03:11",
    "likes": "0",
    "recorded": "2016-06-24",
    "speakers": [
        "rajini-padmanaban"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Xv_fUuXtiRI/hqdefault.jpg",
    "title": "It Is All About Prioritization, At The End Of The Day",
    "videos": [
        {
            "code": "Xv_fUuXtiRI",
            "type": "youtube"
        }
    ],
    "views": "44"
}