{"description": "This talk is all about FOSS and solving complex IT problems. We dive into the basics of system dynamics and explain how easy it is for you to use a Jupyter Notebook, InsightMaker and other FOSS tools to solve your (IT) problems. And when there is time we talk about some fads and facts regarding FOSS tools in the Big Data and Machine Learning world in relation to problem solving.\n<p>\nDue to the growth of complex IT related problems good FOSS tools are needed to assist us with complex problem solving. For years I was doomed: Only proprietary tools existed for problem solving. But thanks to a few smart people and many supporters on Kickstarter a good FOSS tool now exists.\n<p>\nBusiness IT Problem solving is not an art. Everyone can learn how to do it and many universities provide courses for learning problem solving using scientific methods.\n<p>\nA great scientific method for solving complex problems with the use of compute power is system dynamics. Great progress was made 50 years ago with the use of system dynamics software for problem solving. But despite this knowledge: The turbulent dynamics within IT projects still hits many of us every day. IT projects still fail.\n\nWe still see unreal expectations, budget overruns, malfunctioning systems, users that sabotages systems, sites still not working on GNU/Linux, unhealthy amounts of technical dept in projects, and even administrators and developers with burn outs due to unsolved problems and too much stress.\n<p>\nFOSS applications for solving these problems will encourage reuse of knowledge and will prevent solving our typical IT problems over and over again. A FOSS tool alone will not solve your problems. But using a good FOSS tool will definitely help! Problem solving should always start by defining and modelling the problem you want to solve. Using system dynamics for solving business IT problems is very powerful. System dynamics is a computer-aided approach for analysis, designing better systems and solving problems for real.\n<p>\nWithin this talk we will focus on why you should prefer using FOSS tools for system modelling for solving your problems. I will explain what the key elements of system dynamics are and how these elements can be used in one of the most used system dynamics FOSS tools available today.\n<p>\nWith the help of system dynamics and a FOSS tool we dive into some typical IT problems we are all familiar with. This to experience the power of system dynamics and the use of this FOSS tool.\n<p>\nOutline of the talk:\n<ul>\n  <li>What is system dynamics?</li>\n  <li>How to model a complex dynamic IT problem?</li>\n  <li>Using FOSS software for creating a system dynamics model for typical IT related problems (including on stage demo!)</li>\n  <li>Advantages and disadvantages of using FOSS tools for problem solving</li>\n</ul>\nAfter this talk everyone will be able to start building a simple system dynamic model for IT related problems using the FOSS tool showed.\",\n\n", "event": {"name": "T-DOSE 2016", "nickname": "t-dose-2016", "twitter": "TDOSE", "url": "http://www.t-dose.org/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "t-dose-2016-solving-complex-problems-using-foss-tools-maikel-mardjan", "length": "42:23", "likes": "0", "recorded": "2016-11-12", "short_description": "This talk is all about FOSS and solving complex IT problems. We dive into the basics of system dynamics and explain how easy it ", "speaker_twitters": " @maikelmardjan", "speakers": {"maikel-mardjan": {"episodes": [], "hosting": [], "info": {"country": "Apeldoorn, The Netherlands", "github": "nocomplexity", "home": "https://nocomplexity.com/", "name": "Maikel Mardjan", "twitter": "maikelmardjan"}, "videos": [{"event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "filename": "t-dose-2015-better-it-security-go-for-open-architecture-open-security-app-maikel-mardjan", "recorded": "2015-11-28", "thumbnail_url": "https://i.ytimg.com/vi/1VG8hYiY0vg/hqdefault.jpg", "title": "Better IT security, Go for open architecture, open security app"}, {"event": {"name": "T-DOSE 2016", "nickname": "t-dose-2016", "twitter": "TDOSE", "url": "http://www.t-dose.org/"}, "filename": "t-dose-2016-solving-complex-problems-using-foss-tools-maikel-mardjan", "recorded": "2016-11-12", "thumbnail_url": "https://i.ytimg.com/vi/D9HZBTPvWho/hqdefault.jpg", "title": "Solving complex problems using FOSS tools"}, {"event": {"name": "T-DOSE 2016", "nickname": "t-dose-2016", "twitter": "TDOSE", "url": "http://www.t-dose.org/"}, "filename": "t-dose2016-architecture-open-architecture-and-foss-tools-maikel-mardjan", "recorded": "2016-11-12", "thumbnail_url": "https://i.ytimg.com/vi/PifzCV9Wtg4/hqdefault.jpg", "title": "Architecture, Open Architecture and FOSS tools"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/D9HZBTPvWho/hqdefault.jpg", "title": "Solving complex problems using FOSS tools", "tweet_video": "Solving%20complex%20problems%20using%20FOSS%20tools%20https%3A//codeandtalk.com/v/t-dose-2016/t-dose-2016-solving-complex-problems-using-foss-tools-maikel-mardjan%20presented%20%40TDOSE%20by%20%40maikelmardjan", "videos": [{"code": "D9HZBTPvWho", "type": "youtube"}], "views": "43"}