{"blasters": ["privacy"], "description": "In my presentation I will focus philosophically on the question how we should assess the importance of privacy within the current privacy debate.\nRecently there has been much attention to the different, far-reaching ways in which our privacy is being invaded.\nIt is commonly referred to as a 'threat to our privacy'.\nHowever, this raises the question what exactly is being threatened - and many different claims are made in an attempt to address this, ranging from the importance of consumer control to political notions like freedom and democracy.\nThere seems to be a lack of words to describe what is at stake, and a lack of consensus to defend it properly. This is highly problematic for both privacy activists and ordinary citizens.\n<p>\nI will focus on the following questions: what is privacy and how do we refer to it?\nIs privacy a \"right\", a private or public \"interest\" or can we understand it as a new kind of currency (commodification of our personal data)?\nAnd what do these different notions mean for the way we perceive the 'threat'?\nFurthermore, I will compare the different notions of privacy and what these differences mean in the defense of our privacy. In other words: what could be a proper way to claim our right to privacy?\n<p>\nLaurine Blonk presented and published her philosophical bachelor thesis on the topic of privacy as 'top level' undergraduate research at the Student Research Conference 2015 (www.studentresearchconference.nl).\n<p>\nShe has work experience as a lecturer in philosophy and \"levensbeschouwing\" and also as a research assistant.\n<p>\nCurrently she is pursuing a masters degree in both Humanistic Studies (University for Humanistic Studies, Utrecht) and Philosophy (Erasmus University Rotterdam). She is a member of the NLLGG.\n<p>\n<ul>\n   <li><q>Privacy paradox: People say they value privacy, but they don't act according to it.</q></li>\n   <li><q>Ppl don't want to sign up to the conference due to privacy concerns, but will happily fill out a form for a $5 discount.</q></li>\n   <li><q>Privacy is right as a protection agains to much (bureaucratic) power of the state or companies.</q></li>\n</ul>\n", "event": {"name": "T-DOSE 2016", "nickname": "t-dose-2016", "twitter": "TDOSE", "url": "http://www.t-dose.org/"}, "favorite": "0", "featured": "2016-12-17", "file_date": "2016-12-03", "filename": "t-dose-2016-perspectives-on-privacy-laurine-blonk", "length": "25:02", "likes": "0", "recorded": "2016-11-12", "short_description": "In my presentation I will focus philosophically on the question how we should assess the importance of privacy within the curren", "speaker_twitters": "", "speakers": {"laurine-blonk": {"episodes": [], "hosting": [], "info": {"name": "Laurine Blonk"}, "videos": [{"event": {"name": "T-DOSE 2016", "nickname": "t-dose-2016", "twitter": "TDOSE", "url": "http://www.t-dose.org/"}, "filename": "t-dose-2016-perspectives-on-privacy-laurine-blonk", "recorded": "2016-11-12", "thumbnail_url": "https://i.ytimg.com/vi/AfauSLV5-90/hqdefault.jpg", "title": "Perspectives on privacy"}]}}, "tags": [{"link": "privacy", "text": "privacy"}], "thumbnail_url": "https://i.ytimg.com/vi/AfauSLV5-90/hqdefault.jpg", "title": "Perspectives on privacy", "tweet_video": "Perspectives%20on%20privacy%20https%3A//codeandtalk.com/v/t-dose-2016/t-dose-2016-perspectives-on-privacy-laurine-blonk%20presented%20%40TDOSE%20%23privacy", "videos": [{"code": "AfauSLV5-90", "type": "youtube"}], "views": "30"}