{
    "description": "An Abusive Relationship with AngularJS\n\nDescription:\n---------------\nSome voices claim that \"Angular is what HTML would have been if it had been designed for building web applications\". While this statement may or may not be true, is certainly accounts as one of the bolder ones a JavaScript web framework can ever issue. And where boldness is glistening like a German Bratwurst sausage in the evening sun, a critical review from a grumpy old security person shouldn’t be too far away.\n\nThis talk will have a stern, very stern look at AngularJS in particular and shed light on the security aspects of this ever-popular tool. Did the super-hero framework do everything right and follow its own super-heroic principles? Does AngularJS increase or rather decrease the attack surface of a web application? How does AngularJS play along with the Content Security Policy, and was it a good idea to combine this kind of security with futuristic feature creep? And what about AngularJS version 2.0? Beware that we won’t stop at glancing at the code itself, investigating security best practices, and verifying compatibility and other common things that contribute to robust security (or lack thereof).\n\nWe will cross the moral border and see if the AngularJS team could notice rogue bug tickets. A pivotal question that everyone is wondering about is: Have they successfully kept evil minds like yours truly speaker here from introducing new security bugs into the code base? This talk is a reckoning with a modern JavaScript framework that promises a lot and keeps even more, not necessarily for the best for developers and users. We will conclude in deriving a general lesson learnt and hopefully agree that progress doesn't invariably mean an enhancement.\n---------------\n\nTalk & speaker bio:\nhttps://beyondtellerrand.com/events/duesseldorf-2016/speakers/mario-heiderich\n\nMORE INFORMATION\n\nWatch this little recap video to get an impression how beyond tellerrand events look like:\nhttp://vimeo.com/69823900\n\nInformation about beyond tellerrand:\nhttp://beyondtellerrand.com/\nhttp://twitter.com/btconf",
    "favorite": "0",
    "length": "48:57",
    "likes": "2",
    "recorded": "2016-05-09",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/BvpE5FPXYXo/hqdefault.jpg",
    "title": "An Abusive Relationship with AngularJS - Mario Heiderich - btconfDUS 2016",
    "videos": [
        {
            "code": "BvpE5FPXYXo",
            "type": "youtube"
        }
    ],
    "views": "116"
}