{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nAnalise de seguranca da arquitetura computacional\nTrilha: Administração - Segurança\nAutores:\nRodrigo Rubira Branco mostrar currículo\nApresentação:\nDia 15 às 15:00 na sala 41B (60 minutos)  vídeo\nDescrição:  Analise de seguranca da arquitetura computacional:  O que um pesquisador de software pode te ensinar sobre seu hardware.\n\nEsta palestra procura clarif  icar diferentes aspectos da arquitetura do computador moderno, com enfase nas plataformas Intel, mas com uma mente aberta.  Durante a palestra, sera definido ameacas existentes, processos e novas (ou chegando) capacidades de seguranca, procurando enderecar as dificuldades em se proteger redes de computadores.  Como usual, o palestrante ira enfrentar o FUD (sigla para medo, incertezas e duvidas) que é criado por fornecedores de segurança ao abordar backdoors em hardware, o poder que elas oferecem e quão difícil seria encontrá-las, e também irá propor formas de se proteger (tanto em ambientes virtuais como em ataques a cadeia de suplementos – as piadas envolvendo a NSA serão apresentadas apenas durante a palestra, mas não no resumo da mesma, afinal o palestrante mora nos EUA).  Se você não sabe muito sobre seu computador e como ele realmente funciona, esta palestra é para você.  Se você sabe, esta palestra desafiará seu conhecimento e experançosamente conseguirá te ensinar uma (ou cinco) coisas que você não sabia anteriormente.",
    "favorite": "0",
    "length": "50:35",
    "likes": "2",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gpJjXBqVKz8/hqdefault.jpg",
    "title": "Analise de seguranca da arquitetura computacional",
    "videos": [
        {
            "code": "gpJjXBqVKz8",
            "type": "youtube"
        }
    ],
    "views": "85"
}