{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nDireitos autorais e internet: o debate sobre streaming de música\nTrilha: Tópicos Emergentes - Governança da Internet\nAutores:\nGabriel Itagiba\nApresentação:\nDia 13 às 19:00 na sala 41E (60 minutos)  vídeo\nDescrição:  Neste ano, o Ministério da Cultura propôs uma consulta pública sobre duas instruções normativas. Em conjunto, elas regulam os direitos autorais no âmb  ito online, legitimando a cobrança de execução pública pelo ECAD em serviços de streaming e download?. A necessidade dessa regulamentação se deve pelo surgimento de novos canais de distribuição de conteúdo, como Spotify, Netflix e YouTube. Nossa lei de direitos autorais é de 1998, ou seja, redigida antes da internet como a que temos hoje em dia?, portanto não trata do ambiente online e de fato precisa de ser revista. No cenário atual, as próprias empresas de distribuição de conteúdo pagam diretamente ao artista.? Contudo?,? o ECAD vem tentando legitimar a cobrança de execução pública das obras presentes na internet, seja por streaming ou por download. Esse campo cinzento de regulação atual gera controvérsias e é motivo de ações judiciais, que hoje se encontram no Superior Tribunal de Justiça. Porém, as instruções normativas ?propostas pelo MINC são discutíveis em razão da dificuldade de se enquadrar o streaming e o download ?na hipótese prevista em lei que tipifica a execução pública. Além disso, estas podem levar ?à inviabilidade desse tipo de serviço no Brasil, ou deixá-lo demasiadamente caro. \nO atual debate é de grande importância, pois pode mudar o modo em que consumimos cultura e afetar o surgimento de modelos de negócios inovadores no Brasil.",
    "favorite": "0",
    "length": "24:59",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/3g0fe3A3cKM/hqdefault.jpg",
    "title": "Direitos autorais e internet o debate sobre streaming de música",
    "videos": [
        {
            "code": "3g0fe3A3cKM",
            "type": "youtube"
        }
    ],
    "views": "10"
}