{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nIncentivando crianças e jovens a criarem aplicativos com MIT App Inventor\nTrilha: Educação - Educação\nAutores:\nAna Luisa Veroneze Solórzano mostrar currículo\nIago da Cunha Corrêa mostrar currículo\nAndrea Schwertner Charão mostrar currículo\nLucas Ferreira da Silva\nRafael Gauna Trindade mostrar currículo\nApresentação:\nDia 15 às 11:00 na sala 41C (60 minutos)  vídeo\nDescrição:  Crianças e jovens são facilmente atraídos por novas tecnologias e estão habituados a utilizar aplicativos, mas não costumam saber que também podem pro duzi-los. Nesta palestra, vamos apresentar o MIT App Inventor, um software livre que facilita a criação de aplicativos móveis, usando programação visual. Também vamos relatar nossas experiências de uso desta ferramenta com alunos de ensino fundamental e médio, num projeto chamado 'Clube de Computação', que está em funcionamento desde 2014, em Santa Maria, RS. Esse projeto segue uma tendência mundial de disseminação de fundamentos de computação ao público em geral e, em especial, a crianças e jovens. Nas oficinas que realizamos com este público, pudemos observar facilidades e obstáculos de uso do MIT App Inventor. Na palestra, discutiremos essas observações, as lições aprendidas e disponibilizaremos o material de apoio desenvolvido, visando facilitar a replicação da experiência em outros tempos e espaços.",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/97H1S0p4Tsg/hqdefault.jpg",
    "title": "Incentivando crianças e jovens a criarem aplicativos com MIT App Inventor",
    "videos": [
        {
            "code": "97H1S0p4Tsg",
            "type": "youtube"
        }
    ]
}