{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nO lado negro da IoT: A tirania mascarada como desejo de fazer o bem\nTrilha: Tópicos Emergentes - Internet das Coisas\nAutores:\nMaiara Ferrari\nApresentação:\nDia 13 às 12:00 na sala 41B (60 minutos)  vídeo\nDescrição:  A internet das coisas vem com a promessa de facilitar o cotidiano das pessoas. Objetos do dia a dia passarão a estar conectados em rede. Carros, pulse  iras, camas, geladeiras, despertadores, fechaduras e até sofás estarão munidos de diversos sensores, responsáveis por monitorar o comportamento humano.  E serão tomadores de decisões, agindo de forma automática.  A cama relatará ao plano de saúde a quantidade de horas dormidas. A geladeira avisará ao nutricionista a qualidade da alimentação. O carro emitirá à fiscalização de transito se houve ocupação de vaga tempo a mais do que permitido. A humanidade já é dependente da tecnologia, será que também se tornará refém?\n\nDiante disso, percebe-se a dialética entre tecnologia e humanidade: o homem tornou-se escravo de sua própria concepção. E a tecnologia, algoz do homem. Isso pode ser vislumbrado nos “corretores de comportamento”. Um exemplo, são as pulseiras Pavlok, que vem com três aplicativos (fitness, despertador e monitor de hábitos na internet, onde seu método de repressão ao usuário é através de choques elétricos. Seu lema: “Pavlok não apenas monitora, mas transforma quem você é”.\n\nAssim, esse novo tipo de arranjo coloca sobre o ser humano toda a culpa e peso por seus “deslizes”. Mas as causas profundas que ocasionam esses ‘erros comportamentais’ são ignoradas por esses aplicativos, como a ignorância, pobreza ou doenças psíquicas e físicas.\nO tema dessa palestra será abordar a internet das coisas vs comportamento humano sob o aspecto da ‘tirania’ respaldada no desejo de educar. E essa vigilância comportamental toda traz à tona importantes questionamentos: A dependência da humanidade na tecnologia está transformando o indivíduo em máquina. Como o software livre pode ajudar na autonomia, interação e ‘preservação’ de dados e da vida de seus usuários? É importante ressaltar que a tecnologia é uma aliada do indivíduo, e não a protagonista de sua vida. Será que o ser humano já se conscientizou disso?",
    "favorite": "0",
    "length": "23:23",
    "likes": "1",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Ictqft0vKxI/hqdefault.jpg",
    "title": "O lado negro da IoT A tirania mascarada como desejo de fazer o bem",
    "videos": [
        {
            "code": "Ictqft0vKxI",
            "type": "youtube"
        }
    ],
    "views": "45"
}