{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nP4 - Beyond Openflow\nTrilha: Desenvolvimento - Linguagens de programação\nAutores:\nMauro Ramos Moura\nNatal Vieira de Souza Neto\nApresentação:\nDia 13 às 11:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Esta palestra visa apresentar a linguagem de programação P4 - Programming Protocol Independent Packet Processors, uma linguagem open source para equip  amentos de rede (switches, roteadores , NICs), que permite a criação de pipelines de encaminhamento independentes de protocolo.\nP4 é utilizado em conjunto com outras tecnologias SDN, como o Openflow, que especifica exatamente quais os campos do cabeçalho podem ser usados para se criar regras de encaminhamento nas flow-tables. P4 permite a criação de cabeçalhos customizados, onde o formato de cada campo é especificado em uma estrutura de dados, e o comportamento do equipamento em relação a cada pacote é determinado através de código, fornecendo assim maior flexibilidade e capacidade de inovação ao desenvolvedor de aplicações SDN. P4 também permite que o código criado seja compilado para múltiplos targets, isto é, diversos hardwares de vendors diferentes. Com isto, é possível desenvolver aplicações reconfiguráveis realmente independentes de hardware e protocolos de rede.  \nDurante a palestra será abordado o que é a linguagem P4, como ela se relaciona com as tecnologias atuais de SDN, como montar seu ambiente de desenvolvimento e que tipos de aplicações podem ser criadas utilizando a mesma.",
    "favorite": "0",
    "length": "51:50",
    "likes": "1",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/1aCpWxIiYTs/hqdefault.jpg",
    "title": "P4   Beyond Openflow",
    "videos": [
        {
            "code": "1aCpWxIiYTs",
            "type": "youtube"
        }
    ],
    "views": "21"
}