{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nPuppet, Ansible, Salt: Maturidade, Simplicidade e Flexibilidade\nTrilha: Administração - Administração de Sistemas\nAutores:\nDiego Francisco de Gastal Morales mostrar currículo\nApresentação:\nDia 15 às 14:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Puppet, Ansible e Salt são 3 das principais ferramentas livres de gerência de configuração no cenário atual (some a elas apenas Chef e CfEngine e temo  s todos os principais atuais nomes dessa categoria).\n\nAs 3 ferramentas tem crescido muito nos últimos anos, se tornando cada vez mais populares. As necessidades de gerenciar ambientes em escalas cada vez maiores, o crescimento de metodologias ágeis e da cultura DevOps, entre outros fatores, tem tornado cada vez mais necessárias e pervasivas a automação de processos e testes, e a abordagem de infraestrutura como código.\n\n O objetivo da palestra é apresentar o básico sobre cada ferramenta e sobre o \"ecossistema\" de cada uma, comentar e discutir as principais diferenças entre elas e fornecer aos participantes uma série de referências e incentivos para que eles possam descobrir mais e avaliar qual a mais adequada para os seus ambientes.\n\nSerão mostrados alguns exemplos de código fazendo a mesma tarefa em cada uma, e caso o tempo permita também será feito um brevíssimo demo de ferramentas de dashboard/controle para elas, mostrando a execução de receitas de código. Para isso será utilizado um ambiente Vagrant que estou criando no meu github com as várias ferramentas e exemplos prontos para uso: https://github.com/dgmorales/vagrant-cfgmgmt-sandbox.\n\nA palestra já foi apresentada em um Meetup DevOps Carioca em abril/2016, e os slides utilizados naquela ocasião estão disponíveis em http://dgmorales.info/talks/cm-pas.",
    "favorite": "0",
    "length": "50:38",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/1hHW7c7MM3o/hqdefault.jpg",
    "title": "Puppet, Ansible, Salt Maturidade, Simplicidade e Flexibilidade",
    "videos": [
        {
            "code": "1hHW7c7MM3o",
            "type": "youtube"
        }
    ],
    "views": "47"
}