{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nSistema de Gestão Pública Escolar\nTrilha: Ecossistema - Negócios, Migrações e Casos\nAutores:\nFilipe Augusto Gonçalves mostrar currículo\nMurilo Sodré de Souza mostrar currículo\nJhony Luiz de Almeida mostrar currículo\nCleverson Alves Paes\nCristiano Siebert\nLuis Augusto Leite\nApresentação:\nDia 14 às 15:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Sistema de gestão pública escolar: Sucessor do I-educar\n\nA Secretaria de Educação de Itajaí desenvolveu o software de gestão pública escolar para ser   o sucessor do i-educar, sistema este também desenvolvido pelo poder municipal de Itajaí e que foi inovador na área de gestão escolar.\nFundamentado nas características de funcionamento das unidades de ensino públicas do Brasil, tem por objetivo fazer a gestão administrativa de uma ou mais unidades de ensino em uma rede escolar.\nEste sistema está preparado para atender a todas as atribuições administrativas de uma unidade escolar, desde a criação dos cursos até o controle de presenças, avaliações.\nEntre as principais características estão: Criação e gestão de cursos, etapas, turmas, sistemas de avaliação, calendário escolar, matricula de alunos e funcionários e  diário escolar.\nVale ressaltar que este sistema já está pronto para atender a nova lei de diretrizes básicas na questão da avaliação qualitativa. Sendo assim é possível escolher qual sistema de avalição poderá ser utilizado para cada ano escolar.\nUtilizando as tecnologias Symphony, AngularJS, Materialize e Mysql este sistema tem a interface Web como a principal forma de acesso porém é também totalmente responsivo para acesso em tablets e smartphones, permitindo aos professores e alunos acessarem diários e boletins diretamente de seus dispositivos móveis.\nTodos os dados necessários para atender ao censo escolar estão contidos dentro deste sistema, assim a exportação automatizada dos dados para o sistema Educacenso é uma funcionalidade futura prevista no projeto.",
    "favorite": "0",
    "length": "46:27",
    "likes": "0",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/MqfWD3t78ZA/hqdefault.jpg",
    "title": "Sistema de Gestão Pública Escolar",
    "videos": [
        {
            "code": "MqfWD3t78ZA",
            "type": "youtube"
        }
    ],
    "views": "80"
}