{
    "description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nThe Open Source Positive Feedback Loop: The history of Rocket.Chat\nTrilha: Ecossistema - Negócios, Migrações e Casos\nAutores:\nGabriel Engel mostrar currículo\nApresentação:\nDia 14 às 18:00 na sala 41B (60 minutos)  vídeo\nDescrição:  The story of Rocket.Chat.  An open source project on GitHub that got \"slash dotted\" on the first week after launching just a proof of concept. This se  ssion highlights the project characteristics that motivated an international community of contributors from 22 countries to converge on a common passion, and how the project is transformed to product - shaped by a community that needed it to happen.\n\nToday’s successful open source projects are global phenomenon - uniting individuals with common passion around the world. But what make some projects gain momentum and stand out while others fades into oblivion? If you are planning to build and launch a open source project, your community is what you should be most concerned about and catered for. So how exactly can you create a financially healthy project, without alienating the community, while fostering engagement and inspiring contributors?\nGabriel Engel, founder of Rocket.Chat, an open source chat platform, with scalable application server, web, desktop and mobile clients, receiving over 5k stars on Github, thousands of server installs worldwide and over a hundred contributors, chronicles the project’s own rocket ride to instant stardom, the surprising cost of fame, and the untold months of hard work that follows to build out a thriving and resilient community.\nThis passionate and true story will explain why accidental success stories are often not accidental. This talk will explore what in retrospect were the key factors for the impressive growth of Rocket.Chat, from the point of view its founder, core contributors and community.",
    "recorded": "2016-07-13",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/1ygt47EDJUI/hqdefault.jpg",
    "title": "The Open Source Positive Feedback Loop The history of Rocket Chat",
    "videos": [
        {
            "code": "1ygt47EDJUI",
            "type": "youtube"
        }
    ]
}