{"abstract": "https://events.drupal.org/neworleans2016/sessions/building-empathy-enterprise", "description": "When designers talk and write about “designing with empathy,” all too often they focus on creating something entirely new. How do you observe and listen to people in order to find a problem they didn’t know they had? How do you use those insights to create a new business, or develop a new product? \n\nUnfortunately, that’s not the world most of us live in. As designers, we’re often tasked with incrementally improving existing experiences, or creating new features that have to live within an existing architecture. What’s more, creating those experiences requires working across a multitude of internal fiefdoms, each with its own set of priorities. How do you balance all of these considerations while maintaining a focus on user-centered design?\n\nIn this session Dani Nordin, Director of Digital UX at Pegasystems, will discuss:\nThe differences between creating new things and building on top of existing infrastructure, and what they mean for UX Designers\nThe role of the authoring experience in creating a successful experience for users;\nHow to help high-ranking stakeholders understand the needs of people “on the ground;\"\nThe importance of measuring and benchmarking UX to gain the buy-in needed to support a user-centric culture;\nHow to create and take advantage of research and empathy-building opportunities within your organization.\nThis session is for you if you:\n\nwork in-house on large, complex projects that involve multiple stakeholder groups and competing priorities; \nget frustrated that features get pushed through because a VP wants it, not because they create a better experience for their users;\nwant to create a culture of empathy within your team, not just for the end users of the things you create, but for the people who have to maintain them day to day.\nAbout the Presenter\n\nDani Nordin is Director of Digital UX at Pegasystems, where she oversees user experience improvements for all of Pegasystems’ global web properties. She is the author of several books for O’Reilly, including Drupal for Designers, Planning and Managing Drupal Projects, and Drupal Development Tricks for Designers. She has also created two video series for O'Reilly, Learning UX Fundamentals (2015) and Designing with Empathy (2015).", "event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-new-orleans-2016-building-empathy-in-the-enterprise", "length": "26:20", "likes": "0", "recorded": "2016-05-09", "short_description": "When designers talk and write about “designing with empathy,” all too often they focus on creating something entirely new. How d", "speaker_twitters": " @danigrrl", "speakers": {"dani-nordin": {"episodes": [], "hosting": [], "info": {"country": "Watertown, MA, USA", "github": "danigrrl", "home": "http://tzk-design.com/", "name": "Dani Nordin", "twitter": "danigrrl"}, "videos": [{"event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "filename": "drupalcon-new-orleans-2016-building-empathy-in-the-enterprise", "recorded": "2016-05-09", "thumbnail_url": "https://i.ytimg.com/vi/Pt3c0dQciBk/hqdefault.jpg", "title": "Building Empathy in the Enterprise"}, {"event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "filename": "drupalcon-new-orleans-2016-drupal-admin-as-an-application-more-javascript-in-core", "recorded": "2016-05-09", "thumbnail_url": "https://i.ytimg.com/vi/Sn4jDELDNMY/hqdefault.jpg", "title": "Drupal (admin) as an application: More JavaScript in core?"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/Pt3c0dQciBk/hqdefault.jpg", "title": "Building Empathy in the Enterprise", "tweet_video": "Building%20Empathy%20in%20the%20Enterprise%20https%3A//codeandtalk.com/v/drupalcon-new-orleans-2016/drupalcon-new-orleans-2016-building-empathy-in-the-enterprise%20presented%20%40drupalconNA%20by%20%40danigrrl", "videos": [{"code": "Pt3c0dQciBk", "type": "youtube"}], "views": "80"}