{"abstract": "https://events.drupal.org/neworleans2016/sessions/ask-not-what-open-source-can-do-you%E2%80%A6-what-you-can-do-open-source", "description": "The largest and most influential companies, non-profits, universities, and governments in the world are using open source to create value within their organizations. These organizations benefit from the use of open source software, but not all of them capitalize on the full value of embracing the communities that support open source. It's not enough to choose to use open source anymore: it is time for organizations to step into the center of the community to contribute, drive innovation, lead with practical requirements and assist in further developing the projects that are helping them to achieve their missions every day.\n\nOpen source involvement is not a purely altruistic proposition. Organizations who build contribution into the jobs of their digital teams are rewarded with tangible business benefits including greater return on investment (ROI) and lower total cost of ownership (TCO) for their software platforms.\n\nMany organizations have blazed a trail to demonstrate what good open source citizenship should look like. In the Drupal community, we have remarkable examples to follow like NBC Universal, Pfizer, Redhat, the World Bank, Stanford, United Nations, and the White House.\n\nThis talk will center on the organizations who truly embrace open source, their leadership principles, their community practices and how they make open source part of their everyday work, culture, and mission. Anyone tasked with building performing software teams, making IT investments or leading technology change including CTO's and CIO's will learn:\n\nHow organizations of all sizes, budgets, and missions contribute to open source;\n\nBarriers these companies have overcome to get involved and how they did it;\n\nConcrete strategies for incorporating a culture of open source into your organization;\n\nThe positive impact open source involvement can have to IT investment;\n\nHow to get access to better talent by leveraging open source involvement.", "event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "favorite": "0", "file_date": "2016-12-26", "filename": "drupalcon-new-orleans-2016-ask-not-what-open-source-can-do-for-you", "length": "57:32", "likes": "1", "recorded": "2016-05-09", "short_description": "The largest and most influential companies, non-profits, universities, and governments in the world are using open source to cre", "speaker_twitters": " @JeffWalpole", "speakers": {"jeff-walpole": {"episodes": [], "hosting": [], "info": {"country": "WA, USA", "github": "jeffwalpole", "home": "https://www.phase2technology.com/", "name": "Jeff Walpole", "twitter": "JeffWalpole"}, "videos": [{"event": {"name": "DrupalCon New Orleans 2016", "nickname": "drupalcon-new-orleans-2016", "twitter": "drupalconNA", "url": "https://events.drupal.org/neworleans2016"}, "filename": "drupalcon-new-orleans-2016-ask-not-what-open-source-can-do-for-you", "recorded": "2016-05-09", "thumbnail_url": "https://i.ytimg.com/vi/hwTEq7oyzZU/hqdefault.jpg", "title": "Ask Not What Open Source Can Do For You"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/hwTEq7oyzZU/hqdefault.jpg", "title": "Ask Not What Open Source Can Do For You", "tweet_video": "Ask%20Not%20What%20Open%20Source%20Can%20Do%20For%20You%20https%3A//codeandtalk.com/v/drupalcon-new-orleans-2016/drupalcon-new-orleans-2016-ask-not-what-open-source-can-do-for-you%20presented%20%40drupalconNA%20by%20%40JeffWalpole", "videos": [{"code": "hwTEq7oyzZU", "type": "youtube"}], "views": "76"}