{
    "description": "Accessibility Camp NYC - Sep 17 2016\n\nMark Surabian - Assistive Technology: Solutions for Increasing Learner Independence and Classroom Participation\n\nRemediation and therapy take time, whereas technology compensates immediately to enhance learner confidence and access through actual participation until the impact of the former takes hold. AT is an often an effective solution to keep learners with disabilities \"engaged and responsible\" for their own classwork and keeps them performing at levels more accurate to their real potential throughout their educational careers. This presenter will briefly discuss why AT is often overlooked as a support to enhance learner participation; describe the challenges of functionally incorporating AT into the classroom as depicted through real case studies; and provide an overview of effective AT tools used for individuals with disabilities. \n\nSpeaker Bio ATHelp.org @marksurabian \nMark Surabian founded ATHelp.org, an assistive technology website and an associated free clinic in NYC which serves children and adults with communication, vision, learning, and physical challenges. He has provided consultation to school systems and agencies on AT for almost 30 years, and is an instructor on Assistive Technologies at Pace University’s Graduate School of Education.\n\nABOUT ACCESSIBILITY CAMP\nNew York City’s second accessibility camp was hosted at NYU MAGNET2 Metrotech Center (Brooklyn, NY 11201) on Saturday September 17, 2016. Focusing on users with different disabilities, sessions covered digital accessibility topics from the web (technical to tactical), desktop software, assistive technology, hacking, education, elections, and everything in between.",
    "favorite": "0",
    "length": "32:34",
    "likes": "0",
    "recorded": "2016-09-17",
    "speakers": [
        "mark-surabian"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/SPZ9Nut5Oq0/hqdefault.jpg",
    "title": "Assistive Technology: Solutions for Increasing Learner Independence",
    "videos": [
        {
            "code": "SPZ9Nut5Oq0",
            "type": "youtube"
        }
    ],
    "views": "19"
}