{
  "description": "Accessibility Camp NYC - Sep 17 2016\n\nWhile we have come along way in terms of access, I believe that there is one fundamental thing that we are missing when we speak about it: That we are making things accessible for humans. The access that we currently have is acceptable, but it does not make us feel like people. Through this access we are segregated from mainstream society. In this talk, I will give example of how the current access does this and offer up solutions as to how were can humanize disability access. \n\nSpeaker Bio @phoebefico \"When I first went away to college, I had an extremely difficult time getting around campus because of the terrain and snow. I thought my body was the problem. So, I became depressed. So, severely depressed that I didn’t go to class and I almost failed out of school. What I would learn was that that their were systematic barriers at the school—and in the world— that set me up to fail. So, when I came back to school for my sophomore year, I got angry instead of sad and I started a branch of undergraduate government dedicated to students with physical disabilities (the first of its kind at the school and still going strong today). With the branch of government, I started support groups and one-on-one counseling. So that students could discuss their frustrations and feelings about being disabled in a safe space. I also organized speakers to come and tell their stories or educate the student body on important issues facing the disabled community. The speakers included comedian Zach Anner, creator of the ALS Ice Bucket challenge, Pete and Nancy Frates and trans and disability activist, Eli Clare. Also as founder and chair of the branch of government, I spoke to the administration and faculty about the systematic challenges students faced like lack of accessible transportation on campus, lack of accessible syllabi and integrating disability into the conversation about a diverse student body. Outside of the council, I was a member of the Gay and Lesbian Council and spoke at many panels on the bisexual experience and the queer black experience. I also participated and helped organize Black Lives Matter protests on campus. \"\n\n\nABOUT ACCESSIBILITY CAMP\nNew York City’s second accessibility camp was hosted at NYU MAGNET2 Metrotech Center (Brooklyn, NY 11201) on Saturday September 17, 2016. Focusing on users with different disabilities, sessions covered digital accessibility topics from the web (technical to tactical), desktop software, assistive technology, hacking, education, elections, and everything in between.",
  "recorded": "2016-09-17",
  "speakers": ["phoebe-fico"],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/G3zSJTco_Ms/hqdefault.jpg",
  "title": "Access Your Humanity",
  "videos": [
    {
      "code": "G3zSJTco_Ms",
      "type": "youtube"
    }
  ]
}