{
    "description": "Accessibility Camp NYC - Sep 17 2016\n\n\"When encountering an inaccessible product or design, our first—and often most productive—response includes increasing awareness through outreach and education. But what about when these efforts aren't successful, and the need for access remains? This session is about eyes-free accessibility through the back door, focusing on members of the blind and low vision community that have scraped, soldered, coded, cracked, or hacked their way to accessing otherwise inaccessible designs. From talking Linux and dodging ebook DRM to eyes-free Pokemon, this talk will discuss the ingenuity and persistence of the blind community while opening a dialogue about the ethics of access. Come prepared to play—attendees will have the opportunity to interact with some of these approaches during the talk.\" \n\nSpeaker Bio http://www.smythp.com/ @psmyth01 Patrick Smyth is a Ph.D. student in English and Digital Fellow at The Graduate Center, CUNY. He is a developer for DH Box, an NEH-funded project to make the digital humanities more widely accessible, and recently led curriculum design for the Digital Research Institute, a week-long intensive course in digital methods at the Graduate Center. Patrick writes about digital platforms, especially those facilitating new modes of reading. He's also an inveterate tinkerer, and recently released a simple screen reader written in the Lisp programming language. Patrick is a former Fulbright Fellow, and teaches at Queens College.\n\nABOUT ACCESSIBILITY CAMP\nNew York City’s second accessibility camp was hosted at NYU MAGNET2 Metrotech Center (Brooklyn, NY 11201) on Saturday September 17, 2016. Focusing on users with different disabilities, sessions covered digital accessibility topics from the web (technical to tactical), desktop software, assistive technology, hacking, education, elections, and everything in between.",
    "favorite": "0",
    "length": "31:32",
    "likes": "0",
    "recorded": "2016-09-17",
    "speakers": [
        "patrick-smyth"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/W8_O3joo4aU/hqdefault.jpg",
    "title": "Blind Hackers",
    "videos": [
        {
            "code": "W8_O3joo4aU",
            "type": "youtube"
        }
    ],
    "views": "61"
}