{"description": "There were around 120000 ruby developers in the world 4 years ago. And the rate at which IT industry(particularly ruby and rails community) had grown in the past 4 years, it is safe to assume that this number would be much much higher, but lets proceed assuming 120000 ruby developers.As of 27-dec-2013 17:15 IST, there are 68,036 ruby gems available for download. So, the average number of ruby gem per developer comes out to be 0.57\n\nLets accept it, this is not a very impressive figure. So,what has stopped us from building gems and helping the ruby community grow? It could be one of the following reasons:-\n\n1.) Its like sending a space ship to Mars - complicated process\n\n2.) I can't do that, it's only for experts - calibre\n\n3.) Who has the time? I work 24x7 - busy\n\n4.) There are people already doing it, why should I work hard for it and open source it. I am not that crazy - lazy\n\n5.) Is it really needed, it's so trivial? - useless\n\nDuring the course of the talk, I am going to explain how ridiculously easy it is to build and publish a gem, what is the proper way of debugging a gem and how does building open-source software helps in your career growth? After this talk, I hope we all will try to improve upon the figure of 0.57 !!", "event": {"name": "RubyConf India 2014", "nickname": "rubyconf-india-2014", "twitter": "rubyconfindia", "url": "https://github.com/rubyconfindia/rci2014"}, "favorite": "0", "file_date": "2016-12-03", "filename": "build-prosperin-an-around-25-minutes-rishi-jain", "length": "24:55", "likes": "0", "recorded": "2014-03-22", "short_description": "There were around 120000 ruby developers in the world 4 years ago. And the rate at which IT industry(particularly ruby and rails", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/E21nhgckYI0/hqdefault.jpg", "title": "Build & Prosper(in an around 25 minutes) !! - Rishi Jain", "tweet_video": "Build%20%26%20Prosper%28in%20an%20around%2025%20minutes%29%20%21%21%20-%20Rishi%20Jain%20https%3A//codeandtalk.com/v/rubyconf-india-2014/build-prosperin-an-around-25-minutes-rishi-jain%20presented%20%40rubyconfindia", "videos": [{"code": "E21nhgckYI0", "type": "youtube"}], "views": "56"}