{"description": "Natural Language Processing (NLP) is the art and science of making sense of user-generated data. It is a combination of state-of-the-art computer science techniques and linguistics. Being able to analyze plain text data allows us to gain a lot of insights. Popular NLP tasks are text summarization, keyword extraction or automatic extraction of the author's opinion from a text. In the age of social media, only NLP provides solutions to analyze what users are really care about. Companies such as Google or Facebook invest millions in NLP solutions to harvest information from all the data they have been gathering over the years.\n\nIn this talk, I will present you a real-world NLP problem. We will discuss this problem from both, the linguistic and the computer science perspective. Throughout the talk, we will develop a processing pipeline to efficiently solve this problem in an automated fashion. An NLP pipeline usually consists of multiple components, each solving one aspect of the problem and presenting its own challenges. Among other things, you will learn how to tackle the following essential NLP problems using JRuby and OpenNLP:\n\nSentence segmentation,\nTokenization,\nPart-of-speech tagging, and\nNamed entity recognition.", "event": {"name": "RubyConf India 2014", "nickname": "rubyconf-india-2014", "twitter": "rubyconfindia", "url": "https://github.com/rubyconfindia/rci2014"}, "favorite": "0", "file_date": "2016-12-03", "filename": "natural-language-processing-with-ruby-konstantin-tennhard", "length": "25:02", "likes": "7", "recorded": "2014-03-22", "short_description": "Natural Language Processing (NLP) is the art and science of making sense of user-generated data. It is a combination of state-of", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/oFmy_QBQ5DU/hqdefault.jpg", "title": "Natural Language Processing with Ruby - Konstantin Tennhard", "tweet_video": "Natural%20Language%20Processing%20with%20Ruby%20-%20Konstantin%20Tennhard%20https%3A//codeandtalk.com/v/rubyconf-india-2014/natural-language-processing-with-ruby-konstantin-tennhard%20presented%20%40rubyconfindia", "videos": [{"code": "oFmy_QBQ5DU", "type": "youtube"}], "views": "572"}