{"description": "Code and debug your arduino (compatible) robot with open source.\n<p>\nIf <a href=\"http://arduino.cc/\">Arduino</a> is great for anything: it is the huge user base.\nThis huge user base does not only means a huge amount of open source libraries and open source code but also a huge amount of testers\nIt also means a huge community of creators who provide open(?) hardware and open software.\nArduino focuses on beginners and artists. It supports those with a very low entrance level Arduino IDE.\n<p>\nHowever lots of those Arduino users grow and because the Arduino IDE stays focused on starters they grow toward other hardware/software.\n\nThere is plenty of open(?) hardware to grow to. The proof of this is the boards manager offered by Arduino IDE.\n<p>\nOn the open software side; there are plenty of libraries and even real-time os's but there is very little available as an open alternative for the IDE.\n<p>\nWith the Arduino Eclipse Plugin we try to offer an alternative IDE that runs on windows mac an linux and does not stop the developer from growing on the software level. As we support the Arduino IDE boards manager we support growing at the hardware level to.\n<p>\nIn this presentation we will focus on\n<ul>\n  <li>Some history of the plugin. What is version V1 versus V2 and how does the plugin relate to avr-plugin</li>\n  <li>Demo some basic functionality like creating a project, compiling uploading, Serial monitor and the scope.</li>\n  <li>What is hot: Debugging on your local system, Debugging on the zero and using google test.</li>\n  <li>What do we experience as pain points?</li>\n  <li>What we are working on to make the plugin better?</li>\n  <li>What challenges do we experience due to being open source</li>\n</ul>\n\n", "event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "favorite": "0", "file_date": "2016-12-03", "filename": "t-dose-2015-arduino-eclipse-plugin-code-and-debug-your-arduino-jan-baeyens", "length": "49:24", "likes": "5", "recorded": "2015-11-28", "short_description": "Code and debug your arduino (compatible) robot with open source. If Arduino is great for anything: it is the huge user base. Thi", "speaker_twitters": " @Arduino_jantje", "speakers": {"jan-baeyens": {"episodes": [], "hosting": [], "info": {"country": "Belgium", "home": "http://eclipse.baeyens.it/", "name": "Jan Baeyens", "twitter": "Arduino_jantje"}, "videos": [{"event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "filename": "t-dose-2015-arduino-eclipse-plugin-code-and-debug-your-arduino-jan-baeyens", "recorded": "2015-11-28", "thumbnail_url": "https://i.ytimg.com/vi/wls692-j5_Q/hqdefault.jpg", "title": "Arduino Eclipse plugin Code and debug your arduino"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/wls692-j5_Q/hqdefault.jpg", "title": "Arduino Eclipse plugin Code and debug your arduino", "tweet_video": "Arduino%20Eclipse%20plugin%20Code%20and%20debug%20your%20arduino%20https%3A//codeandtalk.com/v/t-dose-2015/t-dose-2015-arduino-eclipse-plugin-code-and-debug-your-arduino-jan-baeyens%20presented%20%40TDOSE%20by%20%40Arduino_jantje", "videos": [{"code": "wls692-j5_Q", "type": "youtube"}], "views": "542"}