{"description": "A brief overview of Kodi (XBMC) open source Media center. How one of the oldest and largest open source projects originated, the path walked to present day and what the future might hold. Talk will include a brief history overview, what steps were taking to come in current state and what our goals are for the future.\n<p>\nIt's relatively rare and difficult to keep a large scale open source project going year after year without the firm financial backing of a larger organization. Since its inception in 2002, the software currently called Kodi has gone through numerous changes, both at the software level and at the organizational level, and has encountered numerous difficulties along the way, from simple communications problems both internally and with the userbase to larger organizational snafus. In this talk, we'll review how the organization has managed to overcome these problems and continue on.\n<p>\nTopics expected to be covered will include a look at the platforms, distributions, and hardware supported today; a review of the history on the Xbox, the switch to platform agnosticism, and the creation of the Foundation; and plans for the future.\n<p>\nAdditionally, an overview of how the organization works and software is developed currently will be presented, along with a look at who uses Kodi, both from a user perspective and a business perspective.\n\n", "event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "favorite": "0", "file_date": "2016-12-03", "filename": "t-dose-2015-kodi-mediacenter-xbmc-past-present-and-future-martijn-kaijser", "length": "35:12", "likes": "0", "recorded": "2015-11-28", "short_description": "A brief overview of Kodi (XBMC) open source Media center. How one of the oldest and largest open source projects originated, the", "speaker_twitters": " @MartijnKaijser", "speakers": {"martijn-kaijser": {"episodes": [], "hosting": [], "info": {"country": "The  Netherlands", "github": "MartijnKaijser", "home": "https://kodi.tv/", "name": "Martijn Kaijser", "twitter": "MartijnKaijser"}, "videos": [{"event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "filename": "t-dose-2015-kodi-mediacenter-xbmc-past-present-and-future-martijn-kaijser", "recorded": "2015-11-28", "thumbnail_url": "https://i.ytimg.com/vi/KxmMR-tYKBw/hqdefault.jpg", "title": "Kodi mediacenter XBMC past, present and future"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/KxmMR-tYKBw/hqdefault.jpg", "title": "Kodi mediacenter XBMC past, present and future", "tweet_video": "Kodi%20mediacenter%20XBMC%20past%2C%20present%20and%20future%20https%3A//codeandtalk.com/v/t-dose-2015/t-dose-2015-kodi-mediacenter-xbmc-past-present-and-future-martijn-kaijser%20presented%20%40TDOSE%20by%20%40MartijnKaijser", "videos": [{"code": "KxmMR-tYKBw", "type": "youtube"}], "views": "96"}