{"description": "Since our last T-DOSE we've got to observe the public confirmation of the success of the Open Source model.\nIt has been called a winner on many occasions and it can be called again, Open Source is a winning innovation model.\nBut now that we know we have our hands on a winning model, which we have done for years, what do we do next?\n<p>\nIn our vast Open Source community contributions originate from people in different roles, having similarly different motives.\nChoosing Open Source for cost reduction is a limited view, the model can bring digital freedom and can ease adoption to grow an ecosystem.\nGreat minds have already analysed these benefits (Benjamin Mako Hill, Simon Wardley), and knowing these benefits for various roles, we can develop our own strategy as a community.\n<p>\nWhile a lot of great Open Source software is being developed, digital freedom is still threatened.\nAlthough the main server and desktop stack is freely available, the hardware and hosted services seem to become less free.\nAt the same time company-backed Open Source development is crafting out strong ecosystems while outpacing efforts to provide free services on their published work.\nIn this light it seems fair to acknowledge that freedom and community strength have to be defended to guarantee the continued existence of our community, our own ecosystem.\n<p>\nSo how can we craft our own ecosystem to protect our community, while incorporating the different roles and motives for collaborating? Our ecosystem would have to be based on a set of common values, for which I propose the following: supporting software freedom, building on each others work, ensuring interoperability, low barriers for adoption and contribution, a diversity and continuity of resources, and a community representation in the project lead.\nBut goals and means are no good without commitment, and that's why we have to remain conscious, conscious of the environment and the impact of our own impact as inhabitants of the Open Source community.\nQuestion the project lead, question the business model, question the licence, but start by questioning your own actions.\nWe have the resources, the adoption, and above all the innovation model to build the most epic ecosystem around, but despite the abundance of effort we need your effort to end up where you want us to end up.\n\n", "event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "favorite": "0", "file_date": "2016-12-03", "filename": "t-dose-2015-open-source-has-won-now-what-nico-rikken", "length": "53:36", "likes": "2", "recorded": "2015-11-28", "short_description": "Since our last T-DOSE we've got to observe the public confirmation of the success of the Open Source model. It has been called a", "speaker_twitters": " @NicoRikken", "speakers": {"nico-rikken": {"episodes": [], "hosting": [], "info": {"country": "Arnhem, The Netherlands", "github": "nicorikken", "home": "http://nicorikken.eu/", "name": "Nico Rikken", "twitter": "NicoRikken"}, "videos": [{"event": {"name": "T-DOSE 2015", "nickname": "t-dose-2015", "twitter": "TDOSE", "url": "http://www.t-dose.org/2015/schedule"}, "filename": "t-dose-2015-open-source-has-won-now-what-nico-rikken", "recorded": "2015-11-28", "thumbnail_url": "https://i.ytimg.com/vi/IB_crzIAHUM/hqdefault.jpg", "title": "Open Source has won, now what?"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/IB_crzIAHUM/hqdefault.jpg", "title": "Open Source has won, now what?", "tweet_video": "Open%20Source%20has%20won%2C%20now%20what%3F%20https%3A//codeandtalk.com/v/t-dose-2015/t-dose-2015-open-source-has-won-now-what-nico-rikken%20presented%20%40TDOSE%20by%20%40NicoRikken", "videos": [{"code": "IB_crzIAHUM", "type": "youtube"}], "views": "99"}