{
    "description": "At Drupalcon Barcelona Lukas Smith an I, Tonio Zemp, presented the way of the company Liip AG (150 people all in Switzerland) into the self managed and \"Teal\" world (Self-Managing Organizations: Teal is the new Orange).\n\nWe described back then that we figured out beeing a nearly management-less company and are eager to reach a Teal evolution. At the end of the talk we discussed the pro`s and con`s of evolving our own organizational model or take something \"of the shelf\", namely Holacracy.\n\nWe received a lot of great feedback and quite some buzz around that talk.\n\nNow, nearly a year later a lot of things happened. Did go with Holacracy, we officially removed the management positions, we had great successes and great frustrations. We want to be open and share a honest picture of our experience the past year.\n\nWe think that these insights will proof very helpful for agencies facing the \"Going for Growth\" topic.\n\nTo reach a broder audience the talk will recap what happened before Drupalcon Barcelona, and give a short introduction into the topic of self managing organizations before the deepdive into our experience of the past year.\n\nSo a \"beginner\" will get at least a first eye-opening experience and some entertainment, an \"intermediate\" (already read about the topic, maybe attended the talk a year ago) gets encouraged to go this way while an \"expert\" (working on the same topic) gets valuable insight in real world problems and solutions.",
    "favorite": "0",
    "length": "01:03:46",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/_gWnDQbmUY8/hqdefault.jpg",
    "title": "DrupalCon Dublin 2016: Self managing organizations, Teal and Holacracy in practice - one year later",
    "videos": [
        {
            "code": "_gWnDQbmUY8",
            "type": "youtube"
        }
    ],
    "views": "156"
}