{
    "abstract": "https://events.drupal.org/dublin2016/sessions/3p%E2%80%99s-building-new-wave-open-software-companies",
    "description": "While open source describes a software development methodology, at the DC Dublin we want to talk more about a new go-to-market and company-building philosophy based on the 3P model of Accel.\n\nThis presentation is based on our experience in the last 2 years developing the Open Social Distribution for Drupal 8 by our company GoalGorilla. It is inspired by the recent articles published by Jake Flomenberg, Partner @Accel, David Hillis @Ingeniux, Dries @Acquia and others on the rise of a completely new generation of open source companies.\n\nThis session contains valuable lessons for any startup or Drupal agency thinking about building (SaaS) products:\n\nWhy open software companies did not work well in the past, and what has changed now.\nHow customers are driving the changes taking place now in open software development.\nHow to pivot your Drupal service company to a products company using the the 3P’s to build a sustainable open software company.\nHow we applied the 3Ps for the our company in Open Social distribution project.\nWhy the opportunity for open software companies is now bigger than anything before.\nLessons learned from 2 years Open Social project that lead to the alpha release on Drupal.org in june 2016 and our way forward.\n\nHistory: Low Margins and Less Innovation in Open Source\n\nThe first generation of open software companies map failed to reach venture scale because they offered customers a wider buffer of options, at lower prices. Ironically, greater control in the hands of the customer decreased market opportunity. Because these businesses were 100% open source the first generation of companies were only able to charge for support and services.\n\nNot only did this business model have inherently lower financial margins, since profits relied on customers needing support, companies had no motivation to innovate and improve upon their product.",
    "favorite": "0",
    "length": "01:00:25",
    "likes": "5",
    "recorded": "2016-09-26",
    "speakers": ["taco-potze"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/q06RA9Vsqnc/hqdefault.jpg",
    "title": "The 3 phases of successful open software companies",
    "videos": [
        {
            "code": "q06RA9Vsqnc",
            "type": "youtube"
        }
    ],
    "views": "199"
}