{
    "abstract": "https://events.drupal.org/dublin2016/sessions/21-things-i-learned-twig-drupal",
    "description": "A hands on Drupal8 Theming Twig extravaganza \n\nTheming in Drupal8 was a massive shift from phptemplate to twig, but its more than changing the syntax. We changed the way of thinking about Drupal theming. Drupal twig theming is easy to learn, powerful, flexible and overall as awesome as warm coffee on a rainy day. The downside is that all the things you learned in Drupal now have to be relearned - Yes it's by design.\n\nOver the last 4 years we (the frontend drupaltwig group) we got one burning question from the Drupal community.\n\n“How I do this right the first time ? ”  \n\nThe session will be a hands on, based on all the things I learned from designing the system with the drupaltwig team (aka the \"twigtwams\") and when building Drupal8 themes. We want to make sure you get Drupal8 theming right the first time. The examples will be mixed with background info & all the secret dirty stories from the last 10+ years of Drupal theming & where we go in the future.\n\nThe secret plan behind it all, understand the concept & why we changed everything in Drupal8\nTemplate building: understanding the template suggestions & how to organise 120+ template files.\nBase theme(s) - do you need em?\n\"Modern\" CSS structures & templates, how it all fits together.\nDeveloper Tools & how to make your life easier\nCSS selectors & markup that goes to 11\nand all the tips, tricks & dirty secrets that can fit into a 45 minutes\nAudience level:\nThe session is for web designers, frontenders & developers that wanna know how we designed the frontend in D8. A little bit if knowdledge of twig is preferred.\n\nTakeaway:\nYou should be prober equipped to get down & dirty with Drupal theming in Drupal8. \n\nSession video\n\nThe session is based on the talk i gave at frontend united 2016:\nhttps://youtu.be/UmLkVV_R69Q?list=PL7xqy2B8uXNK5L7ROxqY_CxKCVPE2IAJx and the keynote at Drupalcamp Athens 2016",
    "favorite": "0",
    "length": "01:01:11",
    "likes": "17",
    "recorded": "2016-09-26",
    "speakers": ["morten-birch-heide-jorgensen"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/-GyeZ2QeVl0/hqdefault.jpg",
    "title": "21 things i learned with Twig & Drupal",
    "videos": [
        {
            "code": "-GyeZ2QeVl0",
            "type": "youtube"
        }
    ],
    "views": "1203"
}