{
    "description": "At Axelerant, we have discovered that there is value to be generated by maintaining focused relationships with existing clients and partners, when delivering Drupal projects and services.\n\nThis session will take you through our Account Management Practice and share some real-life case studies demonstrating how we hit target sales quota by 2-3x and achieved maximum strategic account objectives within the desired timeline.\n\nWe will look at various aspects of a successful Customer Account Management framework like \n\nCustomer onboarding process\nKickoff meetings\nRoutine engagement health check-ins\nInvoicing and collections management\nSatisfaction surveys and testimonials management\nComplaint and grievances management\nContract renewals and extensions.\nOpportunity exploration via researching client’s organisation, industry, seeking references, social media listening etc.\nEvangelizing client via social, digital marketing and event participations.\nWe will also answer some fundamental questions like \n\nWhat is Account Management?\nWhat skills and talents are required to excel in Account Management specific to the Drupal ecosystem?\nWhat activities must be performed to maximize Account Management return on investment?\nWhat are some of the Accountabilities and Performance Metrics used for measurements?\nAbout the Speaker\n\nI have been coding since 1998 and managing people since 2000. Primary work focus has been the business practice around Drupal Stack, including but not limited to practice development, delivery excellence, solution consulting, sales and business development, and nurturing and growing existing accounts of Axelerant’s partners & clients.\n\nI love contributing to the Drupal ecosystem ( non code most of the time ) by evangelizing, organizing, speaking and supporting various events like Drupalcons, Camps, Meetups etc. Having started my first such involvement by participating in Drupal.org Redesign Initiative of 2010 via testing activities.\n\nI live in Jaipur, India with my family. I’ve been known to escape from work by watching movies ( preferably WWII genre ), networking & participating in local entrepreneurial groups & startup forums as well as catching up with friends.",
    "favorite": "0",
    "length": "43:43",
    "likes": "0",
    "recorded": "2016-09-26",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/o6uU5XCDUd0/hqdefault.jpg",
    "title": "DrupalCon Dublin 2016: Growing your Drupal Business via Strategic Account Management Framework",
    "videos": [
        {
            "code": "o6uU5XCDUd0",
            "type": "youtube"
        }
    ],
    "views": "82"
}