{
    "description": "“Come for the code, stay for the Community” - we hear this quite often and when at a DrupalCon Dries says “Standup please, if Drupal has changed  your lives” - and no seats remain taken. It is then we realize, that there is definitely something magical and very powerful in Drupal which makes us all stay and help us grow - irrespective of the role we play professionally.\n\nLikewise, irrespective of the role we play, professionally, there are ways for each one of us to contribute. Undoubtedly, code speaks for the technical contributors but, working as a Project Manager - code isn’t my obvious way of contribution. Infact, not being able to contribute via code - motivated me to explore other ways to contribute.\n\nFortunately, I found a myriad of ways and hence I can say - ANYBODY who appreciates Drupal, can CONTRIBUTE.\n\nOVERVIEW OF THE SESSION : \n\nSome of the key points this session aims to cover, are as follows -\nExamples of my own contributions (how I discovered ways to contribute - lots of ways), examples from all those amazing leaders I have met at various Camps and Cons - who project, how contribution can start from the minutest form and add to the growth of the Community.\nProfessional Role based use-cases - Every individual has a different reason for attending a DrupalCon, and mostly it’s based on the professional role they play in their organisation or else their will to contribute. The session would focus on majority of DrupalCon audience profiles and point out ways in which EVERY single role can contribute.\nSome ideas to give back by advocating and simply spreading the word.\nTips to even contribute to code, without actually coding. Imagine the feeling when you can say “Hey, I contributed to x module - but i never wrote a single line of code.” We can also have a demo in the session itself.\nHow easy and important it is, to start small ?\nWHO SHOULD ATTEND :\n\nAnybody can contribute, anybody can attend.  If you feel Drupal is powerful and if you have ever thought “Ah, I don’t come from a technical background, there’s nothing i can do to contribute “(but you secretly wish you could), you are more than welcome to attend :)\n\nKEY LEARNINGS INTENDED OUT OF THE TALK :\n\nHow to contribute to Drupal minus code ?\nHow to contribute to Drupal plus code, without coding ?\nWhich areas can be explored to contribute ?\nAnd most importantly, How to start ?",
    "favorite": "0",
    "length": "40:18",
    "likes": "3",
    "recorded": "2016-09-26",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/eZ9TiiGNJK4/hqdefault.jpg",
    "title": "DrupalCon Dublin 2016: How to contribute to Drupal minus code?",
    "videos": [
        {
            "code": "eZ9TiiGNJK4",
            "type": "youtube"
        }
    ],
    "views": "103"
}