{
    "abstract": "https://events.drupal.org/dublin2016/sessions/plans-are-useless-planning-indispensable",
    "description": "\"Plans are useless, but planning is indispensable.\" - Dwight D. Eisenhower\n\nIn this statement famously attributed to Eisenhower, the implication is that even a well made plan with the best intentions often ends up not being worth the paper it was written on, once the troops hit the beach and the situation moves from speculation to reality. When a plan contradicts the real world, the real world always wins. Knowing that even the best plan will almost certainly fail to account for at least some of the challenges reality poses, why do we plan?\n\nThe value of a plan lies in the act and effort of planning: in doing so, you gain understanding about your client, the project’s goals and objectives, and the abilities of your team. Planning encourages situational awareness through learning and discussing strengths, weaknesses, opportunities, threats and a flexible strategy that can tie them all together. A good plan establishes a vision, with goals and supporting objectives, and provides context and directionality so the team can move forward and be supported without being locked in.\n\nProject success is rarely attributable to an accurate plan; it is more often a result of agility,  when the the team is aware of the overall project purpose and vision, and is empowered to make the best decisions based on the current circumstances. This agility requires the team to be constantly planning, evaluating, and re-planning.\n\nIn this session, I’ll unpack the quote above in the context of web development by looking at:\n\n- How do we establish project purpose?\n- How is that purpose communicated in the form of a plan?\n- How do we gain alignment on project purpose from stakeholders?\n- How can we be constantly planning?\n- How do we gain and communicate awareness?\n- How does the team make decisions based on that awareness?\n- How do we gather and measure data to know how we’re doing?\n\nSean is a Certified ScrumMaster and the COO of Last Call Media.",
    "favorite": "0",
    "length": "49:09",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [
        "sean-eddings"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/rxet4bPb1NM/hqdefault.jpg",
    "title": "Plans are useless, but planning is indispensable.",
    "videos": [
        {
            "code": "rxet4bPb1NM",
            "type": "youtube"
        }
    ],
    "views": "176"
}