{
    "abstract": "https://events.drupal.org/dublin2016/sessions/how-our-competitors-are-kicking-drupals-ass-and-what-we-can-do-about-it",
    "description": "More and more people are choosing a CMS based on what their editors want, not just what the IT staff feels is technically sound. The experiences of authors and editors already eclipses the technical foundations of a system for small-to-medium sites, and it may soon for medium-to-large sites too. People are craving an experience that passes the \"so easy your CEO can use it\" test when it comes to creating and publishing content. We're seeing rich content experience talked about in conversations with our clients, in the features of other CMS systems, and the messages of companies with proprietary alternatives.\n\nDrupal is traditionally a strong technical product that tries to balance the basic needs of authors and editors. We need to do more. This includes innovating in Drupal core to have a better set of tools for content editors built-in, and enable the tools to be extended more broadly through contributed modules.\n\nThis talk will present competitive analysis from other CMSes / frameworks and where they’re currently beating Drupal and how we can beat ‘em back. :)\n\nSpecifically, focusing on the following:\n\nAuthoring and editing for multiple (mobile) devices\nMedia management and content repositories\nContent staging and publish / subscribe models\nPage layouts\nAuthoring tools\nThe talk will finish with a run-down of the progress of various Drupal 8 initiatives in this space and how to get involved.",
    "favorite": "0",
    "length": "01:11:16",
    "likes": "31",
    "recorded": "2016-09-26",
    "speakers": ["angie-byron"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/C-sXsu1r4_E/hqdefault.jpg",
    "title": "How our competitors are kicking Drupal's ass (and what we can do about it)",
    "videos": [
        {
            "code": "C-sXsu1r4_E",
            "type": "youtube"
        }
    ],
    "views": "2970"
}