{
    "abstract": "https://events.drupal.org/dublin2016/sessions/managing-agile-team-internal-and-external-partners",
    "description": "Managing an agile team is one thing when you're all part of the same organisation, so how do you manage a hyper-creative, cross-functional team made up of partners from many various agencies?\n\nOur make-up is quite unique: we are an in-house product team and two procured agencies. \n\nWe have a brand team that owns the vision for the product, manages on-the-ground delivery, and supports and trains users on the front line; a Drupal consulting agency procured part-time to lead on technology and agile transformation; and a separate agency of developers (in-house and outsourced) with dedicated Scrum Master. \n\nWe're a team of around 8 core people working to design, build and test product iterations for the Investors in People online suite (https://www.investorsinpeople.com/). \n\nThis presentation will take you through the steps we have faced in applying agile principles in our context, including a look at the successes, the failures, the pitfalls and the many opportunities. Some of the topics we will cover are:\n\nAlignment: collaborating on one shared goal.\nCommunication: communicating the product vision to external developers (PO); bringing multiple parties together in line with one sprint goal (SM); communicating product developments and value back to the business (PO).\nProduct delivery: managing an in-life product, iterative releases and a large user base.\nOrganisational shift: championing the value of agile to the wider Investors in People business and promoting culture shift.",
    "favorite": "0",
    "length": "51:04",
    "likes": "0",
    "recorded": "2016-09-26",
    "speakers": ["tassos-koutlas"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/LZWWGKqzG6w/hqdefault.jpg",
    "title": "Managing an agile team of internal and external partners",
    "videos": [
        {
            "code": "LZWWGKqzG6w",
            "type": "youtube"
        }
    ],
    "views": "110"
}