{
    "abstract": "https://events.drupal.org/dublin2016/sessions/react-front-end-your-drupal-8-back-end",
    "description": "Drupal 8 comes bundled with support for exposing entities likes nodes, users, and comments in a RESTful manner, which have gradually become the primary source of data for a plethora of consumers, be it mobile applications, IoT devices, or even web applications running client-side frameworks.\n\nReact is an ultra-performant view library which makes it great for building interactive applications with real time data. React components makes it extremely simple to create isolated components that can be plugged together to build large scale applications. It’s component model is a great fit to model data on a webpage which is typical of a content management system. The one-way data flow helps in modelling the page directly to data received from Drupal's RESTful API and is easy to comprehend compared to conventional MVC frameworks.\n\nIn this hands-on session, you will learn how to build a decoupled website using React ecosystem on the front-end and Drupal 8 as the content management system and a data source.\n\nKey Takeaways:\n\nHow to configure Drupal to expose RESTful resources using Drupal 8\n\nEnable CORS support for the domains/port running our React application\n\nAuthenticate requests using JWT\n\nConsume data on front-end using Redux store\n\nPass data from Redux store React components\n\n\n\nBy the end of this session, you will be able to:\n\nBuild a RESTful API using Drupal 8\n\nUse any backend with React front-end\n\n\nThis session is for Drupalers who know advanced JavaScript (functional programming skills are not required) and who are familiar with the React landscape.",
    "favorite": "0",
    "length": "42:28",
    "likes": "2",
    "recorded": "2016-09-26",
    "speakers": ["bassam-ismail", "aliya-khan"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/aoQzbhgxmcg/hqdefault.jpg",
    "title": "React Front-end For Your Drupal 8 Back-end",
    "videos": [
        {
            "code": "aoQzbhgxmcg",
            "type": "youtube"
        }
    ],
    "views": "769"
}