{
    "abstract": "https://events.drupal.org/dublin2016/sessions/midcamp-madness-and-planning-human-centered-events",
    "description": "In 2013, over Mexican food and drinks, the idea of a new Drupal camp for the midwestern US began to form. We wanted to offer a fresh and welcoming approach, more inclusive of Chicago’s diverse Drupal community. Three years and as many camps later, at over 300 attendees, MidCamp is now the one of the largest (and most successful) Drupal camps in North America.\n\nThe MidCamp organizing team is a rag-tag bunch of volunteers who work almost year-round to make MidCamp happen. And now, we’re going to share our process and experiences with you.\n\nBefore the “Basecamp, Trello, or Jira?” conversation, we start recruiting the core team. The team is critical, and getting the team on the same page from the start is even more so.\n\nFrom there, we focus our efforts on making the camp awesome and unique. We pull in ideas from other successful camps around the world; we brainstorm how to create value for attendees; and we plan inclusivity and accessibility into everything.\n\nHere are some examples of the human-centered items that we've incorporated over the years:\n\nWalking lanes\nFoolproof session recordings\nKeynote transcriptions\nA code of conduct\n“Blind” session selection\nNon-alcoholic social events\nVenue walkthroughs to help attendees plan their accessibility routes\nIn this session, we’ll discuss how these ideas took shape, how we made decisions, and how we executed. We’ll share our pain points, and how hard we work each year to reduce that pain - not only for us, but for everyone involved in camp. And most importantly, you’ll hear how we create the madness that is MidCamp, and hopefully be inspired to join the madness yourself.",
    "favorite": "0",
    "length": "49:23",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [
        "avi-schwab"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/QaBkXhZN740/hqdefault.jpg",
    "title": "MidCamp madness and planning human-centered events",
    "videos": [
        {
            "code": "QaBkXhZN740",
            "type": "youtube"
        }
    ],
    "views": "51"
}