{
    "description": "1000 No’s for each Yes\n\nBuilding a great product requires a thousand No’s for every Yes. Yet, how often have we actually put our foot down and fought against the will of our clients or superiors? Building a product is not simply a technical challenge, it’s a social and political one. This talk will explore some techniques and practical strategies to increase the all important “No count”.\n\nPeter Brownell is director of Code Positive and one of the founders of the UK Drupal community. He has been a developer for 20 years, and has experience across systems admin, devops, design, business and training. This talk will cover some of the “No engineering” tools he has learned about on his travels: \n\nRoadmaps\n\nStyle guides\n\nPattern based development\n\nMetrics\n\nGovernance\n\nMagic tricks\n\n\n\nProduct management, not just project management\n\nSaying “No” is one of the essential skills in Product Management. Rather than simply taking Projects from start to finish, Product Management gets involved in the bigger picture. To build a good product, we have to be involved in the process much earlier and stick with it for much longer periods of time. \n\nMake your clients better\n\nMany of those charged with commissioning websites don’t have the experience or skill to make informed decisions. The act of saying “No”, when done right, is about providing our clients with the tools that they need to make better decisions without being distracted by those shiny, swishy things that are just going to be irritating in a few weeks time.",
    "favorite": "0",
    "length": "52:20",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/d_oymYI3In4/hqdefault.jpg",
    "title": "DrupalCon Dublin 2016: How to say \"No\" (Without actually saying \"No\")",
    "videos": [
        {
            "code": "d_oymYI3In4",
            "type": "youtube"
        }
    ],
    "views": "152"
}