{
    "abstract": "https://events.drupal.org/dublin2016/sessions/how-al-jazeera-built-future-focused-digital-platform-drupal-8",
    "description": "Breaking News: Al Jazeera Builds Future-focused Digital Platform with Drupal 8\n\nThis just in: Al Jazeera Media Network, a leading provider in news and media broadcasting, is investing in its future by building a global, multi-lingual, unified CMS platform to streamline the creation and personalized delivery of news on the newly released Drupal 8 platform. This story is still unfolding!\n\nFor a global media network like Al Jazeera, Drupal 8 provides the perfect base for internationalization, future growth, and flexibility. Al Jazeera required a platform that could unify several different content streams and support a complicated editorial workflow, allowing network wide collaboration and search.\n\nIn this talk, leaders from the Al Jazeera digital project will go “behind-the-scenes” of the network’s next generation publishing platform. Hear from the Al Jazeera Product Managers and Platform Experts about how the content needs driving the media business can map to the underpinnings of a unified publishing platform. We will explore the technical advantages of Drupal 8, as well as the digital strategy that informed the endeavor. You’ll learn:\n\n●  Why Al Jazeera Media Network decided to invest in Drupal 8 as an early adopter\n\n●  How to use Deploy, Multi-version, and Replication modules to support an enterprise content repository\n\n●  The implications of starting with Lightning as a base distribution\n\n●  How Al Jazeera Media Network transformed its editorial workflow with Drupal 8 tools\n\nFor anyone working in the digital publishing industry or considering using Drupal 8 for a platform, this session is a must-see!",
    "favorite": "0",
    "length": "01:02:03",
    "likes": "3",
    "recorded": "2016-09-26",
    "speakers": [
        "mai-irie",
        "tian-chen"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/NCx0fx-FWSc/hqdefault.jpg",
    "title": "How Al Jazeera built a future-focused Digital Platform with Drupal 8",
    "videos": [
        {
            "code": "NCx0fx-FWSc",
            "type": "youtube"
        }
    ],
    "views": "262"
}