{
    "abstract": "https://events.drupal.org/dublin2016/sessions/4x-high-performance-drupal-step-step-ultimate-beginners-guide",
    "description": "This is the ultimate beginners guide to High Performance for Drupal.\n\nYOUR MISSION\n\nYour newly launched Drupal site is slow, what can you do?\n\nThis you'll learn here in a practical, easy to understand and useful way for both Drupal 7 and 8.\n\nDrupal Performance can be divided broadly into 4 Categories:\n\nServer\nClient\nModules\nDatabase\nThis session will show how to setup technologies for getting the expected base line performance for each of those and giving a good overview of what can be tweaked.\n\nServer: OpCache / APC, APCu, Memcache / Redis, Varnish\nClient: GZIP, Fast JS, Minimal CSS, Caching Headers, AJAX/PJAX, BigPipe\nModules / PHP / Drupal Code: Common problems, XHProf (fast installation), Custom Caching, Block Cache Alter, Render Cache, Performance Core Patches, SuperCache, Chained Fast\nDatabase: Common Tweaks, InnoDB, Slow Query Detection, Slow Query Fixing\nThe session will show step-by-step approaches how to gradually make the site faster.\n\nIt is aimed at beginners and will give a broad overview to know where to look for performance problems and what to do.\n\nThis is targeted as a Drupal 7 and Drupal 8 session at the same time. Both audiences will get plenty of alternatives for things.\n\nI am happy to share this session with a co-presenter if someone wants to target beginners, I felt a beginner session was still missing for this year.\n\nIt will be great fun!\n\nYOU WILL LEARN\n\nHow to do and how to not do performance optimization\nHow to find the big pain points and low hanging fruits\nHow to fix them\nAll the tools and tricks of the trade\nWHAT IS NEW?\n\nDrupal 8 is the main focus and things have changed a lot for baseline performance\nThe \"What is caching?\" explanation has been simpified\nPHP 5.5 / PHP 7 are newly discussed\nSuperCache, Fast Chained and L1Cache are newly discussed approaches for local caches\nRedis has been added as cache backend\nDefault Varnish Configuration has changed\nCDN recommendations have changed\nBigPipe and streaming technologies have been added to the overview\nNew frontend aggregation modules: advagg, agrcache, simple_aggregation\nNew frontend tricks to lazy load Javascript have been added for Drupal 8\nNew performance measurement modules: webprofiler, block_timer, heisencache, xhprof_kit\nAuthcache has been added as Drupal 8 dynamic_page_cache replacement\nABOUT THE PRESENTER\n\nFabianx is a Drupal 7 core maintainer and a Drupal 8 core contributor and works at Tag1 Consuting as a Senior Performance Engineer. He is always trying to make High Performance as accessible as possible to everyone and believes that the whole internet should be fast.",
    "favorite": "0",
    "length": "56:43",
    "likes": "7",
    "recorded": "2016-09-26",
    "speakers": [
        "fabian-franz"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/6z0bZTuLZhw/hqdefault.jpg",
    "title": "4x High Performance for Drupal - Step by Step - The ultimate beginner's guide",
    "videos": [
        {
            "code": "6z0bZTuLZhw",
            "type": "youtube"
        }
    ],
    "views": "436"
}