{
    "abstract": "https://events.drupal.org/dublin2016/sessions/stream-your-way-success-bigpipe-refreshless-esiajax-bigpipe-and-more",
    "description": "This sessions shows the posibilities and pitfalls of a streaming based architecture like used by BigPipe and RefreshLess and how if streaming is built into the system from day 1, there are lots of possibilities for gradual performance optimization.\n\nINTRO\n\nI (Fabianx) still remember the day when I loaded the mozilla bug tracker in 1999 and it immediately had a 'Loading ...' message and later the real content appeared. That was so Wow!\n\nI also remember the \"shock\" I experieneced when I loaded Facebook with their BigPipe disabled and it took 3.4 seconds (!). But but .. it was always so fast.\n\nAnd the reason is both of those had used 'felt user experience' and not raw numbers to create their systems. I immediate could see and interact with those systems.\n\nSo while streaming is almost as old as the internet (it came in HTTP/1.1), CMS traditionally did not make much use of it, but rather used several AJAX requests for composing pages. This has the disadvantage that for each ajax request a new connection needs to be created and especially for Drupal the bootstrap is a big bottleneck.\n\nAnd now with HTTP/2 the whole direction of HTTP changes to use streamed responses for everything and therefore technologies like BigPipe will be even more useful as they can start pushing assets as soon as we know that we need them.\n\nWHAT YOU WILL LEARN\n\n- Making your stack ready for streaming\n\n- How to avoid the pitfalls of streaming based architectures (e.g. no JavaScript support, assets, aggregation)\n\n- How you can easily create your own streamed fragments in Drupal 8 with BigPipe included\n\n- How you can create your own streamed responses easily\n\n- How you could implement a manual BigPipe approach for Drupal 7\n\n- How streaming works in combination with Javascript\n\n- How streaming can be combined with \"worker farms\" (outlook)",
    "favorite": "0",
    "length": "51:51",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [
        "fabian-franz"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/boW7pOOHmw4/hqdefault.jpg",
    "title": "Stream your way to Success: BigPipe, Refreshless, ESI, AJAX and more",
    "videos": [
        {
            "code": "boW7pOOHmw4",
            "type": "youtube"
        }
    ],
    "views": "192"
}