{
    "abstract": "https://events.drupal.org/dublin2016/sessions/confessions-control-freak-guide-letting-go",
    "description": "Project managers are inherently driven by a sense of responsibility for project success. They feel accountable for all aspects of planning, organisation and direction on a project. The fear that something will go wrong if they are not involved in everything, all of the time, can become overwhelming. They need things to be under control.\n\nThe problem for project managers is that this outlook can lead to them becoming controlling. In order to avoid any chance of failure, they end up ruling, rather than leading a project. They constantly look for ways to eliminate risk and ensure that work progresses according to the schedule. Their goal is to get the job done with a minimum of fuss.  \n\nThis approach works well for the project manager for whom delivering on time and budget are the only factors that allow them a restful night’s sleep. It’s not so great for achieving team satisfaction, fostering technical innovation, improving the user experience, or ultimately delivering a solution that provides real value to the client. The number crunchers will be happy, but everyone else will just be relieved that it’s all over.\n\nWhilst easy to criticise, it’s sometimes hard for project managers to take a different approach. They are tasked with managing a complex interdependent system of people and technologies that behave unpredictably in a commercial environment that applies pressure to deliver quickly. It takes time for such a system to develop a strong dynamic, become self organised and distribute project leadership in a way that would allow them to act differently.\n\nIn the absence of these factors, a project manager is more inclined to exert control than to take a position of leadership where they influence and inspire others to contribute to the success of the project. It’s an unfortunate commercial reality that the time and budget pressures imposed upon many projects prevent teams from thriving and project managers from becoming leaders.\n\nFor many years, my own experience led me to be very much inclined towards project control. In the absence of adequate time, or a strong team dynamic, a controlling approach felt like the only way to achieve success. I eventually came to realise that projects weren’t particularly enjoyable experiences and no-one on the team finished them with any real sense of satisfaction or achievement.\n\nThe catalyst for change was undoubtedly my initial exposure to a more agile approach. Whilst far from a perfect project, it was immediately clear that more open and regular communication fostered a more healthy working relationship amongst team members. We more quickly gained a good team dynamic, and I felt far less inclined to make sure everything was under my control.\n\nHaving worked this way ever since, I have learned a great deal about relinquishing control and in the process how to achieve a much better outcome. I would like to share my experiences and use this session to outline a guide to achieving more balance, remaining calm under pressure, and focussing on the delivery of a higher value solution with a more engaged team.\n\nIn the session I will also discuss how to delegate responsibility, be more a more inclusive decision maker, and rationalise commercial pressures in order to filter out less reasonable requests. I will show when it’s still ok to exercise control in order to avoid chaos, and will discuss how to better manage your clients to build a stronger, more trusting relationship with them.\n\nAs the Client Service Director at PreviousNext I am in the fortunate position of working with a very capable and experienced team. We are all committed to a more collaborative approach on our projects and have built a very strong team dynamic. Our whole team contributes to the oversight of projects and are empowered to make key decisions about how we implement things. We’ve managed to develop a much more sustainable approach to project management that I will also share in this session.",
    "favorite": "0",
    "length": "53:27",
    "likes": "3",
    "recorded": "2016-09-26",
    "speakers": [
        "jason-coghlan"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/chf9cJf-wt8/hqdefault.jpg",
    "title": "Confessions of a control freak: A guide to letting go",
    "videos": [
        {
            "code": "chf9cJf-wt8",
            "type": "youtube"
        }
    ],
    "views": "100"
}