{
    "abstract": "https://events.drupal.org/dublin2016/sessions/bridging-phonegap-getting-started-creating-hybrid-mobile-apps-drupal-and-ionic",
    "description": "You are a Drupal developer. You are a frontend developer. You like PHP and CSS and HTML and JavaScript and since Drupal 8 is here, you like Twig (though we won't be talking Twig in this session!). You have an idea for an app, but you don't have the time to learn Swift and Objective C and Java and ...\n\nWith the advent of hybrid mobile apps, you can continue being a Drupal frontend developer and also build apps without needing to learn new technologies. The mobile web is quickly catching up with native apps. The mobile web is free, and open, and available to all of us right now and doesn't bind us to proprietary systems. With the many advances being made in this area, we can create great mobile experiences for users.\n\nIn this session, we will look at three things:\n\nUsing Drupal as a RESTful web service to store app data\nA brief introduction to Ionic Framework and AngularJS\nHow we can bridge Drupal and Ionic to create native look and feel hybrid web apps\nAttendees will be excited to hear about this because they will learn a little about a lot of topics:\n\nHybrid App development (basically apps that can run on any operating system - all you need to know is HTML, CSS, and JS - or at least a willingness to learn them)\nRESTful Drupal (don't want to build an app? We can use this knowledge to develop headless Drupal websites!)\nAngularJS directives, controllers, services, and more (e.g. display a live feed of the weather in Dublin via Forecast.io)\nBuilt-in features of Ionic Framework (JS and CSS components, custom directives, and how you can extend them)\nPackaging apps for iOS and Android (and running them through an emulator)\nBefore attending this session, all you need is a positive and inquisitive mind (perhaps a little JavaScript knowledge as well). You don't need to know about how to create RESTful services (I'll show you), you don't need to understand AngularJS (we'll have a live demo of how easy it is), and you don't have to have built an app before.\n\nQuestions that often pop up when I give this talk:\n\nCan it use push notifications? Yes\nCan it use geo-location? Yes, yes\nCan it use your phone's camera? As the last line in James Joyce's Ulysses says, 'yes, yes, yes'!\nWhen this session is complete, you will\n\nhave the confidence to build a news-reader style app\nbe able to add content to any page of it\nbe able to update your app's content via your present Drupal website\nsee how to integrate external services into your app\nchat with me over a nice pint of Guinness.\nThis session will be an expanded version of my talk at Frontend United in Ghent this year.",
    "favorite": "0",
    "length": "47:15",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": ["mark-conroy"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gubZKr1gFso/hqdefault.jpg",
    "title": "Bridging the PhoneGap: Getting Started Creating Hybrid Mobile Apps",
    "videos": [
        {
            "code": "gubZKr1gFso",
            "type": "youtube"
        }
    ],
    "views": "191"
}