{
    "abstract": "https://events.drupal.org/dublin2016/sessions/7-hurdles-take-reach-scrum-drupal-nirvana-projects",
    "description": "nirvana\nnɪəˈvɑːnə/\nnoun\n\n(in Buddhism) a transcendent state in which there is neither suffering, desire, nor sense of self, and the subject is released from the effects of karma and the cycle of death and rebirth. It represents the final goal of Buddhism.\n\n-------\n\nFor the last couple of years, i’ve been working as a Scrum Master and a Scrum Product Owner within Drupal Agencies.\nThe world is taken over by this “thing” called Agile and Scrum is one of the forms in which it surfaces.\n\nAs they say: Scrum is easy to understand but hard to master.\nSpecifically in Drupal Agencies there are some quirks and pitfalls when a team is trying to use scrum.\nI like to take you on a bumpy ride through the challenges I’ve encountered trying to master Scrum in digital agencies using Drupal, although these hurdles are not restricted to Drupal. In having conversations with a lot of my peers I found out that there are a lot of great ways to make Scrum work, and I would like to share my insights on how to take the hurdles to reach Scrum nirvana, or at least be Kaizen :)\nI think it will be recognisable for all you Agilistas out there.\n\nThe seven hurdles:\n\n1. Scrum and Customers \n“Sure we want this Agile thing! So where’s our functional design?!”\n\n2. Scrum and Drupal development \nExperts versus generalists, junior versus senior\n\n3. Scrum and Human Resources\n“We’re looking for a scrummaster, productowner and projectmanager in one who can lead the team!”\n\n4. Scrum and Support \n“Critical Security updates in the middle of a sprint.. again..”\n\n5. Scrum and Technical dept  \n“New features are more important to the client then cleaning up your code”\n\n6. Scrum and Projectbudgets \n“Every team works at only one project at a time right?”\n\n7. Scrum and Waterscrum aka ScrumBut\n“We use Scrum in our own way, and call it Waterscrum!”\n“We use Jira and post-its, so yes we are scrumming! A retro-what?” \n\nThis talk is interesting for anyone who has a basic knowledge of Scrum and Agile.",
    "favorite": "0",
    "length": "01:00:50",
    "likes": "1",
    "recorded": "2016-09-26",
    "speakers": [
        "nancy-beers"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/KNW9NiHLQ6U/hqdefault.jpg",
    "title": "7 hurdles to reach Scrum Drupal Nirvana in projects.",
    "videos": [
        {
            "code": "KNW9NiHLQ6U",
            "type": "youtube"
        }
    ],
    "views": "123"
}