{
    "abstract": "https://events.drupal.org/dublin2016/sessions/let-machines-do-work",
    "description": "When developing a Drupal site there is so many things that developers have to remember. Developers like all humans are error prone. Computers don't make mistakes, they don't get bored, they do what they're told. Instead of relying on error prone developers, workflows should rely on automation.\n\nToday there is a lot of hype about how startups X and Y do DevOps. These \"celebrity\" implementations can be intimidating for developers struggling with manual deployments and poor workflows. Many of these examples can be difficult to map to how Drupal works.\n\nMost sites today are built using iterative development and incremental change. Development workflows should evolve the same way. Generally turning everything on its head doesn't end well. During this session Dave will present how incremental improvements to a Drupal development workflow can help prevent errors.\n\nDave will identify processes that can be automated along with suggestions and examples on how to make it happen. This session will provide a good mix of theory and practical examples for users wanting to improve their delivery pipeline. The examples will include:\n\ngit pre commit hooks for ensuring coding standards compliance\nusing a chat bot to provide developers sanitised production databases\nflagging deployments in other systems\nautomated testing against a cloned version of production on each commit\nautomatic deployment after merging a pull request\nAutomation helps reduce errors while freeing up developer time. Your team can use this extra time to think.\n\nAudience Level\n\nThis session is for developers and sys admins who don't mind getting there hands dirty on the command line. There will be some bash and possibly PHP and Python used in the session. The code will be annotated and available on github so most developers should be able to copy, paste, hack and deploy.\n\nAbout Dave Hall\n\nDave is the Managing Director of Dave Hall Consulting. When he isn't working with clients to build high quality web applications, he is helping them improve their infrastructure and business processes. In the last 6 years Dave has been responsible for building, launching and maintaining over 2500 production Drupal sites and maintaining sites for clients including Pfizer, Insurance Australia Group, Al Jazeera and CNN. Dave's focus is Drupal deployments and automation.",
    "favorite": "0",
    "length": "37:53",
    "likes": "0",
    "recorded": "2016-09-26",
    "speakers": [
        "dave-hall"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/f6v3fqrKV6Q/hqdefault.jpg",
    "title": "Let the Machines do the Work",
    "videos": [
        {
            "code": "f6v3fqrKV6Q",
            "type": "youtube"
        }
    ],
    "views": "194"
}