{
    "abstract": "https://events.drupal.org/dublin2016/sessions/hidden-power-drupal-8-core-entity-reference-site-builder-flexible-content",
    "description": "Modern websites require the brand new understanding of what content is and how it is structured. Well-organized content architecture makes the website semantically transparent and the content management process simple and clear. Today by term “content” we don’t mean narrative content. Not anymore.That’s why things like Markdown or WYSIWYG are just not enough.\n\n“We’re not designing pages, we’re designing systems of components.” — Stephen Hay\n\nThere are a plenty of proven concepts and modules which aimed to help us here: Display Suite, Panels, Panelizer, Quick Edit and of course Paragraphs. But with Drupal 8 release we have a lot of opportunities right in core and our mission is to utilize them as much as possible to get the same functionality (or even more!).\n\nIn this session we will try to define a set of common problems when building rich websites with dynamic layouts and to design a solution for creating content for such websites. We will try to use Drupal 8 core modules widely, and especially Entity Reference because of its flexibility and wide support in contrib modules. Finally we will go through a live demo of a complete sandbox website.\n\nThe following topics will be highlighted:\n\nHow to structure a page? In which independent components to split and how granularly?\nHow to re-use content throughout website? How to render the same content differently depending on context? How to just re-style without rendering differently?\nHow to nest components? How to aim flat nesting to get maximum performance?\nHow to organize templates?\nHow to refer to a specific revision of an entity?\nHow to translate a content with layout? How to translate a content partially?\nHow to build custom layouts right in admin UI? How to share layouts between components?\nHow to implement components with dynamic content? Like Views?\nHow to get a maximum benefit from a semantically structured content? How to build tables of contents and h1, h2, h3 headings automatically? How to get responsive design done automatically?\nThe following modules will be covered:\n\nEntity Reference\nQuick Edit\nContextual Links\nEntity Construction Kit\nEntity Translation\nEntity Reference Revisions\nDynamic Entity Reference\nReferences dialog\nInline Entity Form\nEntity Reference Live Preview\nEntity reference viewmode selector\nEntity view modes\nViewfield\nIn this session I want to share a real experience when designing a content architecture for large multi-lingual and multi-layout websites for enterprise and academics.\n\nThese very simple but extremely flexible techniques can be used for any entity type (not just Paragraphs!) and in almost any project. We also get some new possibilities like automatic table of contents and h1, h2, h3 headings. And this is only the beginning.\n\nRe-understand your content today and create your own site buidling experience on top of Entity Reference from Drupal 8 core and its wide contrib ecosystem!",
    "favorite": "0",
    "length": "53:46",
    "likes": "14",
    "recorded": "2016-09-26",
    "speakers": [
        "anton-staroverov"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/SpeGobk4JZ0/hqdefault.jpg",
    "title": "Drupal 8 hidden power: Entity Reference as a component-based site builder",
    "videos": [
        {
            "code": "SpeGobk4JZ0",
            "type": "youtube"
        }
    ],
    "views": "631"
}