{
    "description": "Vous avez toujours entendu parler du Big Data, ces nouvelles technologies qui vont révolutionner nos vies. Mais savez vous que ces technologies reposent sur des théories ou résultats de recherche qui datent d'une décade déjà ?Pendant cette session, nous allons découvrir en détail 2 algorithmes largement utilisés dans le monde du Big Data mais peu connus du grand public.Compter de manière exacte dans un monde distribué est une tâche ardue, et requiert un stockage proportionnel à la taille de l'ensemble considéré. L'algorithmeHyperLogLog&nbsp;propose plutôt une estimation avec un faible pourcentage d'erreur et un espace de stockage requis assez minuscule.Quant aux systèmes distribués avec l'architecture maître/esclave, ils ont toujours été confrontés à la problématique d'élection d'un leader de manière fiable et éprouvée.&nbsp;Paxos, un algorithme de consensus distribué, est une solution élégante et mathématiquement prouvée pour résoudre ce casse-tête.\n\n\nAuthor:\nDuyHai DOAN\nDuy Hai est évangéliste technique pour Datastax, l’entreprise commerciale derrière Apache Cassandra.\n\nIl partage son temps entre donner des présentations/meetups/talks sur Cassandra, développer sur des projets open-source pour la communauté et aider les projets utilisant Cassandra.\n\nAvant Datastax, Duy Hai a été développeur freelance Java/Cassandra\n\nBlog: https://github.com/doanduyhai/",
    "favorite": "0",
    "length": "45:47",
    "likes": "0",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/wZWCy0Uxw_4/hqdefault.jpg",
    "title": "Algorithmes distribués pour le Big Data",
    "videos": [
        {
            "code": "wZWCy0Uxw_4",
            "type": "youtube"
        }
    ],
    "views": "332"
}