{
    "description": "Vous avez déjà créé des API Web ou REST. Mais êtes vous sûr de ne pas être passés à coté d'un élément majeur : les relations hypermédia. C'est l'élément clef du style d'architecture REST. Une API l'implémentant sera résolument tournée vers le futur en permettant de pouvoir évoluer plus librement sans rompre la compatibilité avec les clients en place tout en tirant le meilleur du protocole HTTP. Découvrez cet aspect aussi puissant qu’oublié.\n\n\nAuthor:\nDavid MARTIN\nI have a strong interest in all technology stuff in general, especially software development. I focus my expertise on Java applications architecture and development, mainly everything new around this theme.\n\nI've managed a Java development team (up to 12 people) involved in e-commerce projects. During the same period, I've accomplished a two-year management training programme (C Campus, see http://www.pratiques-de-la-formation.fr/Nouvelles-Frontieres-et-C-Campus.html).\n\nI'm managing a technical LinkedIn group : REST Architecture (French) Users Group\n\nTraining experience:\n- I'm currently one of the official Ippon trainers and in charge of Ippon's training offer\n- I was a speaker/trainer at Sfeir (the \"Happy Hour GWT\", http://sites.google.com/a/sfeir.com/happy-hours-gwt/)\n\nPublications:\n- Programmez magazine #115 (http://www.programmez.com/tutoriels.php?tutoriel=90)\n- Some articles on Ippon's blog: http://blog.ippon.fr/author/dmartin/\n- Some posts on SFEIR's blog http://www.insideit.fr/\n\nMisc:\nI developed a public Spring Security integration library for GWT (http://code.google.com/p/gwt-incubator-lib/)\n\nArea of expertise:\nTeam Management, Project Management, Training, Java (SE & EE) and many things around such as Spring (official certification training programme), ORM frameworks (OpenJPA, Hibernate, Ibatis), RESTful/Web API, Application Security, HTML5, ... and most of the common frameworks",
    "favorite": "0",
    "length": "51:38",
    "likes": "0",
    "recorded": "2015-04-10",
    "speakers": [
        "david-martin"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Jw2GZCzsHiY/hqdefault.jpg",
    "title": "API hypermedia",
    "videos": [
        {
            "code": "Jw2GZCzsHiY",
            "type": "youtube"
        }
    ],
    "views": "94"
}