{
    "description": "C'est un audit de sécurité partiel, partial mais participatif que François et Romain vous proposent dans cette session; l'audit d'une application web SpringBoot/JHipsterY seront illustrés et débattus concepts &amp; techniques couvrant l'ensemble du cycle de vie du développement logiciel commela sécurisation de la chaine d'intégration continuela gestion des secrets de confla sécurisation de la jvmla gestion d'identité et d'autorisation avec SAML &amp; oAuth2Le but: vous sensibiliser, vous armer contre les cyber-attaques des hordes barbares, vous développeurs Java, barbus ou pas.\n\n\nAuthors:\n François le Droff\nFrançois Le Droff is a software engineer at Adobe Systems. Prior to joining the Adobe, 7 years ago, François spent a decade building various enterprise webN+1.0 applications for Schlumberger and Atos Open Source Center. François is a full-fledged geek, passionate about IT, Open Source software, and knowledge sharing.\n\nRomain PELISSE\nContributeur PMD et leader du projet XRadar, Romain Pelisse est architecte Open Source depuis plus de 3 ans au sein du centre de compétence Open Source de Atos Origin, où sein duquel il fournit son expertise sur les problématiques liées à la qualité logicielle mais aussi les problématiques de performances des applications Java Web. Expert JBoss, mais aussi sur Linux, Romain PELISSE est avant tout un spécialiste des technologies Open Source, qu'il s'agisse de savoir comment bien les utiliser, mais aussi comment rentrer en relation avec les communautés qui produisent ces solutions ou encore de fournir des correctifs.",
    "favorite": "0",
    "length": "50:12",
    "likes": "0",
    "recorded": "2015-04-10",
    "speakers": [
        "francois-le-droff",
        "romain-pelisse"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/axpjklk-5HE/hqdefault.jpg",
    "title": "Barbus et Barbares",
    "videos": [
        {
            "code": "axpjklk-5HE",
            "type": "youtube"
        }
    ],
    "views": "71"
}