{
    "description": "Après plus de 10 ans, Java a maintenant une API standard pour le cache, telle que délivrée par la JSR-107. En parallèle, Ehcache, cette bonne vieille librairie de 10 ans d’âge, va renaître.&nbsp;Ehcache 3&nbsp;est en effet annoncée: compatible JSR-107, API entièrement \"générifiée\", les bons morceaux des versions 2.x et quelques innovations.Cela peut sembler beaucoup à digérer en une fois. De ce fait la présentation suivra le rythme d’un bon repas:En entrée, vous découvrirez l’API et les fonctionnalités de la JSR-107.Le plat principal couvrira des cas d’utilisation pratiques d’un cache. Cela nous permettra de comprendre ce que javax.cache offre mais aussi les manquements. Cela sera servi avec une découverte des fonctionnalités additionnelles de Ehcache 3. Vous découvrirez comment en bénéficier sans devoir abandonner la seule dépendance au standard.Pour le dessert, nous jetterons un coup d’oeil à des morceaux choisis de Ehcache 3 qui le rende unique comparé aux autres offres de cache, y compris les anciennes versions.\n\n\nAuthor:\nLouis Jacomet\nLouis Jacomet has been perfecting his knowledge of enterprise Java for nearly 10 years. Initially as a developer, his role evolved over the last years as technical team leader or coach. As an avid learner, Louis is now getting to know Scala and its ecosystem as a new challenge.\nIn addition to the bits and bytes, Louis is interested in people management skills mandatory to create a productive project team.\nDiscovering Agile 5 years ago was a revelation and has underpinned all his work since, whether on an Agile project or not.\nLouis works in Belgium as a freelance contractor.",
    "favorite": "0",
    "length": "52:37",
    "likes": "0",
    "recorded": "2015-04-09",
    "speakers": ["louis-jacomet"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/cnj7b98KeRU/hqdefault.jpg",
    "title": "Caching reboot: javax.cache & Ehcache 3",
    "videos": [
        {
            "code": "cnj7b98KeRU",
            "type": "youtube"
        }
    ],
    "views": "140"
}