{
    "description": "De plus en plus d'objets connectés apparaissent sur le marché, mais où sont ceux dont nous avons besoin ? Matthieu, Ludovic et Gwennael vous feront découvrir le monde des objets connectés et partageront avec vous de vrais uses cases !\n\n\nAuthors:\nMatthieu Plantey\nIngénieur en télécommunications depuis 10 ans, je suis passé par les opérateurs telco à la grande période des box triple play puis, après un crochet par le secteur des opérateurs d'énergie, j'ai participé à l'aventure d'un des pionniers des objets connectés pendant 5 ans. Je suis aujourd'hui membre d'une équipe autogérée pour apporter des nouveaux usages à la tendance des objets connectés.\n\nLudovic Havel\nIngénieur telco depuis 10 ans, j'ai toujours travaillé chez des éditeurs de logiciels. D'abord sur des plateformes de téléphonie fixe pour les opérateurs pendant 5 ans, puis chez un éditeur de solution de notification pendant 1 an. J'y ai rencontré mes deux associés pour fonder Optiflows en 2011 et renouer avec mes premières envies: l'entreprenariat et le création d'un produit (surycat). Avec toute l'équipe R&D je me consacre aujourd'hui à faire émerger Surycat en tant que plateforme et bientôt service d'intégration multi-systèmes/protocoles.\n\nGwennael Gate\nGwennael is a do-it-all software engineer passionate about making AI algorithms work in the real world.\n\nAfter 5 years at Aldebaran Robotics, where he led the teams of software engineers developing NAO's and Pepper's artificial brains, Gwennael is now co-founding angus.ai, an AI cloud platform for the Internet of Things.",
    "favorite": "0",
    "length": "40:47",
    "likes": "0",
    "recorded": "2015-04-10",
    "speakers": [
        "matthieu-plantey",
        "ludovic-havel",
        "gwennael-gate"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/1YTccFRu-KA/hqdefault.jpg",
    "title": "Des objets connectés c'est bien, utiles c'est mieux !",
    "videos": [
        {
            "code": "1YTccFRu-KA",
            "type": "youtube"
        }
    ],
    "views": "79"
}