{
    "description": "A la binouze, ça grommelle sec entre développeurs. Les chefs qui refusent d'investir dans des tests automatisés. Les spécifications qui ne ressemblent plus à rien. Le vétéran de l’équipe qui prend l’équipe en otage de son sale caractère. Développeur, tu es rarement décideur, et ça frustre. Pourtant, tu peux influencer ton contexte. Certains y arrivent, j'en connais. Je vais démystifier leur pouvoir, décomposer comment ils y parviennent, sans être pris dans la spirale du fatalisme ou du cynisme.\n\n\nAuthor:\nGuillaume Duquesnay\nJe suis codeur depuis tout petit. Après une première partie de carrière en tant que développeur (98) puis consultant (2005), je me suis tourné vers le coaching agile, sans renier ma passion pour le code. Aujourd'hui je suis freelance, j'aide mes clients patati patata accompagner la transformation et tout ça et tout ça. Je suis surtout un touche à tout. Je croise les approches, j'essaie d'amener un regard différent, et lorsque cela m'amène à des découvertes, je les partage avec la communauté.\n\nA titre personnel, Guillaume s'est engagé dans une association internationale à but humanitaire, le Rotaract, jusqu'au niveau national et européen, qui lui a permis d'enrichir sa réflexion sur les dynamiques de groupes. \n\nCes expériences ont permis de développer des réflexions décalées, notamment :\n\nla méthode PRACMA : sur l’usage pertinent des pauses cafés par les centres de compétences,\nle Plouf : l’ennemi que l’on doit vaincre pour passer à l'action,\nla Pilule Rouge : sur les techniques de collaboration distante, leurs difficultés, et les moyens de les faciliter.\nAujourd'hui, à côté de ses activités de conseil, il diffuse ses réflexions chez ses clients et dans les communautés Agile et Java au cours de sessions réputées pour leur décalage.",
    "favorite": "0",
    "length": "48:52",
    "likes": "0",
    "recorded": "2015-04-09",
    "speakers": [
        "guillaume-duquesnay"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/GWNsTPlq3XU/hqdefault.jpg",
    "title": "Développeur sous influence",
    "videos": [
        {
            "code": "GWNsTPlq3XU",
            "type": "youtube"
        }
    ],
    "views": "85"
}