{
    "description": "Techniques such as automated testing, continuous integration and continuous deployment allow software to be developed to a high standard and easily packaged and deployed to test environments, resulting in the ability to rapidly, reliably and repeatedly push out enhancements and bug fixes to customers at low risk and with minimal manual overhead. What container-agnostic tools are available for testing, continuous integration and deployment of a Java EE application ?This talk will provide a quick overview of Arquillian and how it helps in testing across multiple containers. Separate approaches for greenfield and brownfield applications will be shown. Configuring Jenkins for Continuous Integration will be shown. Setting up multiple WildFly containers on OpenShift for testing and production will be shown in detail. At the end of this session, attendees would have converted their development environment to leverage the power of Jenkins, Arquillian, and OpenShift to setup an automated Continuous Delivery pipeline for Java EE application.\n\n\nAuthor:\nArun Gupta\nArun Gupta is Director of Developer Advocacy at Red Hat and focuses on JBoss Middleware. As a founding member of the Java EE team at Sun Microsystems, he spread the love for technology all around the world.\n\nAt Oracle, he led a cross-functional team to drive the global launch of the Java EE 7 platform through strategy, planning, and execution of content, marketing campaigns, and program. After authoring ~1400 blogs at blogs.oracle.com/arungupta on different Java technologies, he continues to promote Red Hat technologies and products at blog.arungupta.me. Arun has extensive speaking experience in 35+ countries on myriad topics. An author of a best-selling book, an avid runner, and a globe trotter, he is easily accessible at @arungupta.",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/hup3bqX5Nt4/hqdefault.jpg",
    "title": "DevOps with Java EE",
    "videos": [
        {
            "code": "hup3bqX5Nt4",
            "type": "youtube"
        }
    ]
}