{
    "description": "Every year, the Eclipse simultaneous release brings together the hard work of dozens of open source projects into a single coordinated release. Most people think of Eclipse as a Java IDE; for the IDE crowd, this year's Mars release introduces changes in the look and feel of Eclipse, improved Java 8 support, enhanced content assist, and more. In this session, we'll walk through some of the new IDE features and survey some of the other technology being developed by open source projects at Eclipse. But Eclipse is also much more than an IDE. Repeat after me: \"Eclipse is much more than just an IDE! Eclipse has a lot of cool projects that can get me started with the Internet of Things!\". So whether or not you are using Eclipse as your IDE, the second half of this session will give you a crash course on the available technologies to build the Internet of Things on top of Java. You will learn how protocols like MQTT, CoAP or LwM2M and embedded frameworks like Kura help solve classical IoT issues, and you will get useful tips to move from \"yay, I blinked an LED!\" to more useful industrial IoT scenarios.\n\n\nAuthors:\nBenjamin Cabé\nOpen Source guy in a wireless company |\nEclipse M2M Working Group chair | Koneki & Mihini project lead\n\nWayne Beaton\nWayne is the Director of Open Source Projects at the Eclipse Foundation. He spends his days working with the many Eclipse projects, learning about Eclipse technology, and making sure that everybody knows just how cool it all really is. When not working, he can usually be found watching his kids play hockey at one of the many local arenas.",
    "favorite": "0",
    "length": "25:59",
    "likes": "0",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/BrMfpZ4kI3c/hqdefault.jpg",
    "title": "Eclipse is much more than just an IDE!",
    "videos": [
        {
            "code": "BrMfpZ4kI3c",
            "type": "youtube"
        }
    ],
    "views": "88"
}