{
    "description": "Elasticsearch est schemaless : il n'est pas nécessaire de décrire le contenu d'un index pour commencer à écrire des données. C'est pratique pour démarrer rapidement une application et la faire évoluer facilement au gré des développements.Pourtant, dans le cas d'Elasticsearch, le mapping, influence fortement les résultats de la recherche, jusqu'à en changer le fonctionnement dans les cas les plus extrêmes.Nous verrons par des exemples concrets comment le mapping influence les résultats de recherche, puis nous verrons comment retrouver de la souplesse avec les modèles d'index.\n\n\nAuthor:\nJérôme Mainaud\nArchitecte et développeur Java chez Ippon Technologies, j'interviens en assistance pour la mise en œuvre de projet utilisant des moteurs de recherche comme Elasticsearch et des bases NoSQL Cassandra.\n\nAuparavant, j'ai assuré pendant cinq ans la responsabilité technique d'un progiciel d'archivage . Mon principal chantier fut de réaliser une nouvelle version capable de gèrer de façon unifiée les documents papier et électronique. Les volumes de données étant conséquents, ce fut l'occasion étudier les bases NoSQL. Mais aussi de rafraîchir les outils de recherche en remplaçant l'utilisation directe de Lucene par Elasticsearch.\n\nC'est alors que j'ai commencé à fréquenter la mailing-liste francophone elasticsearch-fr.\n\nBlog: http://www.linkedin.com/pub/j%C3%A9r%C3%B4me-mainaud/17/5b8/201",
    "favorite": "0",
    "length": "30:23",
    "likes": "4",
    "recorded": "2015-04-08",
    "speakers": ["jerome-mainaud"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gPgz2FRe9nY/hqdefault.jpg",
    "title": "Elasticsearch - De l'importance du mapping",
    "videos": [
        {
            "code": "gPgz2FRe9nY",
            "type": "youtube"
        }
    ],
    "views": "644"
}