{
    "description": "Vous voulez savoir comment le cycle de release de Groovy est passé d’une après midi entière d’actions manuelles, à un process automatisé de quelques minutes ? Rejoignez alors Guillaume Laforge, Fondateur du projet Groovy, et Fred Simon, Chief Architect chez Jfrog, ils vont vous dévoiler le secret des équipes de Groovy qui ont conçu et outillé un cycle de release de quelques minutes grâce à Artifactory et Bintray.\n\n\nAuthors:\nGuillaume Laforge\nGuillaume Laforge is the Groovy Project Manager, and Spec Lead of JSR-241, the Java Specification Request standardizing the Groovy dynamic language in the Java Community Process. As Vice President Technology of G2One, the company dedicated to the development of Groovy and Grails, he provides professional services around those technologies (training, support, and consulting). Guillaume co-authored the Groovy in Action best-seller book for Manning, and reviewed and wrote forewords for most of the Groovy and Grails books on the market. You can meet him at conferences around the world where he evangelizes the Groovy dynamic language, and the agile Grails web framework.\n\nFred Simon\nCo-Fondateur et Architecte de JFrog - créateurs d'Artifactory et Bintray. Développeur depuis 1992 et expert Java depuis 1998 en tant que co-fondateur de AlphaCSP.\n\nBlog: http://www.jfrog.com/\n\nCédric Champeau\nCédric Champeau est committer sur Groovy Core. Il a rejoint SpringSource, une division de VMware, afin de participer au développement du langage après avoir passé plusieurs années à l'exploiter de manière industrielle chez un éditeur logiciel, Lingway, dans de multiples contextes (DSL, scripting, workflows, ...).\n\nCédric Champeau is a core Groovy committer. He joined SpringSource, a division of VMware, in order to help developing the language. Prior to that, he spent several years at Lingway, a software editor, where he used Groovy in multiple industrial contexts including DSLs for natural language processing, scripting or even workflows.",
    "favorite": "0",
    "length": "49:54",
    "likes": "0",
    "recorded": "2015-04-09",
    "speakers": [
        "cedric-champeau",
        "fred-simon",
        "guillaume-laforge"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/BUhjoibUOpI/hqdefault.jpg",
    "title": "Groovy et son process de release: nous l’avons rendu « grooooooovy » !",
    "videos": [
        {
            "code": "BUhjoibUOpI",
            "type": "youtube"
        }
    ],
    "views": "15"
}