{
  "description": "Comme chaque année, les 3 organisateurs de Devoxx France vous accueillent et vous proposent quelques informations sur la 4ème édition de Devoxx France.Nous aurons aussi 2 invités surprise, avec quelques annonces. Ne manquez pas le début à 9h00 précise.\n\n\nAuthors:\nZouheir Cadi\nZouheir CADI est consultant spécialisé dans les technologies java/jee. Après plusieurs années dans le développement, il est architecte suivi de production, un métier passionnant, interface entre le développement et les problématiques opérationnelles. Il est également intervenant à Telecom ParisTech où il enseigne les technologies java.\n\nZouheir CADI est membre du bureau du Paris JUG et co-fondateur de Devoxx France.\n\nAntonio Goncalves\nArchitecte senior, Antonio Goncalves intervient chez ses clients comme consultant et formateur. Ancien consultant Weblogic chez BEA Systems, il s'est spécialisé depuis 1998 dans l'architecture logicielle et les technologies Java.\rAntonio est l'auteur du livre Java EE 5 aux éditions Eyrolles, et de \"Beginning Java EE 6 Platform With GlassFish 3\" chez Apress. Il est membre du JCP et intervient sur les JSR 316 (Java EE 6), JSR 317 (JPA 2.0) et JSR 318 (EJB 3.1).\rIl enseigne également la plate-forme Java EE au Conservatoire National des Arts et Métiers. Il est rédacteur technique pour les sites DevX et developpez.com.\rAntonio est co-fondateur et co-responsable du Paris Java User Group.\n\nNicolas Martignole\nFreelance, co-créateur de la conference DevoxxFrance, Membre du ParisJUG, Bloggeur le Touilleur Express et fondateur de l'express-board.fr",
  "recorded": "2016-06-08",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/gf0WxLUHpQE/hqdefault.jpg",
  "title": "Keynote de l’équipe Devoxx France",
  "videos": [
    {
      "code": "gf0WxLUHpQE",
      "type": "youtube"
    }
  ]
}