{
    "description": "Comme chaque année, les 3 organisateurs de Devoxx France vous accueillent et vous proposent quelques informations sur la 4ème édition de Devoxx France.Nous aurons aussi 2 invités surprise, avec quelques annonces. Ne manquez pas le début à 9h00 précise.\n\n\nAuthors:\nAntonio Goncalves\nArchitecte senior, Antonio Goncalves intervient chez ses clients comme consultant et formateur. Ancien consultant Weblogic chez BEA Systems, il s'est spécialisé depuis 1998 dans l'architecture logicielle et les technologies Java.\rAntonio est l'auteur du livre Java EE 5 aux éditions Eyrolles, et de \"Beginning Java EE 6 Platform With GlassFish 3\" chez Apress. Il est membre du JCP et intervient sur les JSR 316 (Java EE 6), JSR 317 (JPA 2.0) et JSR 318 (EJB 3.1).\rIl enseigne également la plate-forme Java EE au Conservatoire National des Arts et Métiers. Il est rédacteur technique pour les sites DevX et developpez.com.\rAntonio est co-fondateur et co-responsable du Paris Java User Group.\n\n Rodolphe Gelin\nRodolphe GELIN, (Ecole Nationale des Ponts et Chaussées, 1988, Master Degree Artificial Intelligence, Université Paris VI) has been working for 20 years at CEA (French Atomic Energy Commision) as researcher in robotics. He as mainly involved in robotics for assistance to disabled people. He was head of robotics, virtual reality and cognitics program in CEA when he joined Aldebaran Robotics in December 2008 as Head of Collaborative Projects.\n\n Eric Filiol\nEric Filiol is the head of (C+V)O research lab at ESIEA, France and senior consultant in offensive cybersecurity and intelligence. He spent 22 years in the French Army (Infantry/Marine Corps). He holds an Engineer diploma in Cryptology, a PhD in applied mathematics and computer science and a Habilitation Thesis in Computer Science. He is graduated from NATO in InfoOps. He is the Editor-in-chief of the Journal in Computer Virology. He has been a speaker at international security events including Black Hat, CCC, CanSecWest, PacSec, Hack.lu, Brucon, H2HC…\n\nDan Allen\nundefined\n\nNicolas Martignole\nFreelance, co-créateur de la conference DevoxxFrance, Membre du ParisJUG, Bloggeur le Touilleur Express et fondateur de l'express-board.fr",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Whn5P3N9jBg/hqdefault.jpg",
    "title": "Keynote de l'équipe Devoxx France",
    "videos": [
        {
            "code": "Whn5P3N9jBg",
            "type": "youtube"
        }
    ]
}