{
    "description": "Les révélations de Snowden ont mis en lumière l'existence de contrôles sur les technologies de l'information dans les pays occidentaux. Toutefois cette situation tire, en tant qu'approche systématique, ses origines à la fin des années 40. Durant cette présentation, nous expliquerons tout d'abord les différents niveaux et moyens de ces contrôles et les illustrerons à l'aide de cas antérieurs aux révélations de Snowden (ou non traités par ce dernier). Ensuite, nous tenterons de comparer les avantages et les inconvénients liés au contrôle des technologies de l'information et montrerons qu'une vision purement manichéenne est impossible. Alors que nous pouvons aisément comprendre et accepter des contrôles cibles (ayant pour but de lutter préventivement contre les terroristes, mafieux, pédophiles...), l'opinion publique semble totalement allergique à la surveillance de masse des citoyens. Nous proposerons un petit voyage prospectif dans le futur proche pour montrer ce qui nous attend:\n\n\nAuthor:\n Eric Filiol\nEric Filiol is the head of (C+V)O research lab at ESIEA, France and senior consultant in offensive cybersecurity and intelligence. He spent 22 years in the French Army (Infantry/Marine Corps). He holds an Engineer diploma in Cryptology, a PhD in applied mathematics and computer science and a Habilitation Thesis in Computer Science. He is graduated from NATO in InfoOps. He is the Editor-in-chief of the Journal in Computer Virology. He has been a speaker at international security events including Black Hat, CCC, CanSecWest, PacSec, Hack.lu, Brucon, H2HC…",
    "favorite": "0",
    "length": "18:28",
    "likes": "1",
    "recorded": "2015-04-09",
    "speakers": [
        "eric-filiol"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Vfb_bgGWptg/hqdefault.jpg",
    "title": "La problématique du contrôle des Technologies de l’information",
    "videos": [
        {
            "code": "Vfb_bgGWptg",
            "type": "youtube"
        }
    ],
    "views": "147"
}