{
    "description": "Venez rejoindre Les Cast Codeurs en chair et en os pour clôturer cette édition de Devoxx France ! Cette année, nous allons faire un peu différent : organiser une table ronde pour échanger avec certains des speakers de Devoxx et prendre un peu de recul sur les thèmes abordés.Les Cast Codeurs est un podcast en français sur Java et la JVM de, par et pour les développeurs. Mais ils sortent de leur cave de temps en temps pour faire des émissions endiablées, en direct devant une foule en délire. C'est notre perspective en tous cas.\n\n\nAuthors:\nEmmanuel Bernard\nAfter graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry where he started to be involved in the ORM space. He joined the Hibernate team 4 years ago and is now a core developer at JBoss, a division of Red Hat. Emmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate core implementing the Java Persistence(tm) specification, as well as Hibernate Search and Validator. Emmanuel is a member of the EJB 3.0 expert group and the JSR 303: Bean Validation expert group. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and JAX.\n\nVincent Massol\nVincent is the CTO of XWiki SAS and an active committer of the XWiki open source project. Before being paid to work on open source he spent over 10 years working nights and week ends having fun on various open source projects (committer on Apache Maven, creator of Apache Cactus and Codehaus Cargo to name a few).\n\nVincent also co-authored 3 books: JUnit in Action , Maven: A Developer's Notebook and Better Builds with Maven. He's a regular speaker at IT and Java conferences and also a member of LesCastCodeurs podcast, a French podcast focusing on news in the Java world at large.\n\nVincent lives in the countryside in France, enjoying life with his wife Marie-Albane and his 3 boys Pierre-Olivier, Jean and Paul. When not watching his lawnmower robot do its work, he likes playing Tennis...",
    "favorite": "0",
    "length": "50:41",
    "likes": "0",
    "recorded": "2015-04-10",
    "speakers": [
        "emmanuel-bernard",
        "vincent-massol",
        "antonio-goncalves",
        "arnaud-heritier",
        "guillaume-laforge"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/BNotVmjG2ko/hqdefault.jpg",
    "title": "Les Cast Codeurs Podcast : table ronde",
    "videos": [
        {
            "code": "BNotVmjG2ko",
            "type": "youtube"
        }
    ],
    "views": "34"
}