{
    "description": "C'est une aventure très enrichissante de passer d'une organisation de type \"éditeur logiciel\" (Cycle Plan/Dev/Recette/Prod) avec une release par mois à une organisation non moins solide de type \"Continuous Delivery\" avec une mise en production par jour de \"ce qui est prêt\". C'est pourquoi nous vous proposons de découvrir les moyens techniques et organisationnels en pratique chez LesFurets.com pour garantir la qualité tout en diminuant le \"Time To Market\" : déploiement par les devs, travail en feature branches avec un merge continu, itérations avec le business, monitoring de prod pour tous, ...\n\n\nAuthors:\nDimitri BAELI\nDimitri Baeli est en charge de la gestion de la qualité des produits eXo et des pratiques de développement, domaines sur lesquels il s'est concentré depuis son intégration en 2008 en tant que directeur de l'utilisabilité. Grâce à ses activités, eXo a généralisé la méthodologie de développement agile Scrum, a amélioré les processus de release et de support et a créé des équipes dédiées à la qualité des builds et des releases. Dimitri est arrivé chez eXo avec 10 années d'expériences à développer des interfaces hommes machines pour des vendeurs français: Datox (Gestion de contenus web pour les medias), Dotvision (3D et réseaux M2M), Almonde (logiciels pour les banques) et Prima-Solutions (logiciels d'assurance et modelage UML). Dimitri détient un DEA en interfaces Hommes-Machines de l'université de Grenoble et un master en sciences de l'École Nationale Supérieure d'Informatique et de Mathématiques de Grenoble (ENSIMAG), une des meilleures écoles d'ingénieur française.\n\nBenjamin Degerbaix\nAprès avoir passé 5 ans à développer des logiciels de gestion et d'analyse de risques pour les banques de marchés, je travaille actuellement, et ce depuis près de 2 ans, au sein de l'équipe R&D du site de comparaison d'assurances LesFurets.com. Je touche un peu à tout, du front au back, de la UI du site mobile, à l'extraction de données et l'automatisation de rapports.",
    "favorite": "0",
    "length": "01:01:51",
    "likes": "1",
    "recorded": "2015-04-10",
    "speakers": [
        "dimitri-baeli",
        "benjamin-degerbaix"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/AU4dKMsqFiE/hqdefault.jpg",
    "title": "Livrer chaque jour ce qui est prêt ! Points clés du développement d'un produit avec une livraison p",
    "videos": [
        {
            "code": "AU4dKMsqFiE",
            "type": "youtube"
        }
    ],
    "views": "160"
}