{
    "description": "Cette conférence a pour objet de partager avec les participants le processus d'intégration d'un système de Machine Learning (ML) dans une application Java / Scala. Elle s'adresse aux développeurs qui souhaitent inclure des services de recommandation en ligne, d'analyse de risque ou d'intelligence client mais qui n'ont pas de connaissances particulières en ML. Nous aborderons :Le processus global :&nbsp;Choix des échantillons d'apprentissage et de test, sélection de l'algorithme de machine learning, évaluation et optimisation du modèleLa préparation de l'échantillon de données :&nbsp;Les critères de choix des données à collecter, le volume à injecter, les transformations à réaliser en amont de l'application de l'algorithme de MLLa sélection et la construction du modèle :&nbsp;Cette section parcoure les catégories d'algorithmes disponibles dans MLLib et présente les principales règles de sélection et d'ajustement en fonction de l'objectif.L'évaluation et l'optimisation du modèle :&nbsp;Cette section présente les métriques d'évaluation de la performance prédictive des modèles ML ainsi que les diagrammes D3.js de visualisation adaptés.\n\n\nAuthor:\nHayssam Saleh\nApache Spark Certified Developer, Hayssam Saleh is Senior Architect with a focus on fault tolerant distributed systems and Web applications. He is currently the technical lead at EBIZNEXT where he supervises Scala / NoSQL projects since early 2012. He holds a PhD in distributed computing from Université Pierre et Marie Curie (Paris VI).\n\nBlog: http://blog.ebiznext.com",
    "favorite": "0",
    "length": "50:03",
    "likes": "5",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/O4VhfJ5IGfE/hqdefault.jpg",
    "title": "Machine Learning avec Spark, MLLib et D3.js",
    "videos": [
        {
            "code": "O4VhfJ5IGfE",
            "type": "youtube"
        }
    ],
    "views": "517"
}