{
    "description": "Le machine learning est la science qui permet à un algorithme d’apprendre sans avoir été explicitement programmé pour cela. Elle est utilisée par les acteurs de la nouvelle économie pour le traitement de gros volumes de données, dans la traduction automatique, la reconnaissance de la parole, la classification de consommateur, la construction de réputation, ou la prévision des trafics. C’est la  régulation numérique .Nous parlerons des champs d’application du machine learning par les gros acteurs du numérique, de ses fondements mathématiques, des grandes familles d’algorithmes et des outils disponibles pour mettre en pratique.Découvrez les bases pour comprendre cette science et mesurer le potentiel des possibilités de son utilisation.\n\n\nAuthors:\nGuillaume Laforge\nGuillaume Laforge is the Groovy Project Manager, and Spec Lead of JSR-241, the Java Specification Request standardizing the Groovy dynamic language in the Java Community Process. As Vice President Technology of G2One, the company dedicated to the development of Groovy and Grails, he provides professional services around those technologies (training, support, and consulting). Guillaume co-authored the Groovy in Action best-seller book for Manning, and reviewed and wrote forewords for most of the Groovy and Grails books on the market. You can meet him at conferences around the world where he evangelizes the Groovy dynamic language, and the agile Grails web framework.\n\nDidier Girard\nDidier Girard est à la tête de la Direction Innovation et des Nouvelles Technologies de SFEIR où il définit la stratégie technologique de l'entreprise tout en assurant des missions d'architecture pour des grands comptes. Il est Docteur en Informatique de l'Ecole Normale Supérieure de Lyon, architecte J2EE, il utilise Java coté serveur depuis 1997. Créateur du site portail http://www.application-servers.com et de http://www.ongwt.com, il anime régulièrement des conférences sur des sujets comme l'industrialisation des développements, le client riche, Eclipse, les services web, l'architecture J2EE… Didier Girard a été Directeur Technique de IMPROVE après avoir passé 4 ans chez Atos.",
    "favorite": "0",
    "length": "53:53",
    "likes": "0",
    "recorded": "2015-04-09",
    "speakers": [
        "guillaume-laforge",
        "didier-girard"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/9NuzSP12Byg/hqdefault.jpg",
    "title": "Machine learning et régulation numérique",
    "videos": [
        {
            "code": "9NuzSP12Byg",
            "type": "youtube"
        }
    ],
    "views": "105"
}