{
    "description": "Apache Mesos apporte une abstraction des ressources CPU, mémoire et stockage, d'un ensemble de machines (physiques ou virtuelles). Un cluster Mesos forme un système distribué, tolérant à la panne et permettant de scaler les services déployés. Venez découvrir les fonctionnalités de Mesos, ses stratégies de déploiement, et l'écosystème Mesosphere qui apporte scalabilité et découverte de services. Nous visiterons un cluster hébergeant une application JS et un backend REST conteneurisés. Pour finir, nous jouerons au Chaos Monkey afin de prouver la résilience du système mis en place.\n\n\nAuthors:\nPablo Lopez\nPablo a 8 ans d’expérience au cours desquels il s’est forgé une solide expérience d’architecte logiciel. Il dispose d’une très large compétence sur l’ensemble de l’écosystème JEE, et notamment les solutions du monde open-source. Opérationnel par goût, il intervient sur une large variété de missions, de l'analyse de performances en production au conseil en architecture logicielle.\n\nAurélien Maury\nAu cours de sa carrière en ESN, Aurélien a acquis une forte expérience dans le développement d'applications web, l'architecture de SI et l'utilisation de plate-formes Cloud. Les missions qu'il a eu à remplir, notamment pour Xebia, l'ont amenées à analyser et optimiser de nombreux et variés environnements clients. Ses domaines de prédilections : performance, monitoring, intégration au SI, automatisation, DevOps et plate-formes Cloud. Son credo : \"Make it work, Make it right, Make it fast\".\n\nBlog: http://www.wescale.fr\n\nJean-Baptiste Claramonte \nDéveloppeur Java, je suis ces derniers temps l'actualité autour de la containerisation / déploiement / scalabilité.\n\nBlog: https://plus.google.com/110040439383405115773\n\nJean-Pascal Thiery\nJava Craftsman et agiliste pratiquant. Jean-Pascal a arpenté les voies de l'intégration continue jusqu'à intégrer la mouvance DevOps. Il aime : Java, Docker, Mesos, et la qualité des livrables. Il n'aime pas : les phrases qui commence par \"Normalement, ...\".",
    "favorite": "0",
    "length": "02:59:42",
    "likes": "0",
    "recorded": "2015-04-08",
    "speakers": [
        "aurelien-maury",
        "pablo-lopez",
        "jean-baptiste-claramonte",
        "jean-pascal-thiery"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/BzfATx5lrwg/hqdefault.jpg",
    "title": "Mesos University",
    "videos": [
        {
            "code": "BzfATx5lrwg",
            "type": "youtube"
        }
    ],
    "views": "122"
}