{
    "description": "Vous voulez savoir ce que la persistance dans du NoSQL implique dans une architecture Java?Java est le fief de l'Orienté Objet où les ORMs poussent comme des champignons. Est-ce que les ORMs apportent encore des bénéfices dans le monde du NoSQL et de la persistance polyglotte? On discutera aussi le pourquoi et le comment du design de données dans le NoSQL.Comme dans l'émission,&nbsp;On n'est pas que des cobayes, on tentera de faire cohabiter ORMs et NoSQL en y analysant le résultat. Parmi les défis relevés, on pourra y voir:Peut on survivre avec un seul produit NoSQL ?NoSQL implique-t-il des cauchemardas de duplications de données?JPA et NoSQL c'est comme faire rentrer une pièce ronde dans un trou carré?Les ORMs ne peuvent pas abstraire proprement les modèles de données NoSQL?Les ORMs c'est comme la nitro, ça booste les performances... ou pas?Abstraire les langages de requêtage NoSQL, c'est trop difficile?.Sans l'accès natif aux APIs NoSQL, point de salut?Les ORMs n'apportent pas vraiment de valeur dans un monde NoSQL?Venez discuter et débattre.\n\n\nAuthor:\nEmmanuel Bernard\nAfter graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry where he started to be involved in the ORM space. He joined the Hibernate team 4 years ago and is now a core developer at JBoss, a division of Red Hat. Emmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate core implementing the Java Persistence(tm) specification, as well as Hibernate Search and Validator. Emmanuel is a member of the EJB 3.0 expert group and the JSR 303: Bean Validation expert group. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and JAX.",
    "favorite": "0",
    "length": "49:58",
    "likes": "0",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/F3__SKR54rA/hqdefault.jpg",
    "title": "On n'est pas que des cobayes: ORM et NoSQL sont-ils solubles?",
    "videos": [
        {
            "code": "F3__SKR54rA",
            "type": "youtube"
        }
    ],
    "views": "37"
}