{
    "description": "Les problèmes de planification font partie de notre quotidien.Que ce soit pour l'organisation des horaires de travail en travail posté d'employés, la définition des différents itinéraires que devront suivre une flotte de véhicule, l'assignment de tâches spécifiques à divers machines de fabrication, la mise en place de planning de cours universitaires, la gestion du trafic aérien, etc., une optimisation en temps réel des différentes alternatives possibles est nécessaire pour répondre au mieux aux besoins économiques, financiers et sociaux tout en adhérerant aux contraintes dynamiques ou statiques existantes.Quels algorithmes pouvons-nous utiliser pour optimiser ces cas d'utilisation? Comment fonctionnent ces algorithmes? Comment répondent ces algorithmes lors de pics de charge? Et comment peuvent-ils réduire les dépenses et ainsi augmenter les revenus?OptaPlanner est un moteur Open Source intégrable et léger de planification qui aide les entreprises à résoudre efficacement des problèmes de satisfaction de contraintes. Sous le capot, il combine heuristiques d'optimisation et métaheuristiques avec calcul de score. Pour en savoir plus, consultez www.optaplanner.org.\n\n\nAuthors:\nGeoffrey De Smet\nGeoffrey De Smet is the OptaPlanner lead.\n\nOptaPlanner optimizes business resource usage. Every organization faces planning problems: provide products or services with a limited set of constrained resources (employees, assets, time and money). OptaPlanner optimizes such planning to do more business with less resources.\n\nOptaPlanner is an open source, lightweight, embeddable planning engine written in Java™. It helps normal Java™ programmers solve constraint satisfaction problems efficiently. Under the hood, it combines optimization heuristics and metaheuristics with very efficient score calculation.\n\nhttp://www.optaplanner.org\n\n\nFrederic Hornain\nFrederic is a Solution Architect @ Red Hat living between Brussels and Lille/Rijsel. Frederic is passionate about Enterprise Open Source technology.",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/sJHPjHsSsXQ/hqdefault.jpg",
    "title": "OptaPlanner ou comment optimiser les itinéraires, les plannings et bien plus encore...",
    "videos": [
        {
            "code": "sJHPjHsSsXQ",
            "type": "youtube"
        }
    ]
}