{
  "description": "Apres plusieurs semaines de pratique de Gradle vous commencez à apprivoiser la bête et entrevoyez toute sa puissance. Vos petits scripts fonctionnent bien et vous vous demandez maintenant comment améliorer encore votre système de build, proprement. Il est temps pour vous d'ajouter votre propre plugin Gradle à vos outils.En prenant un exemple simple nous verrons ensemble à quel point il est facile de prendre le contrôle de son build !Voici quelques points abordés : - Créer un plugin Gradle et le controler depuis le build.gradle - Bien Tester son plugin - Gérer les builds incrémentaux - ...\n\n\nAuthors:\nCédric Champeau\nCédric Champeau est committer sur Groovy Core. Il a rejoint SpringSource, une division de VMware, afin de participer au développement du langage après avoir passé plusieurs années à l'exploiter de manière industrielle chez un éditeur logiciel, Lingway, dans de multiples contextes (DSL, scripting, workflows, ...).\n\nCédric Champeau is a core Groovy committer. He joined SpringSource, a division of VMware, in order to help developing the language. Prior to that, he spent several years at Lingway, a software editor, where he used Groovy in multiple industrial contexts including DSLs for natural language processing, scripting or even workflows.\n\nEyal LEZMY\nEyal is a software engineer at Genymobile, working on Genymotion – an Android emulator. He's been working with Android since 2009.\n\nHe's also Treasurer at the Paris Android User Group and a Google Developer Expert in Android.\n\nOver the years, Eyal has been involved in several R&D projects with the French internet providers; worked for Samsung's Android B2B team; and built an Android STB for a hotel chain.",
  "recorded": "2016-06-08",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/ERu3iSmoZ2s/hqdefault.jpg",
  "title": "Plugin Gradle, prenez le contrôle du build !",
  "videos": [
    {
      "code": "ERu3iSmoZ2s",
      "type": "youtube"
    }
  ]
}