{
    "description": "Le rythme d’évolution (et donc de support) de Java s’accélère ces dernières années (et nous n’allons pas nous plaindre). Désormais une nouvelle version de Java est dépréciée tous les deux ans!\nJava 5 : Octobre 2009Java 6 : Février 2013Java 7 : Avril 2015 (QUOI ? DEJA ? MAINTENANT ?)Java 8 : Mars 2017 (incompatibilité source vs binaire, vous allez découvrir...)Mais vous, ou plutôt vos applications, comment gérez vous leurs transitions d’une version de Java à une autre ?\nVenez découvrir dans cette session comment Apache Maven, et son outillage (toolchain, animal-sniffer, …) vous aident à migrer graduellement et sans douleur vos projets.\n\n\nAuthors:\nArnaud Héritier\nArnaud Héritier est Software Factory Manager chez eXo Platform.\nIl est en charge des méthodes et outils de cet éditeur de logiciels afin d’améliorer la qualité des produits, et la productivité des équipes, en interne mais aussi chez les intégrateurs et clients. Passionné par le développement de logiciels il a rejoint en 2004 la communauté Open Source du projet Apache Maven. Il est ensuite rentré dans son comité de direction en 2005.\nIl est auteur, avec Nicolas de Loof, d’un ouvrage sur le sujet en Français. Il participe dès que possible aux évènements communautaires pour partager sa passion (Java Users Groups, Java BarCamps, …). Il vient de publier avec quelques ex-collègues un livre blanc chez OCTO Technology : Java Productivity Primer, Twelve guidelines to boost your productivity with a software factory. Ce dernier est disponible gratuitement en téléchargement en Français et en Anglais.\n\nHervé Boutemy\nCommitter Maven depuis 2007, PMC Chair depuis juillet 2014 Membre de la Fondation Apache depuis 2011 Touche à tout de l'ensemble du code Maven...\n\nBlog: http://people.apache.org/~hboutemy",
    "favorite": "0",
    "length": "32:37",
    "likes": "0",
    "recorded": "2015-04-08",
    "speakers": [
        "arnaud-heritier",
        "herve-boutemy"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/pfzcWqUdjeA/hqdefault.jpg",
    "title": "Quand Java prend de la vitesse, Apache Maven vous garde sur les rails",
    "videos": [
        {
            "code": "pfzcWqUdjeA",
            "type": "youtube"
        }
    ],
    "views": "116"
}