{
    "description": "Le Streaming est une méthode de plus en plus utilisé pour les systèmes distribués temps réel. Dans cette session on montre comment l’utilisation de techniques avancés dans ce domaine permet d’avoir du Streaming qui est à la fois flexible, performant et à l’épreuve du temps.Cette session va commencer par un résumé rapide sur le Streaming, puis expliquer en détail quelques techniques d’écriture, de modélisation et de requêtage ainsi que leurs avantages pour aller beaucoup plus loin que le&nbsp; schemaless JSON sur le wire !\n\n\nAuthors:\n Jonathan Winandy\nJonathan est ingénieur Data et co-­fondateur de Valwin.\n\nIl a travaillé dans différents contextes, MOA/MOE, développeur Java/Scala/Clojure pour des éditeurs/startups, architecte de plateformes distribuées. Au cours de son expérience professionnelle, Jonathan s’est spécialisé dans l’analyse de sources de données pour faciliter la construction d’entrepôt de données.\n\nIl présente régulièrement des sujets d’actualité lors de conférence et organise Scala.IO, conférence européenne autour du langage Scala.\n\n Alexis Guéganno\nDirecteur des opérations chez Valwin, je suis en charge de la coordination et de la robustesse de nos développements informatiques. Ma passion pour l'informatique se traduit par ma volonté de fournir des solutions fiables et efficaces à des problèmes complexes.",
    "favorite": "0",
    "length": "57:06",
    "likes": "1",
    "recorded": "2015-04-09",
    "speakers": ["jonathan-winandy", "alexis-gueganno"],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gr0bfB4oIFI/hqdefault.jpg",
    "title": "Streaming/Kafka Avancé",
    "videos": [
        {
            "code": "gr0bfB4oIFI",
            "type": "youtube"
        }
    ],
    "views": "193"
}