{
    "description": "On sait tous aujourd’hui quelles sont les préconisations pour faire des beaux sites (applications web) responsives, maintenables, disponibles dans les plus brefs délais. Mais savez vous comment nos navigateurs peuvent nous aider à optimiser ces applications ? Ce tools in Action sera fait sous forme de live coding et je vous montrerais comment Chrome ou Firefox peuvent vous aider à optimiser / tester vos sites / applications\n\n\nAuthors:\njean-francois Garreau\nJe suis développeur depuis maintenant 10 ans. J'ai toujours évolué dans un monde java et j'ai découvert Android en 2009 avec la version 1.1. Depuis, je continue de suivre les évolutions de la plateforme. Depuis maintenant an et demi j'ai commencé à m'interesser plus en profondeur au Web avec des sujets comme AngularJS / WebRTC / WebSockets.\n\nChez SQLI depuis 2012, je suis présent pour développer l'offre mobile au sein de l'agence de Nantes.\n\nEn dehors du travail, je suis co-fondateur du GDG Nantes, organisateur du DevFest Nantes et est aussi le créateur d'applications Android\n\nRetrouvez l'ensemble de mes contributions sur https://github.com/jefBinomed\n\n Julien Landuré\nJulien a côtoyé plusieurs SSII avant d'intégrer Zenika. Aujourd'hui CTO de Zenika Nantes, il navigue entre des missions de formation (AngularJS, Dart, AppEngine) et d'architecture. Issu de la génération Google, il a co-fondé en Janvier 2011 le GDG Nantes et participent depuis 4 ans au Google I/O et à maintenir une communauté de développeurs.",
    "favorite": "0",
    "length": "32:06",
    "likes": "5",
    "recorded": "2016-06-08",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/iOZFFCOVgrA/hqdefault.jpg",
    "title": "Tour d’horizon des outils pour être un développeur web productif",
    "videos": [
        {
            "code": "iOZFFCOVgrA",
            "type": "youtube"
        }
    ],
    "views": "1060"
}