{
    "description": "À partir d’une feuille blanche, vous devez construire une application financière hautement disponible. Elle doit être résiliente, scalable et facilement extensible. Comment faire ? Nous allons relever le défi en partant des principes d’une architecture réactive basée sur des micro-services.Nous vous proposons d’étudier toutes les problématiques adressées lors de la mise en place de l’application, en passant de l’environnement de développement aux conditions d’exploitations dans le cloud.\n\n\nAuthors:\nNicolas Jozwiak\nNicolas Jozwiak est un ingénieur d'études confirmé disposant de 5 ans d'expérience de conception et développement sur technologies Java/JEE. Son parcours chez un éditeur avant son entrée chez Xebia lui a notamment permis de développer de solides compétences dans le domaine de la qualité et de l’industrialisation (tests, intégration continue, gestion de configuration, contrôle qualité). \n\n Xavier Bucchiotty\nXavier est un développeur passionné Java/Scala chez Xebia. Il développe avec Java depuis bientôt 10 ans. Puis, il a découvert Akka et Scala en conférence il y a deux ans. Depuis, il ne cesse de creuser le sujet et de partager son enthousiasme sur cet écosystème, aussi bien en interne qu'en conférence. Cela lui permet notamment d'apporter de nouvelles solutions aux défis techniques qui lui sont posés aujourd'hui.\n\nAdepte des méthodes agiles, il est aussi un fervent défenseur des pratiques XP.\n\n\nVincent Spiewak\n#java #maven #ria #cloud #agile #scrum #accessibility #daisy #ooo #foss #geek #salsa #movies",
    "favorite": "0",
    "length": "03:02:55",
    "likes": "0",
    "recorded": "2015-04-08",
    "speakers": [
        "nicolas-jozwiak",
        "xavier-bucchiotty",
        "vincent-spiewak"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/kgeI0JTak90/hqdefault.jpg",
    "title": "Trois heures à l’assaut d’une application réactive",
    "videos": [
        {
            "code": "kgeI0JTak90",
            "type": "youtube"
        }
    ],
    "views": "183"
}