{
    "description": "La conception d'un news feed implique des problématiques techniques complexes : temps de réponse, volumétrie, agrégation, scoring, filtrage du bruit.Comment proposer à chaque utilisateur de Viadeo l'actualité de leur réseau personnalisé en quelques dizaines de millisecondes ?Découvrez comment les possibilités offertes par Elasticsearch et notre plateforme événementielle nous permettent de générer et servir quotidiennement des millions de news feed pour chacun de nos utilisateurs.\n\n\nAuthors:\n Greg Truchetet\nSoftware Engineer @ Viadeo, j'interviens sur la partie dédiée aux membres. (B2C)\n\nPassé par Thales et Airbus Defence & Space avant d'arriver dans le web, je m'intéresse à toutes sortes de techniques et technologies afin de répondre au mieux aux différents challenges auxquels nous sommes confrontés dans notre vie quotidienne.\n\nBien qu'ayant un profil technique, j'ai une sensibilité toute particulière pour le produit ce qui m'amène à dépasser mon rôle de 'tech guy'.\n\nViadeo : fr.viadeo.com/fr/profile/gregory.truchetet\n\nFabrice Robini\nEngineering Manager chez Viadeo, en charge des produits B2C. 9 ans d'expérience dans le delivery agile, les architectures JEE & Web.\n\nJ'accompagne les équipes à délivrer des produits de qualité. Plus vite, en mieux :)\n\nJe suis intervenu en tant que Teach-Lead, Architecte et Coach chez des clients majeurs du secteur Média, Internet et Loisirs. J'ai participé en tant que speaker aux conférences suivantes : Devoxx (B.O.F), USI, GrailsExchange, ParisJUG, ChtiJUG.\n\nhttps://www.viadeo.com/fr/profile/fabrice.robini\n\nQuentin Suire\nSoftware Engineer @ Viadeo\n\nJe participe activement à la réalisation des nouveaux produits : de leur conception à leur mise en production, en passant par le développement et le monitoring.\n\nJe m'intéresse de très près au mouvement devops, mais aussi au machine learning et à la robotique.\n\nhttps://www.viadeo.com/fr/profile/quentin.suire",
    "favorite": "0",
    "length": "37:22",
    "likes": "1",
    "recorded": "2015-04-10",
    "speakers": [
        "greg-truchetet",
        "fabrice-robini",
        "quentin-suire"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/M6_HfGTIK3I/hqdefault.jpg",
    "title": "Un News Feed temps réel personnalisé pour 65 millions d’utilisateurs",
    "videos": [
        {
            "code": "M6_HfGTIK3I",
            "type": "youtube"
        }
    ],
    "views": "31"
}