{
    "description": "L'expérience utilisateur est un problème trop sérieux pour le confier à des graphistes ! Une bonne (ou une mauvaise) ergonomie ne se détermine pas en conception : à ce moment, il est déjà bien trop tard.L'UX, c'est d'abord une affaire de mots : de bonnes (ou de mauvaises !) questions posées aux utilisateurs et des réponses formulées avec précision.Où l'on apprend qu'une User Story (ou un Cas d'Utilisation) mal intitulée peut mutliplier par quatre le nombre d'écrans et qu'entre un \"un\" et un \"mon\", il y a trois clicks de souris... et que même une démarche agile peinera à rectifier ce qui se décide dès la Vision projet.\n\n\nAuthor:\nGrégory Weinbach\nGrégory développe du logiciel depuis plus de vingt ans. Tantôt du côté de l'outillage (avec des incursions remarquées du côté de la génération de code), tantôt du côté de l'utilisateur (il pratique la modélisation agile et le Domain Driven Design), ou du développeur (coder reste un de ses plaisirs), il cultive la polyvalence de son expertise.\nIl aime prendre du recul par rapport aux pratiques à la mode, qu'elles se nomment agilité, MDA, SOA, ou Software Craftsmanship.\nSa question favorite est \"pourquoi ?\", juste avant de chercher \"comment ?\".\nSpeaker pour des publics variés (du Paris JUG aux cinq éditions du MDDay), Grégory anime régulièrement des séminaires pour ses clients et des formations pour sa société, Objet Direct.",
    "favorite": "0",
    "length": "43:19",
    "likes": "1",
    "recorded": "2015-04-09",
    "speakers": [
        "gregory-weinbach"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/AZBCFFBWtBA/hqdefault.jpg",
    "title": "UX : le Poids des Mots...",
    "videos": [
        {
            "code": "AZBCFFBWtBA",
            "type": "youtube"
        }
    ],
    "views": "115"
}