{
    "description": "http://www.drupaltrainingday.nl/\nhttps://amsterdam2014.drupal.org/community-summit\nhttps://www.drupal.org/user/787250\nPresentation:\nhttp://drupalonderwijs.nl/t-dose2014/index.html#/\nDrupalonderwijs bottom up platform for educators:\nhttp://drupalonderwijs.nl\ne-learning test platform\nhttp://lms.drupalonderwijs.nl\n\nT-dose 2014 Playlist:\nhttps://www.youtube.com/playlist?list=PLBZBIkixHEidJ05uKM6orHYps0A0uNQ94\n\n26 10 2014\nT-Dose 2014, Open Singularity, Education & Drupal, Floris van Geel \n\nby 040lab\n\nOn friday 26th of september we've organised DrupalTrainingDay that is currently fully booked with 260 students and 10 teachers.\nThe feedback of track5 (teachers) at http://drupaltrainingday.nl/ will be included. As well as our methods.\n\nThis presentation will inform and compare four open source educational distributions built in the Drupal 7 CMS.\n\n+ Julio : targeted for schools, school districts, small colleges, and academic departments within universities.\n+ OpenScholar : Thousands of easy maintainable and personal research sites, created by Harvard university. A single OpenScholar install hosts thousands of easy, self-service, custom websites. Features multiple domain names, dozens of built-in themes, drag-and-drop layout, best-practice presets and \"apps\" that solve virtually every use case.\n+ OpenAcademy : Web publishing for higher education and university. A flexible, extendable package that lets university departments run fully functional, polished websites straight out of the box. Critical features are provided for handling courses, research publications and presentations, departmental news, faculty profiles, events and more.\n+ ELMS Learning Network : A modular approach of educational distributions with specific tasks linked around a central Course Information System (CIS) by web services like :\n--Massively Open Online Course (MOOC)\n--Collaborative learning environment (CLE)\n--Interactive Course Object Repository (ICOR)\n--ELMS media\n\nNot only will this presentation help to integrate Open Source in the Educational landscape and facilitate educators to make informed discussions. Also the results of the of the workshop at the Community Summit at Drupalcon 2014 Amsterdam will be shared.\nhttps://amsterdam2014.drupal.org/community-summit\n\nThe bigger picture is to create a generic knowledge repository on how to utilize the Drupal Content Management Framework both in the curriculum by using it as a “testbed” for educational purposes and using the advanced CMS featureset it offers to publish and share knowledge between students, teachers and other stakeholders.\n\nThis knowledge repository will be formalized in the Drupal Onderwijs collaboration platform, which will include information on best practices, turnkey solutions for educational facilities and sharing information on how to use Drupal to empower your organization to offer optimal communication tools to your students and teachers.\n\nT-DOSE is a free and yearly event held in The Netherlands to promote use and development of Open Source Software. During this event Open Source projects, developers and visitors can exchange ideas and knowledge. This years event will be held on 25 and 26 October 2014 at the Fontys University of Applied Science in Eindhoven.\nKernel.\n\nHope to see you all and that you have a great time.\n\nFloris van Geel\n\nFloris is a Drupal Entrepreneur and open source enthusiast based in Eindhoven, Netherlands.\nAt 040Lab we have a great time inventing new solutions and making clients happy\nD.O user https://www.drupal.org/user/787250",
    "favorite": "0",
    "length": "35:22",
    "likes": "2",
    "recorded": "2014-10-25",
    "speakers": [
        "floris-van-geel"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/M40yOrOAnBc/hqdefault.jpg",
    "title": "Open Singularity, Education & Drupal",
    "videos": [
        {
            "code": "M40yOrOAnBc",
            "type": "youtube"
        }
    ],
    "views": "120"
}