{
    "description": "More then a year after Snowden we find ourselves in very dynamic times. We have seen an audio recording leaked between the foreign minster of Estonia (?) and EU representative about the shot down Malaysian plane. Belgium has leaked critical information to the Russians during a negotiation of new gas contracts between the EU and Russia. All the while China is building their own operating system (sort of Red Flag 2.0) to minimize the spying. We also recently heard of companies selling cell phone locating software to anybody who can afford it.\n\nAt the mean time, we get more and more used to the convenience of cell phones or as Eben Moglen calls them spying devices. This is completely understandable since they can really be useful.\n\nWe need to do more.\n\nThe EU needs to realize that foreign affairs, energy politics and digital sovereignty are all the same. The EU needs to be an independent actor in all these fields. If we are dependent on others in just one of those fields, the others will follow soon.\n\nWe as a software develop community are the key players in the next ten years. We have not chosen this task and we sure don't want it. But frankly it's up to us. We are it. No one else is coming to change the world or is able to, so we need to do it. We need more software to securely chat, browse and email. Mostly in the mobile sector. We need this tech to be simple and easy to use.\n\nWe can only reach digital sovereignty in the EU and make secure communications possible if we build good and usable free software (FS). FS makes it possible to inspect the source code. It makes it possible to update quickly. It makes it possible to learn and adapt immediately when necessary. It causes a heterogeneous environment where a lot of different tools solve the same problem. And it makes sure the software stays that way. It will thus make the EU a safer and better place.\n\nMaurice is an electrical engineer and has a master degree in Innovation Management. He is currently the team coordinator of the Free Software Foundation Europe in the Netherlands. He works for AT Computing in Nijmegen.\n\nT-DOSE is a free and yearly event held in The Netherlands to promote use and development of Open Source Software. During this event Open Source projects, developers and visitors can exchange ideas and knowledge. ",
    "favorite": "0",
    "length": "32:22",
    "likes": "1",
    "recorded": "2014-10-25",
    "speakers": [
        "maurice-verheesen"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/_2GsjF0UQ6k/hqdefault.jpg",
    "title": "Digital Sovereignty For Europe",
    "videos": [
        {
            "code": "_2GsjF0UQ6k",
            "type": "youtube"
        }
    ],
    "views": "96"
}