{
    "description": "Code4Prosperity, free and open software development community for a sustainable prosperity\n\nCode4Prosperity (C4P) is a Weconomics Foundation (WF) IT project to improve the productivity of information workers and redistribute the surplus time for an affordable and eventually sustainable prosperity. C4P is a project to start a worldwide developer’s community for free and open source application developers on level 6 in the Weconet Data Ecosystem (see figure 1) C4P developers believe in sharing economy and the or-ganization of a sustainable prosperity. Application developers and Weconomics partners (account managers, fellows, domain leaders, network leaders etc.), will work together to improve the productivity of information workers; not only within the borders of bureau-cratic institutes or nontransparent markets, but also with new organizations that work with new organization forms based on concepts such as hybrid organizing.\n\nPaul Bessems is pioneer, writer, researcher and strategic consultant. He has over 25 years experience in new organizational forms and is particularly expert in the field of hybrid organizing. Hybrid organizing is a crossing between: do it yourself and contracting out, between firm and market. It is a, fundamentally, new organization form that is both scalable and flexible. Hybrid organizing is suitable for the organization of, for example, shared information networks, supra shared service centers, communities and cooperatives. These forms play an important role in the network economy.\n\nBesides his work as a consultant, he is also chairman of the Weconomics Foundation. This foundation contributes to the organization of a sustainable prosperity by focusing on the productivity improvement of knowledge workers and redistribution of the surplus time. Finally, he is founder and thought leader of The Institute for New Organizational Thinking.\n\nAccording to Paul, the most important innovation for the 21st century is not a technical innovation, but the production and redistribution of surplus time. When our productivity doubles, the afternoon will be available for tasks that really matters to us and our wellbeing.\n\nPaul studied management science at the TUE. In 1992 he introduced the Harvard Case Method in the Netherlands and in other developed a master program with the University of Humberside Hull. In 1994 he started the Course Catalog, his first professional community. In 2005 he founded the Weconomics Foundation and in 2013 The Institute for New Organizational Thinking. Now he works as an independent management consultant for (international), often knowledge-intensive, companies, institutions and governments. He also wrote five books in the field of Weconomics and is co-author of three other books in this field.\n\nFor a more detailed description and resume see: http://www.paulbessems.com\n\n\nT-DOSE is a free and yearly event held in The Netherlands to promote use and development of Open Source Software. During this event Open Source projects, developers and visitors can exchange ideas and knowledge.",
    "recorded": "2014-10-25",
    "speakers": [
        "paul-bessems"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Qyr7l_5QJTM/hqdefault.jpg",
    "title": "Code4Prosperity, free and open software development community",
    "videos": [
        {
            "code": "Qyr7l_5QJTM",
            "type": "youtube"
        }
    ]
}