{
    "description": "The \"Internet of Things\" Opportunities and Dangers, Felix Stegerman.\n\nThe \"Internet of Things\" is around the corner. What does this mean\nfor us as software developers? And what are the dangers and\nopportunities when it comes to Freedom, Privacy and Security?\n\nWe live in interesting times. The time that a \"computer\" was a room\nfull of electronics, or even a beige box on a desk is behind us.\nComputers are everywhere. And there will soon be even more of them,\nin even more places.\n\nThe IoT provides us with wonderful opportunities to remotely monitor,\nmanage and automate. And we as a software development community are\nthe ones building it.\n\nBut security is too often an afterthought (if that). Now that the IoT\nis around the corner, security is not just something that impacts\nthose beige boxes on our desks -- or the smartphones we carry around\n-- but also the medical devices that monitor our health and keep us\nalive, the automobiles we drive, the electronics that monitor our\nhomes, and the public infrastructure we depend on. It now impacts\npublic safety, human life, privacy, freedom and democracy.\n\nWho is responsible for making sure the systems and devices that make\nup the IoT are under the control of their users? Whether we like it\nor not, the responsibility for ensuring freedom, privacy, security,\nand (digital) civil rights rest on our shoulders. So instead of\nasking ourselves (as we usually do) \"can we do this?\", we should ask\nourselves \"should we do this?\n\nWe need development practices that take security into account. We\nneed to build systems that are secure from the ground up. And we need\nFree Software to make sure that the answer to \"who controls our\ncomputers?\" -- including the IoT -- is \"the users\".\n\nBut we also need relevant authorities to ensure policies and laws\nmandate privacy and security and ensure open standards. And we need\npublic awareness of the impact of the IoT on -- and the importance of\n-- privacy and security.\n\nThe IoT is on its way. It's up to us to build it right. And to have\nlots of fun along the way.\n\nFelix Stegerman is Deputy Coordinator Netherlands (and member of the\nEuropean Core Team) for the Free Software Foundation Europe. He also\nvolunteers at Bits of Freedom's Privacy Café. His interests include\nPrivacy, Security, Free Software, Freedom and (Digital) Civil Rights;\nas well as Mathematics, Computer Science and Software Development.\n\nT-DOSE is a free and yearly event held in The Netherlands to promote use and development of Open Source Software. During this event Open Source projects, developers and visitors can exchange ideas and knowledge.",
    "recorded": "2014-10-25",
    "speakers": [
        "felix-stegerman"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/TdsA8yDgVos/hqdefault.jpg",
    "title": "The 'Internet of Things' Opportunities and Dangers",
    "videos": [
        {
            "code": "TdsA8yDgVos",
            "type": "youtube"
        }
    ]
}