{
    "description": "http://www.CityTV.nl\nhttp://www.t-dose.org\nPlaylist:\nhttps://www.youtube.com/playlist?list=PLBZBIkixHEidJ05uKM6orHYps0A0uNQ94\n\n25102014\nT-Dose 2014, The why, what and how of owning your own data, Jos Poortvliet.\n\nCloud has been a revolution. We access our data wherever we are via web interface, apps on mobile devices or desktop and share and communicate via services like twitter, flickr, imgur, facebook, pinterest... The Cloud makes life easier and more fun.\n\nIs this data available to government? Absolutely. Can advertisers mine it? Oh yes. Is it available to anybody with money? Probably. Can hackers get to it? Not unlikely. It is all in one or a few places: easy to demand access to for the government, to be bought by companies or stolen by thieves.\n\nThink about this: The government knows your political opinions. Your insurance knows your medical history and what you do in your free time. Your bank knows you didn't finish your study. A potential employer knows if your wife wants to get pregnant.\n\nThis is not how the internet was designed. It was meant to be a place where data was everywhere, not stored in a few locations. Federation would be the norm, not the exception.\n\nWe need to find and build solutions to get our privacy back, bring our data home. I will present one such a solution: ownCloud. ownCloud\n\nWith ownCloud you can sync & share your files, calendar, contacts and more. Access your data from all your devices, on an open platform you can extend and modify. You determine how your private data is shared. Your data – under your control.\n\nJos Poortvliet works as community manager for ownCloud and has been Free Software evangelist for over 10 years. He has been community manager at SUSE Linux before and volunteers in the KDE community in the marketing work group, writing, coordinating, talking to press and visiting conferences. His favorite pastime besides Free Software is experimenting in the kitchen, trying to come up with something edible.\n\nT-DOSE is a free and yearly event held in The Netherlands to promote use and development of Open Source Software. During this event Open Source projects, developers and visitors can exchange ideas and knowledge. This years event will be held on 25 and 26 October 2014 at the Fontys University of Applied Science in Eindhoven.\nKernel.",
    "favorite": "0",
    "length": "54:29",
    "likes": "2",
    "recorded": "2014-10-25",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/L3zvPH-WKss/hqdefault.jpg",
    "title": "T-Dose 2014, The why, what and how of owning your own data, Jos Poortvliet",
    "videos": [
        {
            "code": "L3zvPH-WKss",
            "type": "youtube"
        }
    ],
    "views": "183"
}