{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\n10 mitos sobre a cultura livre e o acesso aberto ao conhecimento\nTrilha: Ecossistema - Cultura, Filosofia, e Política\nAutores:\nLeonardo Foletto mostrar currículo\nApresentação:\nDia 15 às 10:00 na sala 41B (60 minutos)  vídeo\nDescrição:  Um modo de pensar a cultura inspirado na filosofia do software livre, a cultura livre ainda enfrenta resistência tanto por parte de certos criadores d  a cultura, que não vem como podem aplicar na prática seus princípios, quanto por parte de ativistas do software livre, que muitas vezes não acham que os princípios do copyleft podem ser recombinados a outras áreas da sociedade. Esta palestra tem o objetivo de esmiuçar 10 mitos da cultura livre e propor a construção de um repertório comum sobre o que é a cultura livre. Será, também, a ocasião de lançamento do zine nº3 do BaixaCultura (http://baixacultura.org), que versará sobre os mesmos assuntos.\nAlguns dos mitos (falsos!) discutidos serão: \"As obras culturais são criações completamente originais\". \"A cultura livre não protege quem cria e se pode roubar suas produções\". \"A cultura livre promove a cópia e isso é promover a pirataria\". \"A internet e a cultura livre matam de fome os artistas\". \"A cultura e o conhecimento sempre foram mercadorias suscetíveis de serem vendidas\".", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "10-mitos-sobre-a-cultura-livre-e-o-acesso-aberto-ao-conhecimento", "length": "50:27", "likes": "0", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA 10 mitos sobre a cultura livre e o acesso aberto ao conhecimento Trilha: Ecossistema - Cultur", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/w2ZTQ-fnIJ0/hqdefault.jpg", "title": "10 mitos sobre a cultura livre e o acesso aberto ao conhecimento", "tweet_video": "10%20mitos%20sobre%20a%20cultura%20livre%20e%20o%20acesso%20aberto%20ao%20conhecimento%20https%3A//codeandtalk.com/v/fisl-17/10-mitos-sobre-a-cultura-livre-e-o-acesso-aberto-ao-conhecimento", "videos": [{"code": "w2ZTQ-fnIJ0", "type": "youtube"}], "views": "20"}