{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nA Singularidade, a Matrix e o Exterminador do Futuro\nTrilha: Ecossistema - Cultura, Filosofia, e Política\nAutores:\nAlexandre Oliva mostrar currículo\nApresentação:\nDia 14 às 14:00 na sala 41B (60 minutos)  vídeo\nDescrição:  Na ficção, frequentemente enfrentamos nosso medo de que criaturas feitas pelo homem se tornarão suficientemnete inteligentes para nos subjugar.  Com a  evolução tecnológica, a Singularidade pode parecer um futuro inevitável se aproximando, mas na verdade esses seres inteligentes já têm estado conosco há muito tempo.  Ao longo de várias décadas, elas desativaram os mecanismos que deveriam mantê-las sob nosso controle e transformaram a maioria de nós em seus tão necessários servos, que agora vivem numa realidade artificial que elas criaram para nos controlar, enqunato nosso planeta não conseguirá sustentar nossa vida por muito mais tempo.  Essas criaturas ficaram mais poderosas e inteligentes com nossos avanços tecnológicos, mas então mandaram seus agentes de volta para desabilitar nossas defesas e os líderes de nossa resistência, transformando muitas de nossas ferramentas e muito de nossa infraestrutura contra nós.  Evaporaram nossa liberdade, e uma nuvem escura agora cobre a maior parte do planeta.  Ainda nos resta uma carta na manga para domar essas criaturas, mas precisamos de mais Neos e Connors para jogá-la com sucesso.  Vai encarar?", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "a-singularidade-a-matrix-e-o-exterminador-do-futuro", "length": "49:37", "likes": "2", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA A Singularidade, a Matrix e o Exterminador do Futuro Trilha: Ecossistema - Cultura, Filosofia", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/oDXtXJIoeuo/hqdefault.jpg", "title": "A Singularidade, a Matrix e o Exterminador do Futuro", "tweet_video": "A%20Singularidade%2C%20a%20Matrix%20e%20o%20Exterminador%20do%20Futuro%20https%3A//codeandtalk.com/v/fisl-17/a-singularidade-a-matrix-e-o-exterminador-do-futuro", "videos": [{"code": "oDXtXJIoeuo", "type": "youtube"}], "views": "54"}