{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nAcelerando a entrega de aplicações com Atomic Host, Docker e Cockpit\nTrilha: Administração - Administração de Sistemas\nAutores:\nAlessandro de Souza e Silva mostrar currículo\nApresentação:\nDia 16 às 14:00 na sala 41F (60 minutos)  vídeo\nDescrição:  O problema dominante no mercado de tecnologia nos dias de hoje é o atrito entre a linha de negócios e a operação de TI. O negócio está preocupado com    a diferenciação no mercado, entregando melhores aplicações e serviços aos seus clientes, sempre à frente de seus concorrentes. Por outro lado, a operação, preocupa-se  com a disponibilidade, segurança e conformidade. Normalmente, há uma divergência entre esses dois grupos, porque os desenvolvedores querem agilidade para entrega de aplicações. Eles querem ser livres para usar os recursos mais recentes e sem limitações de tecnologias, mesmo que esses recursos não estejam disponíveis no catalogo de serviços. Os contêineres agilizam a entrega de aplicações. Eles são leves, rápidos, e fornecem uma alternativa de baixo custo em relação as máquinas virtuais. Eles podem ser executados em todos os lugares (escritório, datacenter, nuvem...).  O objetivo dessa palestra é apresentar o Atomic Host, o Docker e o Cockpit, e demonstrar como essa solução poderá ajudá-los a acelerar a entrega de aplicações corporativas. Com essa solução, a equipe de operações e desenvolvedores poderão trabalhar em conjunto para dar mais agilidade e atender as expectativas do negócio. Através de uma apresentação terória e posteriormente uma demo, Administradores de Sistemas e Desenvolvedores, serão capazes de entender como criar seus contêineres, hospedá-los e orquestrá-los. Gestores de TI terão uma visão mais profunda sobre como  gerenciar o seu workload, melhorar a eficiência operacional e reduzir custos na entrega de aplicações corporativas.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "acelerando-a-entrega-de-aplicacoes-com-atomic-host-docker-e-cockpit", "length": "53:47", "likes": "0", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA Acelerando a entrega de aplicações com Atomic Host, Docker e Cockpit Trilha: Administração - ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/9sYoR05pAc0/hqdefault.jpg", "title": "Acelerando a entrega de aplicações com Atomic Host, Docker e Cockpit", "tweet_video": "Acelerando%20a%20entrega%20de%20aplica%C3%A7%C3%B5es%20com%20Atomic%20Host%2C%20Docker%20e%20Cockpit%20https%3A//codeandtalk.com/v/fisl-17/acelerando-a-entrega-de-aplicacoes-com-atomic-host-docker-e-cockpit", "videos": [{"code": "9sYoR05pAc0", "type": "youtube"}], "views": "22"}