{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nAcessibilidade Web - O Estado da Arte\nTrilha: Desenvolvimento - Ferramentas, Metodologias e Padrões\nAutores:\nLael Nervis\nApresentação:\nDia 13 às 18:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Nesta palestra apresentarei dicas de como fazer um site acessível, técnicas de codificação, tendências, tecnologias disponíveis, projetos Open Source   que podem auxiliar no desenvolvimento, testes automatizados de acessibilidade, ferramentas que auxiliam no desenvolvimento web acessível, entre tantos outros itens que vão mostrar o quão simples hoje em dia é de se fazer um site acessível.\n\nDe acordo com o W3C (World Wide Web Consortium), Acessibilidade na Web significa garantir que todas as pessoas, incluindo pessoas com deficiência, possam utilizar a Web. Mais especificamente, significa permitir que pessoas com deficiência consigam perceber, compreender, navegar, interagir e contribuir com a Web. Uma Web acessível beneficia a todos, incluindo pessoas idosas, pessoas com pouca habilidade em utilizar a Web, aqueles com uma conexão mais lenta, entre outros.\n\nSegundo o censo de 2010, 17% da população brasileira possui alguma deficiência. Se os sites não forem projetados para que essas pessoas possam acessar, navegar e compreender, estarão excluindo então uma parcela significativa da população brasileira do acesso às informações veiculadas na internet.\n\nO computador e a Internet representam um enorme passo para a inclusão de pessoas com deficiência, promovendo autonomia e independência. Muitas vezes, a deficiência não é severa o suficiente a ponto de tornar-se uma barreira à utilização do computador. Entretanto, na maioria das páginas da Web, as pessoas cegas ou com baixa visão, pessoas com deficiência auditiva, com dificuldade em utilizar o mouse, por exemplo, encontram barreiras de acessibilidade que dificultam ou impossibilitam o acesso aos seus conteúdos.\n\nPor isso, um sítio desenvolvido considerando a acessibilidade deve englobar diferentes níveis de escolaridade, faixa etária e pouca experiência na utilização do computador, bem como ser compatível com as diversas tecnologias utilizadas para acessar uma página da Web.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "acessibilidade-web-o-estado-da-arte", "length": "45:13", "likes": "0", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA Acessibilidade Web - O Estado da Arte Trilha: Desenvolvimento - Ferramentas, Metodologias e P", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/fcWtG6BpoxI/hqdefault.jpg", "title": "Acessibilidade Web   O Estado da Arte", "tweet_video": "Acessibilidade%20Web%20%20%20O%20Estado%20da%20Arte%20https%3A//codeandtalk.com/v/fisl-17/acessibilidade-web-o-estado-da-arte", "videos": [{"code": "fcWtG6BpoxI", "type": "youtube"}], "views": "13"}