{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nAntes e depois de Python: minhas linguagens favoritas\nTrilha: Desenvolvimento - Linguagens de programação\nAutores:\nLuciano Ramalho mostrar currículo\nApresentação:\nDia 15 às 17:00 na sala 41A (60 minutos)  vídeo\nDescrição:  Em 38 anos de programação trabalhei com várias linguagens, até encontrar Python e ficar mais tempo com ela do que com qualquer outra até hoje. Agora q  ue finalmente terminei de escrever o Python Fluente, estou ativamente pesquisando novas linguagens. Esta palestra é um panorama de linguagens que quero usar no curto prazo, e uma reflexão sobre outras que eu já usei ou continuo usando.\n\nEsta será uma apresentação bastante subjetiva porque linguagens de programação são produtos culturais, como músicas, filmes e livros. Discussões interessante sobre produtos culturais se dão no plano da estética -- o domínio da beleza e dos gostos pessoais.\n\nFatores técnicos podem no máximo vetar esta ou aquela linguagem em um determinado projeto. Mas uma linguagem de programação é uma interface entre pessoas e máquinas. E a escolha da \"melhor\" interface sempre será subjetiva. Pode perguntar para quem usa vi ou Emacs.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "antes-e-depois-de-python-minhas-linguagens-favoritas", "length": "52:55", "likes": "3", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA Antes e depois de Python: minhas linguagens favoritas Trilha: Desenvolvimento - Linguagens de", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/-AUmMlu-j_w/hqdefault.jpg", "title": "Antes e depois de Python minhas linguagens favoritas", "tweet_video": "Antes%20e%20depois%20de%20Python%20minhas%20linguagens%20favoritas%20https%3A//codeandtalk.com/v/fisl-17/antes-e-depois-de-python-minhas-linguagens-favoritas", "videos": [{"code": "-AUmMlu-j_w", "type": "youtube"}], "views": "48"}