{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nCache do nginx para APIs (entendendo e controlando)\nTrilha: Administração - Administração de Sistemas\nAutores:\nHelber Maciel Guerra mostrar currículo\nApresentação:\nDia 14 às 13:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Fazendo o uso do cache do nginx, podemos ter melhoria de desempenho de APIs restful e conteúdos de 1000X ou mais. Mas como ter controle do que está no  cache e se este conteúdo é coerente com o que está no backend?\nCom sistemas de cache utilizando nginx, geralmente são baseados em tempo, mas muitas vezes ao fazer modificações nos dados, seria muito bom que este cache fosse invalidado no momento da modificação.\nVamos entender o funcionamento e analisar alternativas à invalidação de cache por expiração temporal, e fazer controle invalidação de cache em granularidade de requisição.\nVamos ver um exemplo utilizando signals do framework web django, para fazer a limpeza do cache ao haver uma modificação de conteúdo e invalidado cache mesmo de usuário autenticado, deixando intacto o cache de outro usuário.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "cache-do-nginx-para-apis-entendendo-e-controlando", "length": "50:42", "likes": "0", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA Cache do nginx para APIs (entendendo e controlando) Trilha: Administração - Administração de ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/PXN8AcrOvTg/hqdefault.jpg", "title": "Cache do nginx para APIs entendendo e controlando", "tweet_video": "Cache%20do%20nginx%20para%20APIs%20entendendo%20e%20controlando%20https%3A//codeandtalk.com/v/fisl-17/cache-do-nginx-para-apis-entendendo-e-controlando", "videos": [{"code": "PXN8AcrOvTg", "type": "youtube"}], "views": "23"}