{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nCVsP++ release 4.5 - Como viver sem o Photoshop\nTrilha: Desktop - Aplicações Desktop\nAutores:\nElias de Carvalho Silveira mostrar currículo\nApresentação:\nDia 14 às 13:00 na sala 41A (60 minutos)  vídeo\nDescrição:  Relata de forma descontraída sua trajetória como ilustrador, desde os primórdios de sua existência, até chegar ao uso do Photoshop e em seguida a migr ação para o uso do Gimp (GNU Image Manipulation Program), solução gráfica livre alternativa ao Adobe Photoshop® na produção de ilustrações digitais para as editoras de revistas nacionais, mercado ainda fortemente dominado pelo uso de softwares proprietários. Trabalhando atualmente com softwares livres, mantendo o mesmo padrão de qualidade no desenvolvimento do seu trabalho como ilustrador, mostra o uso do software livre como ótima alternativa, buscando quebrar este paradigma de \"photoshops\" e \"corels\". Tem como finalidade estimular o uso crescente dos softwares livres, tecnologias e padrões abertos, a difusão da filosofia de compartilhamento e criação colaborativa. Almeja fomentar uma discussão sobre a utilização de softwares livres para ilustração, um convite aos profissionais do meio para que experimentem estas ferramentas e ajudem a aprimorá-las.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "cvsp-release-4-5-como-viver-sem-o-photoshop", "length": "48:56", "likes": "1", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA CVsP++ release 4.5 - Como viver sem o Photoshop Trilha: Desktop - Aplicações Desktop Autores:", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/hPDPM6fhjxI/hqdefault.jpg", "title": "CVsP++ release 4 5   Como viver sem o Photoshop", "tweet_video": "CVsP%2B%2B%20release%204%205%20%20%20Como%20viver%20sem%20o%20Photoshop%20https%3A//codeandtalk.com/v/fisl-17/cvsp-release-4-5-como-viver-sem-o-photoshop", "videos": [{"code": "hPDPM6fhjxI", "type": "youtube"}], "views": "12"}