{"description": "O caminho do suShellso\nTrilha: Desenvolvimento - Linguagens de programação\nAutores:\nJulio Cezar Neves\nApresentação:\nDia 13 às 14:00 na sala 41A (60 minutos)\nDescrição:  O Shell taí, bem debaixo do seu nariz... Sem ele não existiria o Linux, nem o Unix, ou seja, não existiria nenhum resquício de um Sistema Operacional   inteligente. E mesmo assim continua a olhá-lo com desdem, esforçando-se para ignorá-lo por completo, achando que o seu mousezinho te levará ao paraíso. Você está redondamente enganado!\nUsando mouse você só chega onde a interface gráfica permite, usando a tela preta, o seu Shell é o limite, ou seja, você pode utilizar absolutamente todos os recursos da máquina, desde que conheça bem o Shell.\nNesta palestra, totalmente mão na massa (ou hands on como preferem os almofadinhas de TI), mostrarei o quanto você está perdendo por não saber usar essa ferramenta maravilhosa, na qual grandes programas são feitos em poucas linhas.\nA palestra será desenvolvida de forma a apresentar as implementações do Bash 4 e mostrar o que há de mais moderno em interfaces gráficas para o Shell, que, acreditem, são fabulosas.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "fisl-17-o-caminho-do-sushellso", "length": "51:21", "likes": "12", "recorded": "2016-07-13", "short_description": "O caminho do suShellso Trilha: Desenvolvimento - Linguagens de programação Autores: Julio Cezar Neves Apresentação: Dia 13 às 14", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/F0CluhlSUXE/hqdefault.jpg", "title": "Fisl 17 - O caminho do suShellso", "tweet_video": "Fisl%2017%20-%20O%20caminho%20do%20suShellso%20https%3A//codeandtalk.com/v/fisl-17/fisl-17-o-caminho-do-sushellso", "videos": [{"code": "F0CluhlSUXE", "type": "youtube"}], "views": "213"}