{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nParticipação feminina no Fórum Internacional Software Livre\nTrilha: Ecossistema - Cultura, Filosofia, e Política\nAutores:\nJuliana Oliveira\nCintia Merces Souza mostrar currículo\nApresentação:\nDia 14 às 17:00 na sala 41D (60 minutos)  vídeo\nDescrição:  Considerado um dos maiores eventos do mundo, o Fórum Internacional Software Livre (FISL) é um evento que ocorre anualmente, há mais de 15 anos. Esse f órum tem proporcionado discussões técnicas, políticas, filosóficas e sociais sobre software livre. Parte considerável da programação é definida pela própria comunidade, que seleciona as melhores palestras em um sistema de torneio suíço. Por se tratar de um evento de natureza tecnológica, cujo perfil masculino ainda é marcante, e considerando o crescente movimento de motivação à participação feminina na Computação, faz-se necessário uma nova maneira de olhar para a própria conferência de modo a conhecer, reconhecer e destacar a participação feminina neste fórum ao longo dos anos. Nesse sentido, buscamos apresentar um meta-estudo sobre o perfil e o espaço de participação feminina no FISL, de modo que possamos levantar elementos para uma discussão acerca da presença feminina no fórum, a partir de dados das edições anteriores. O campo tecnológico, tradicionalmente marcado pela presença masculina, será abordado sob a ótica de participação da mulher não apenas como consumidora, mas como produtora de tecnologias livres. A análise a ser apresentada foi realizada a partir do levantamento e tabulação de dados disponíveis por meio de ferramentas livres. Serão apresentadas as ferramentas e técnicas utilizadas, além dos resultados da análise desses dados.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "participacao-feminina-no-forum-internacional-software-livre", "length": "41:58", "likes": "0", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA Participação feminina no Fórum Internacional Software Livre Trilha: Ecossistema - Cultura, Fi", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/mZEjnOuIZfU/hqdefault.jpg", "title": "Participação feminina no Fórum Internacional Software Livre", "tweet_video": "Participa%C3%A7%C3%A3o%20feminina%20no%20F%C3%B3rum%20Internacional%20Software%20Livre%20https%3A//codeandtalk.com/v/fisl-17/participacao-feminina-no-forum-internacional-software-livre", "videos": [{"code": "mZEjnOuIZfU", "type": "youtube"}], "views": "4"}