{"description": "Inscreva-se.\nhttps://goo.gl/NfsjjA\n\nScyllaDB: 1.8 milhão de requests por node\nTrilha: Administração - Bancos de Dados\nAutores:\nRaphael Santana Carvalho\nApresentação:\nDia 13 às 10:00 na sala 41E (60 minutos)  vídeo\nDescrição:  Scylla is a new NoSQL database that applies systems programming techniques to a horizontally scalable NoSQL design to achieve extreme performance impr  ovements. Scylla is capable of 2 million requests per second per node, while providing Apache Cassandra compatibility and scaling properties.  With extra performance to work with, NoSQL projects can have more flexibility to focus on other concerns, such as functionality and time to market. Scylla enables faster cluster scaling, more overhead to handle complex queries, and the power to do complex analytic tasks at the same time as routine administration operations.\n\nThe Scylla design is based on a modern shared-nothing approach.   As in operating system and relational database projects, a new architecture for the NoSQL server is necessary because of new growth in, and limitations of, modern server hardware. As CPU core counts continue to grow, along with the raw speed of networking and storage devices available on a modern system, software design approaches that were valid and safe even a few years ago are no longer sustainable. Scylla runs multiple engines, one per core, each with its own memory, CPU and multi-queue NIC.  The result is a NoSQL database with the resilience to support more challenging Big Data projects.", "event": {"name": "FISL 17", "nickname": "fisl-17", "twitter": "", "url": "http://softwarelivre.org/fisl17"}, "favorite": "0", "file_date": "2016-12-06", "filename": "scylladb-1-8-milhao-de-requests-por-node", "length": "48:44", "likes": "1", "recorded": "2016-07-13", "short_description": "Inscreva-se. https://goo.gl/NfsjjA ScyllaDB: 1.8 milhão de requests por node Trilha: Administração - Bancos de Dados Autores: Ra", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/xjzqdA6SXAI/hqdefault.jpg", "title": "ScyllaDB 1 8 milhão de requests por node", "tweet_video": "ScyllaDB%201%208%20milh%C3%A3o%20de%20requests%20por%20node%20https%3A//codeandtalk.com/v/fisl-17/scylladb-1-8-milhao-de-requests-por-node", "videos": [{"code": "xjzqdA6SXAI", "type": "youtube"}], "views": "11"}