{"description": "The range data type is a revolutionary new feature in PostgreSQL 9.2 that gives you the power to search and sieve over any data type that can be represented as a range (and very quickly too!). This talk provides a fundamental overview of range types, how to use them in Postgres, and applications and extensions that they provide.\n\nThe range data type is a revolutionary new feature in PostgreSQL 9.2 that gives you the power to search and sieve over any data type that can be represented as a range (and very quickly too!).\n\nAfter a brief mathematical refresher of what range types are and how they are represented, we will dive into the different functionalities that PostgreSQL 9.2. After comparing what live was like for such queries before and after the range data type, we will look at some common applications and extensions, and additionally see how VenueBook uses range types in its daily operations.", "event": {"name": "Postgres Open 2012", "nickname": "postgresopen-2012", "twitter": "postgresopen", "url": "https://wiki.postgresql.org/wiki/Postgres_Open_2012"}, "favorite": "0", "file_date": "2016-12-03", "filename": "jonathan-s-katz-range-types-in-postgresql-92-your-life-will-never-be-the-same", "length": "49:54", "likes": "1", "recorded": "2012-09-17", "short_description": "The range data type is a revolutionary new feature in PostgreSQL 9.2 that gives you the power to search and sieve over any data ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/XIcOf7r0dG4/hqdefault.jpg", "title": "Jonathan S. Katz: Range Types in PostgreSQL 9.2 - Your Life Will Never Be the Same", "tweet_video": "Jonathan%20S.%20Katz%3A%20Range%20Types%20in%20PostgreSQL%209.2%20-%20Your%20Life%20Will%20Never%20Be%20the%20Same%20https%3A//codeandtalk.com/v/postgresopen-2012/jonathan-s-katz-range-types-in-postgresql-92-your-life-will-never-be-the-same%20presented%20%40postgresopen", "videos": [{"code": "XIcOf7r0dG4", "type": "youtube"}], "views": "361"}