{
  "description": "Having a consistent user interface across a large application is critical. Frameworks like Twitter Bootstrap and Zurb Foundation are making it easier. But when designing a specific application, we need to take consistency one step further, and that's where component libraries come in. \n\nComponent libraries or design systems allow us to build a reference system for the usage and implementation of UI components. These components can then be used throughout your application in a consistent fashion. In this talk we'll introduce the concept of a component library; show you how to build a component library; demonstrate how to manage version updates and explain how to integrate the component library into your application with Webpack and NPM. \n\nBy the end of the talk, you will realise that this is the future and you won't be able to build you UI Components in any other way.\n\nSpeakers Bio:\nGarren Smith\nGarren is a JavaScript fanatic. As a Apache CouchDB Project Management Committee member, he has spent the last few years working on Fauxton, the new CouchDB Web Interface as well as contributing to PouchDB. He is the founder of Red Comet Labs a software development consultancy and is a regular contributor to OpenSource code. Garren is also the creator of Classroom 7, an online course building application. He loves living under the African sun in Johannesburg.\n\nBen Janecke\nHi I'm Ben, developer at Red Comet Labs. \n\nMy responsibilities range from translating designs into CSS and html, to building full web applications with React.js or Ember.js (although I prefer React). I have also been known to do backend work with Ruby and JavaScript, and have spent more time with SQL datastores than I would like to admit. \n\nI started my career writing accident and traffic management systems for the South African government and project management systems for the Department of Public Works. I have since worked for a consultancy, travel companies Contiki and Go2Africa, the UK government, a fitness startup, a digital contract signing service and a BI suite. \n\nI am passionate about clean, well-tested, understandable code and modern software processes in the post-agile world.",
  "recorded": "2016-07-16",
  "speakers": ["garren-smith", "ben-janecke"],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/FD-iymnelnk/hqdefault.jpg",
  "title": "Managing complex user interfaces with component libraries",
  "videos": [
    {
      "code": "FD-iymnelnk",
      "type": "youtube"
    }
  ]
}
