{
    "description": "Mike Nitchie\n&lt;p&gt;Offline web applications are nifty.&lt;/p&gt;&lt;p&gt;In fact, they may even be practical and useful. Via HTML5 Application Cache and Local Storage APIs, documents and web applications can be made available to your users even when they don&CloseCurlyQuote;t have an internet connection. This isn&CloseCurlyQuote;t a library, it&CloseCurlyQuote;s not an extension, and it&CloseCurlyQuote;s not a &ldquo;flash in the pan&CloseCurlyDoubleQuote; Next Best Thing&trade; that will go from hotness to obsolete in the time you write your first project with it. This is a core HTML5 standard that can add incredible utility to the web.&lt;/p&gt;&lt;p&gt;In this session we&CloseCurlyQuote;ll learn how to implement some basic offline web apps and the many (oh my, so so many&hellip;) pitfalls of getting started. We&CloseCurlyQuote;ll see some in-production examples and some handy tools to make local data management and syncing a bit simpler. Then, we&CloseCurlyQuote;ll get to the part of the talk that&CloseCurlyQuote;s actually interesting. We&CloseCurlyQuote;ll discuss when offline apps are and are not appropriate, how &ldquo;offline first&CloseCurlyDoubleQuote; apps could blur the line between native and web applications, and discuss solutions to the major problem of getting users to remember that they can open their browser when they have no internet access.&lt;/p&gt;&lt;p&gt;You&CloseCurlyQuote;ll leave with a basic knowledge of how to get started, resources to use to dig a bit deeper, tools to make development easier, and the ability to discuss the nuances of offline development. You will not only know the &ldquo;how&CloseCurlyDoubleQuote;, but the &ldquo;why&CloseCurlyDoubleQuote; and the &ldquo;when&CloseCurlyDoubleQuote; so you will be able to make a convincing case for (or against) the use of offline access in your next project.&lt;/p&gt;",
    "favorite": "0",
    "length": "33:07",
    "likes": "10",
    "recorded": "2015-11-14",
    "speakers": [
        "mike-nitchie"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/EZF1EfjQlbo/hqdefault.jpg",
    "title": "Taking Your Web Apps Offline",
    "videos": [
        {
            "code": "EZF1EfjQlbo",
            "type": "youtube"
        }
    ],
    "views": "895"
}