{"description": "Open source tools from companies such as Mesosphere, CoreOS and HashiCorp have made it possible for small teams to build scalable, highly automated infrastructure on which to deploy applications.\nSoftware container systems such as Docker have drastically simplified the way these applications are packaged and executed.\n<p>\nOver the last 2 years, we've worked hard to update our infrastructure from a complex set of manually-coordinated processes to an automated system that deploys Docker containers to a cluster.\nWe made this move to reduce costs, scale further and make our software more portable.\n<p>\nWe've used this new infrastructure to host hundreds of websites for Facebook's Free Basics platform.\nOur new health software stack, Seed, has pushed the requirements of the infrastructure even further.\nWe're working towards replicating this stack to deployments in countries across the world.\n<p>\nThe talk will cover some of the basic building blocks of cluster orchestration systems such as consensus algorithms, distributed key/value stores and resource allocation.\nWe'll cover some of the challenges in networking containers at scale and touch on some solutions for persistent storage.\n<p>\nFinally, we'll look at how these problems and the available solutions have shaped our infrastructure, the design trade-offs we made, and what we're looking forward to in the future.\n\n", "event": {"name": "ScaleConf 2016", "nickname": "scaleconf-sa-2016", "twitter": "scaleconf", "url": "http://scaleconf.org/speakers/2016"}, "favorite": "0", "file_date": "2016-12-03", "filename": "jamie-hewland-planting-seed", "length": "27:41", "likes": "1", "recorded": "2016-03-10", "short_description": "Open source tools from companies such as Mesosphere, CoreOS and HashiCorp have made it possible for small teams to build scalabl", "speaker_twitters": " @jayhewland", "speakers": {"jamie-hewland": {"episodes": [], "hosting": [], "info": {"country": "Johannesburg, South Africa", "github": "JayH5", "name": "Jamie Hewland", "twitter": "jayhewland"}, "videos": [{"event": {"name": "ScaleConf 2016", "nickname": "scaleconf-sa-2016", "twitter": "scaleconf", "url": "http://scaleconf.org/speakers/2016"}, "filename": "jamie-hewland-planting-seed", "recorded": "2016-03-10", "thumbnail_url": "https://i.ytimg.com/vi/uWk8zCqvtyw/hqdefault.jpg", "title": "Planting Seed"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/uWk8zCqvtyw/hqdefault.jpg", "title": "Planting Seed", "tweet_video": "Planting%20Seed%20https%3A//codeandtalk.com/v/scaleconf-sa-2016/jamie-hewland-planting-seed%20presented%20%40scaleconf%20by%20%40jayhewland", "videos": [{"code": "uWk8zCqvtyw", "type": "youtube"}], "views": "47"}