{"description": "http://front-trends.com/\n\nAutomatic tools can spit out super large scripts these days. Look at emscripten for examples, a script of several megabytes is not an exception (more like the rule). How do you process a script that is several megabytes large? Most parsers tend to want to parse everything in one sitting. These parsers run out of memory at some point. How can you do analysis or modifications to arbitrary scripts if you can’t even parse them? Enter a streaming parser. It is capable of parsing a script left to right without retaining more memory in the process. It can yield at any point where it needs more input and it can stream parsed tokens when one is available.\n\nI’ve managed to write an automatic build script that transforms my JavaScript parser ZeParser from a regular sync parser to a streaming parser, working in ES5 JavaScript. In this talk I would like to explain how to go about that, what kind of problems you may encounter, and what the end result looks like.\n\nSlides: https://drive.google.com/file/d/0B3hY2B8-FkPdaVJtelpwMVA5bTA/view", "event": {"name": "Front-Trends 2015", "nickname": "front-trends-2015", "twitter": "fronttrends", "url": "https://2015.front-trends.com/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "how-to-build-a-streaming-parser-peter-van-der-zee-front-trends-2015-warsaw-poland", "length": "26:58", "likes": "2", "recorded": "2015-05-06", "short_description": "http://front-trends.com/ Automatic tools can spit out super large scripts these days. Look at emscripten for examples, a script ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/2akq3myhBt0/hqdefault.jpg", "title": "How to build a streaming parser – Peter van der Zee / Front-Trends 2015, Warsaw, Poland", "tweet_video": "How%20to%20build%20a%20streaming%20parser%20%E2%80%93%20Peter%20van%20der%20Zee%20/%20Front-Trends%202015%2C%20Warsaw%2C%20Poland%20https%3A//codeandtalk.com/v/front-trends-2015/how-to-build-a-streaming-parser-peter-van-der-zee-front-trends-2015-warsaw-poland%20presented%20%40fronttrends", "videos": [{"code": "2akq3myhBt0", "type": "youtube"}], "views": "208"}