{
  "description": "The free software community is smart and forward-looking, but sometimes it can be hard to see the big picture when you're part of it. Often the easy choice isn't the best. We've been hearing about this constantly from the DevOps community: \"Build systems that don't fail spectacularly in the middle of the night!\" Of course, those robust systems are a little harder to build and take a bit more planning to set up. But when you consider \"other people's systems\" there is no question that the hard work should be done because it will make things better in the long run. The trick is looking at your own systems with that same long-range perspective.\n\nThe culture of the 1980's is often depicted as an obsession with neon clothing, valley girl idioms and synthpop. That's an unfortunately shallow portrayal when you consider that the artists and activists of the 1980's were pushing back against the cultural norms portrayed in mass media. They were challenging boundaries about who gets to participate in the creation of art and embracing new technologies to share their ideas. How will our current era of increased free software production and adoption be remembered? Will it be all unconferences and penguin swag or will we be remembered for how we changed the world?\n\nApplying a long-range perspective to the continued growth and success of the world-wide free software movement isn't easy. It will take time and probably money. Can we step outside of our own history and make sure that the community is setting a course for the place we want to end up?\n\nRecorded at LibrePlanet 2015 on March 21, 2015 in Cambridge MA. https://libreplanet.org/2015/\n\nTo view the original video, which does not require the use of nonfree software: http://media.libreplanet.org/u/libreplanet/m/deb-nicholson-style-or-substance-free-software-is-totally-the-80s/\n\nWhat's wrong with YouTube: http://www.gnu.org/philosophy/whats-wrong-with-youtube.en.html",
  "recorded": "2015-03-21",
  "speakers": [],
  "tags": [],
  "thumbnail_url": "https://i.ytimg.com/vi/5umzWy8Zu9k/hqdefault.jpg",
  "title": "Style or substance? Free software is totally the 80's - Deb Nicholson - LibrePlanet 2015",
  "videos": [
    {
      "code": "5umzWy8Zu9k",
      "type": "youtube"
    }
  ]
}