{"description": "Neue Features der Open Source Virtualisierungslösung oVirt\nNeues von der KVM basierten Virtualisierung mit Enterprise-Features\n\nVirtualisierung ist heutzutage die Grundlage vieler IT-Umgebungen in mittleren und großen Unternehmen und Organisationen. Eine hochperformante Open Source Lösung kombiniert mit Enterprise Management Features stellt das auf KVM basierende oVirt-Projekt dar.\n\nIn diesem Vortrag werden - aufbauend auf den Vortrag von den Grazer Linuxtagen 2013 - die neuen Features der Virtualisierungslösungen oVirt 3.3 und 3.4 vorgestellt. Obwohl das Hauptaugenmerk auf den Neuerungen liegt, wird für oVirt-Neulinge ein genereller Überblick über das Projekt gegeben.\n\nNeben einer detaillierten Beschreibung der einzelnen Komponenten und Tools wird in diesem Vortrag auch auf die einfachen Erweiterungsmöglichkeiten eingegangen. Dazu präsentiert der Vortragende die neueste Version des von ihm geschriebene Monitoring UI-Plugin, welches Icinga/Nagios mit oVirt kombiniert.\n\n\nLink zum Programm (und Downloads):\nhttp://glt14-programm.linuxtage.at/events/282.de.html", "event": {"name": "Grazer LinuxTage 2014", "nickname": "grazer-linuxtage-2014", "twitter": "linuxtage", "url": "https://glt14.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "neue-features-der-open-source-virtualisierungslosung-ovirt-rene-koch", "length": "37:02", "likes": "1", "recorded": "2014-04-04", "short_description": "Neue Features der Open Source Virtualisierungslösung oVirt Neues von der KVM basierten Virtualisierung mit Enterprise-Features V", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/4RvHK8GUO5s/hqdefault.jpg", "title": "Neue Features der Open Source Virtualisierungslösung oVirt - René Koch", "tweet_video": "Neue%20Features%20der%20Open%20Source%20Virtualisierungsl%C3%B6sung%20oVirt%20-%20Ren%C3%A9%20Koch%20https%3A//codeandtalk.com/v/grazer-linuxtage-2014/neue-features-der-open-source-virtualisierungslosung-ovirt-rene-koch%20presented%20%40linuxtage", "videos": [{"code": "4RvHK8GUO5s", "type": "youtube"}], "views": "203"}