{"description": "Vortrag an den Grazer Linuxtagen 2014\n\nTitel:\nSmart-SARAH\nHausautomation mit Open-Source und Open-Hardware\n\nBeschreibung:\nDie Community des Vorliegenden Projektes entwickeln zusammen eine offene Hardware und Softwareplattform, die es den Nutzern ermöglicht sein Smart-Home, seine Bulding-Automation, einfach und bequem zu Steuern. Eine Schlüsselrolle spielen moderne Kommunikationsgeräte wie Smart-Phones, Tabletts, Smart-TV und Webtechnologien. Zur Vernetzung der Aktoren und Sensoren dient IP. Die Software basiert auf Contiki-OS, Linux und OpenHAB, Linknx-Webknx und Open-Limbas für die Verbindung zwischen Building-Automation und Geschäftsprozessen. Smart-SARAH ist dank freier Lizenzen beliebig erweiterbar. Die Leitung des Projektes liegt bei der Opensource Domotics Group.\n\nIn allen Bereichen des Lebens werden wir zunehmend von Technik begleitet. Im Eigenheim hilft uns Smart-Home, energieeffizient zu wohnen und den Alltag angenehmer zu gestalten. Das vorliegende Projekt entwickelt eine offene Hardware und Softwareplattform, die es den Nutzern ermöglicht, sein Zuhause einfach und bequem zu steuern. Eine Schlüsselrolle spielen moderne Kommunikationsgeräte wie Smart-Phones, Tablets, Smart-TV und Webtechnologien. Zur Vernetzung der Aktoren und Sensoren dient IP, die Software basiert auf Linux und Contiki-OS und ist dank freier Lizenzen beliebig erweiterbar.\n\nVortragender:\nHarald Pichler", "event": {"name": "Grazer LinuxTage 2014", "nickname": "grazer-linuxtage-2014", "twitter": "linuxtage", "url": "https://glt14.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "smart-sarah-harald-pichler", "length": "37:32", "likes": "0", "recorded": "2014-04-04", "short_description": "Vortrag an den Grazer Linuxtagen 2014 Titel: Smart-SARAH Hausautomation mit Open-Source und Open-Hardware Beschreibung: Die Comm", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/d15HblCrdN8/hqdefault.jpg", "title": "Smart-SARAH - Harald Pichler", "tweet_video": "Smart-SARAH%20-%20Harald%20Pichler%20https%3A//codeandtalk.com/v/grazer-linuxtage-2014/smart-sarah-harald-pichler%20presented%20%40linuxtage", "videos": [{"code": "d15HblCrdN8", "type": "youtube"}], "views": "219"}