{"description": "Vortrag an den Grazer Linuxtagen 2014\n\nTitel:\nSteuern und Messen mit Raspberry Pi\n\nBeschreibung:\nDer Raspberry Pi ist ein kreditkartengroßer Einplatinencomputer der für weniger als 40 Euro erworben werden kann. Eine der vielen Anwendungsmöglichkeiten ist die Verwendung der digitalen Ein-/Ausgänge (GPIOs) auf der Platine für elektronische Steuerungen und Sensoren.\n\nDer Raspberry Pi ist ein kreditkartengroßer Einplatinencomputer der für weniger als 40 Euro erworben werden kann. Eine der vielen Anwendungsmöglichkeiten ist die Verwendung der digitalen Ein-/Ausgänge (GPIOs) auf der Platine für elektronische Schaltungen. Dabei können einfache Aufgaben, wie das Aktivieren einer LED und das Einlesen einer Taste realisiert werden. Man kann auch eine Vielzahl an verschieden Sensoren einbinden um z.B. Lufttemperatur und Luftfeuchte zu messen. Mit der entsprechenden zusätzlichen Hardware (BrickPi) können auch komplexe Aufgaben wie das Steuern eines LEGO (R) Mindstorms Roboterarms realisiert werden. Der Vortrag zeigt welche elektronischen Bauteile man benötigt und wie man sie verdrahten muss um die gewünschten Aufgabe zu erfüllen. Das beginnt bei ICs für die Pegelanpassung und Schutzbeschaltungen, über ICs für Porterweiterung bis hin zu Sensoren und der Zusatzplatine BrickPi. Die Steuerung der Ausgänge und das Auslesen der Sensoren wird anhand von Shell-Scripts und C/C++ Programmen erklärt. Alle Schaltungen, Sensoren und die BrickPi Erweiterungsplatine können am Projektstand 'Raspberry Pi Projekte' in Aktion besichtigt werden.\n\nVortragende:\nManfred Wallner und Martin Strohmayer", "event": {"name": "Grazer LinuxTage 2014", "nickname": "grazer-linuxtage-2014", "twitter": "linuxtage", "url": "https://glt14.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "steuern-und-messen-mit-raspberry-pi-manfred-wallner-und-martin-strohmayer", "length": "40:26", "likes": "2", "recorded": "2014-04-04", "short_description": "Vortrag an den Grazer Linuxtagen 2014 Titel: Steuern und Messen mit Raspberry Pi Beschreibung: Der Raspberry Pi ist ein kreditka", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/95C9yR_yXBU/hqdefault.jpg", "title": "Steuern und Messen mit Raspberry Pi - Manfred Wallner und Martin Strohmayer", "tweet_video": "Steuern%20und%20Messen%20mit%20Raspberry%20Pi%20-%20Manfred%20Wallner%20und%20Martin%20Strohmayer%20https%3A//codeandtalk.com/v/grazer-linuxtage-2014/steuern-und-messen-mit-raspberry-pi-manfred-wallner-und-martin-strohmayer%20presented%20%40linuxtage", "videos": [{"code": "95C9yR_yXBU", "type": "youtube"}], "views": "4508"}