{"description": "Beschreibung:\nSysDB — ein Datenaggregator für System-Informationen\nAll your systems are belong to you\n\n„System DataBase\" (SysDB) ist ein Werkzeug zum aggregieren diverser System-Informationen aus verschiedenen Datenquellen. Es kann dazu verwendet werden, Eigenschaften und Zustände von Hard- und Software-Systemen zum Beispiel aus Inventar-Datenbanken, Monitoring-System, oder ähnlichem (z.B. Nagios, Puppet, collectd) abzufragen. Die Informationen werden dann an Hand ihrer Attribute zusammengefasst, um Informationen zu einzelnen System im Überblick zu erhalten.\n\nIn den meisten heterogenen, großen IT-Umgebungen kommen verschiedene Werkzeuge zum Einsatz, die Informationen zu den einzelnen Hard- und Software-Systemen beinhalten oder einen Zustand davon abfragen. Beispiele dafür sind Monitoring-Systeme wie Nagios oder Konfigurationswerkzeuge wie Puppet. Diese bieten Informationen wie System-Status, Attribute (Facts) von Systemen und Beziehungen zwischen verschiedenen Entitäten. SysDB („System DataBase') bietet die Möglichkeit diese Informationen zusammenzuführen und damit einen umfassenden Gesamt-Überblick über jedes System zu erhalten. Dazu werden die Objekte (Informationen) der verschiedenen Backend-Objekte auf generischen Objekten abgebildet und an Hand ihrer Attribute miteinander korreliert. Damit werden alle wichtigen Informationen einer Infrastruktur in einer einzelnen Hierarchie zusammengefasst und können zentral über eine Schnittstelle abgefragt werden. Dies wiederum ermöglich Anwendungsfälle wie zentrale Dashboards, Verknüpfung von Informationen aus dem Monitoring und Inventar, die Identifizierung von fehlenden Informationen in einzelnen Backends und vieles mehr.\n\nDieser Vortrag liefert einen Überblick über SysDB, dessen Features und Beispiel-Anwendungsfälle. Das Projekt ist noch in einem frühen Entwicklungsstadium aber bereits einsatzbereit. Der Vortrag wird auch einen Ausblick in die Zukunft und Integration in weitere Dienste aufzeigen.\n\n\nLink zum Programm (und Downloads): \nhttp://glt14-programm.linuxtage.at/events/327.de.html", "event": {"name": "Grazer LinuxTage 2014", "nickname": "grazer-linuxtage-2014", "twitter": "linuxtage", "url": "https://glt14.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "sysdb-ein-datenaggregator-fur-system-informationen-sebastian-tokkee-harl", "length": "46:11", "likes": "0", "recorded": "2014-04-04", "short_description": "Beschreibung: SysDB — ein Datenaggregator für System-Informationen All your systems are belong to you „System DataBase (SysDB) i", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/di9IGqKtln4/hqdefault.jpg", "title": "SysDB — ein Datenaggregator für System-Informationen -   Sebastian \"tokkee\" Harl", "tweet_video": "SysDB%20%E2%80%94%20ein%20Datenaggregator%20f%C3%BCr%20System-Informationen%20-%20%20%20Sebastian%20%22tokkee%22%20Harl%20https%3A//codeandtalk.com/v/grazer-linuxtage-2014/sysdb-ein-datenaggregator-fur-system-informationen-sebastian-tokkee-harl%20presented%20%40linuxtage", "videos": [{"code": "di9IGqKtln4", "type": "youtube"}], "views": "116"}