{
    "abstract": "https://events.drupal.org/neworleans2016/sessions/limber-up-with-flexible-layouts-wysiwgyg-templates-more",
    "description": "When you’re designing a Drupal site, you often don’t know how much your design is going to survive use by your content administrators — so it’s tempting to either tie your design/theme to a rigid content type layout (ultimately frustrating your admins who want to use your styling midway through a long page, not at the top or bottom in a prescribed field), or rely on your admins to add CSS classes through the WYSIWYG to elements that need to get special styling midway down the page (…also frustrating your admins, who probably hate using the Source view).\n\nBut there’s a middle ground: you can limber up your Drupal sites by empowering your content administrators to use pre-configured content templates for styled content in WYSIWYGs, drop in pre-styled elements from your style guide, embed retina-friendly images, swap out page layouts, and more.\nThis session will demo updating techniques formerly used in Drupal 7 for Drupal 8, including:\n\nCreating content templates that content admins can select to drop in pre-formatted text and styles — e.g. “Pullquote with Credit”\nMaking your layouts flexible with Panels\nMaking image placement easier for content admins by providing image layout templates that include left/right floating, sizing, and styled captions\nOffering up retina-friendly images in WYSIWYGs selectively based on device type\nPlus more administrative modules for easier linking, content browsing, and bulk updates.\nAttendees will walk away with a better understanding of how to improve the ability of non-technical administrators to create complex, flexible, and engaging content templates in Drupal.",
    "favorite": "0",
    "length": "52:54",
    "likes": "6",
    "recorded": "2016-05-09",
    "speakers": [
        "kat-kuhl",
        "clay-marshall"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/rj2L1W-Pi34/hqdefault.jpg",
    "title": "Limbering Drupal 8 Up with Flexible Layouts, WYSIWYG Templates, & More",
    "videos": [
        {
            "code": "rj2L1W-Pi34",
            "type": "youtube"
        }
    ],
    "views": "615"
}