{
    "description": "Global communities like the Drupal world enjoy a huge diversity of contributors, but more people bringing in their unique emotional experiences can often mean more opportunities for misunderstandings. That’s why we’re pleased to announce our third keynote for DrupalCon: renowned content strategist and author Sara Wachter-Boettcher will talk to us on Wednesday morning in a keynote called Everybody Hurts: Design for Kindness.\n\nHead shot of Sara Wachter-BoettcherSara Wachter-Boettcher runs a content strategy consultancy based in Philadelphia. She is the co-author, with Eric Meyer, of Designing for Real Life, a book about creating products and interfaces that are more inclusive and compassionate. She is also the author of Content Everywhere, a book about creating flexible, mobile-ready content. Sara works with clients like Trek Bicycles, The Associated Press, The Home Depot, and Harvard, and speaks at web conferences worldwide. Find her on Twitter @sara_ann_marie or at sarawb.com.\n\nSara’s keynote will cover how we can each work to make our designs kinder and more inclusive. We all want interfaces that feel human—where the content is friendly and everything flows right along. But being human isn’t just about being breezy. Every user has their own personal histories with pain and problems, and with past traumas or present crises. This keynote will focus on how to take users’ vulnerabilities, triggers, and touchy subjects into account when we don’t even know what they are. This talk discusses how clear intentions and compassionate communication can strengthen everything from forms to headlines to site structures.\n\nDesign with empathy",
    "favorite": "0",
    "length": "01:07:59",
    "likes": "11",
    "recorded": "2016-05-09",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/UcjT63hl4l4/hqdefault.jpg",
    "title": "DrupalCon New Orleans 2016: Keynote: Sara Wachter-Boettcher",
    "videos": [
        {
            "code": "UcjT63hl4l4",
            "type": "youtube"
        }
    ],
    "views": "968"
}