{
    "description": "Five years ago in 2011 the State of Georgia started planning to change its web publishing platform to Drupal. The plan was to move 55 websites from a proprietary content management system hosted at the state’s data center to Drupal hosted in the cloud. The move was not only technical but also involved governance by asking 45 Georgia state agencies to make this change at the same time. The business case for a Drupal implementation promised efficiency benefits and cost savings for  the state's web presence. Now five years after Georgia moved to Drupal, how did the promise hold up?\n\nThis session will cover the following:\n\n·        A close look at Georgia’s ROI on implementing Drupal\n\n·        How other organizations can plan for a large scale Drupal implementation\n\n·        The technical, business and end-user influences on Georgia's existing Drupal platform\n\n·        Managing a digital services team to support an enterprise\n\n·        Maintaining your Drupal platform post migration\n\nOther states, local governments or any organization looking to implement an enterprise Drupal solution will benefit from this session.\n\nNikhil is Director of GeorgiaGov Interactive, a division within the Georgia Technology Authority (GTA). GeorgiaGov Interactive provides content publishing solutions and strategic counsel to the state of Georgia agencies and elected officials. Nikhil oversees the strategy and operations of Georgia.gov and the Drupal-based web publishing platform which hosts around 75 websites for state agencies and elected officials. Nikhil has 15 years of public and private sector experience in web services.\n\nNikhil led the Drupal migration project for GTA to centralize Georgia’s web presence on an open source platform hosted in the cloud. Nikhil speaks  and writes about Georgia’s Drupal project hoping to help other state and local governments realize the benefits. Nikhil is an advocate of open source and web standards.\n\nHe holds a master of fine arts in Interaction Design and a master of design degree in Visual Communication. Nikhil is also an adjunct faculty member at the Savannah College of Art and Design (SCAD), Atlanta campus, where he teaches Interaction Design and Social Gaming. Reach Nikhil on Twitter  @nikofthehill.",
    "favorite": "0",
    "length": "01:09:08",
    "likes": "0",
    "recorded": "2016-05-09",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/N5xkWKWoIR8/hqdefault.jpg",
    "title": "DrupalCon New Orleans 2016: Fifth year using Drupal: A look at Georgia's return on investment",
    "videos": [
        {
            "code": "N5xkWKWoIR8",
            "type": "youtube"
        }
    ],
    "views": "139"
}