{
    "description": "Stitch Fix takes a unique approach to retail which combines art and science -- we send our clients clothes we think they will love; they keep what they want and return what they donâ\u0080\u0099t. Based on years of data science and machine learning, we develop personalized algorithmic recommendations for each client, and one of our thousands of human stylists hand-curates those recommendations to choose what goes in each box. \r\n\r\nThis talk will discuss the technology approach and modern development practices we have put in place to make this model succeed. To reduce the coupling that stifles velocity and innovation, we are actively rearchitecting around microservices and event-driven approaches. To get the agility that comes from rapid iteration, we practice TDD and Continuous Delivery. To get the ownership that drives optimal results, we organize around small, independent teams that run what they build (DevOps). To take advantage of our rich data, we maintain a robust data pipeline and offer data as services. All of these practices work synergistically, and each benefits from and reinforces the others. \r\n\r\nThe talk will conclude with lessons we learned on this journey, and will suggest ways other organizations can do the same.\r\n\r\nWORKSHOP\r\n\r\nScaling Technology and Organizations Together\r\nWEDNESDAY 9:00 - 17:00\r\nTOPICS: SCALABILITY BUSINESS TECHNOLOGY STRATEGY AGILE DEVOPS CONTINUOUS DELIVERY\r\nLEVEL:    INTERMEDIATE\r\nSuccessful Internet companies are built on a foundation of excellent culture, efficient organization, and solid technology. As a company needs to scale, all of these parts of the foundation need to grow and scale with it. This tutorial will provide a deep dive into modern best practices at innovative companies in Silicon Valley for scaling culture, organization, and technology. \r\n\r\nDriven primarily by the presenter's experience ranging from small Valley startups to Google and eBay, we will learn about:\r\n\r\nOrganizing engineering teams for innovation andâ\u0080¦",
    "favorite": "0",
    "length": "36:42",
    "likes": "0",
    "recorded": "2017-04-27",
    "speakers": [
        "randy-shoup"
    ],
    "tags": [],
    "thumbnail_url": "http://static-cdn2.ustream.tv/i/video/picture/0/1/102/102859/102859599/1_17867932_102859599,640x360,b,1:2.jpg",
    "title": "Effective Microservices in a Data-Centric World",
    "videos": [
        {
            "code": "102859599",
            "type": "ustream"
        }
    ],
    "views": "0"
}