{
    "description": "Technologists are keen to stay up to date on modern technologies. Theyâ\u0080\u0099ve deployed apps in containers, used modern automation tools, and launched servers in the cloud. These exercises are often done in development environments, though, instead of in production. \r\n\r\nUsually, this is because thereâ\u0080\u0099s a gap between the processes that keep the production environment online and modern tools and methods. â\u0080\u009cIf it works, donâ\u0080\u0099t change itâ\u0080\u009d is the mantra they may be working under. As a result, production systems may run on aging platforms that are managed with manual, time consuming processes. \r\n\r\nIn this talk, I will discuss ways that developers and system administrators can bridge the gap between legacy systems and modern techniques. The several techniques I will describe will help confident devs and admins introduce the idea of modernization, flesh out those ideas into proofs of concept, and deploy to production environments successfully. \r\n\r\nThe core of my presentation is based on experience gained while working managing high traffic, public facing web sites for Toyota (toyota.com) and United Business Media (modernmedicine.com). I will also refer to recent texts and studies on modernizing legacy hardware and software. \r\n\r\nFor example, Iâ\u0080\u0099ll discuss how I worked with developers and management to take a web application deployment from manual and error prone to a one-click automated, predictable process. \r\n\r\nThis talk falls into the â\u0080\u009cEngineering Soft Skillsâ\u0080\u009d category and will focus on techniques used in communication, planning, and project management; when needed, specific technologies applied to a particular situation will be mentioned. \r\n\r\nAfter attending this talk, participants will take away ideas and tips they can share with their peers and management to gradually update the software and systems that they work with.\r\nUsually, this is because thereâ\u0080\u0099s a gap between the processes that keep the production environment online and modern tools and methods. â\u0080\u009cIf it works, donâ\u0080\u0099tâ\u0080¦",
    "favorite": "0",
    "length": "33:40",
    "likes": "0",
    "recorded": "2017-04-27",
    "speakers": [
        "michael-jenkins"
    ],
    "tags": [],
    "thumbnail_url": "http://static-cdn2.ustream.tv/i/video/picture/0/1/102/102892/102892247/1_17867926_102892247,640x360,b,1:2.jpg",
    "title": "Injecting Modern Concepts into Legacy Processes",
    "videos": [
        {
            "code": "102892247",
            "type": "ustream"
        }
    ],
    "views": "0"
}
