{"description": "Containers are the latest hype. It goes without saying that Docker for the development environment is a good thing but what about running our production Java applications inside a container?\n\nOne of the well known benefits of containers is that they provide a self-contained way to package and ship applications. However, it is already common practice to build fat executable jars that require only a JRE so what advantages would containers actually offer a pure Java shop? At Sky our motivation is efficient utilisation of hardware. We used to run single purpose VMs, which makes sense for production but for our countless test environments it is prohibitively expensive. Even IaaS is still too slow to provision new environments and bootstrap new applications. This talk will be focusing on the downsides and lessons learned from running JVMs inside containers.\n\nWe will cover the following topics:\n- The benefits, downsides and complexities of running a Java application inside a container.\n- Tuning memory limits taking into account Heap, Native memory, Metaspace, Stacks to avoid being OOM killed\n- Tracking native memory with jcmd\n- Operating system tools that are/are not container aware", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-christopher-batey-the-jvm-and-docker-a-good-idea", "length": "50:01", "likes": "8", "recorded": "2016-06-22", "short_description": "Containers are the latest hype. It goes without saying that Docker for the development environment is a good thing but what abou", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/Vt4G-pHXfs4/hqdefault.jpg", "title": "Devoxx Poland 2016 - Christopher Batey - The JVM and Docker, a good idea?", "tweet_video": "Devoxx%20Poland%202016%20-%20Christopher%20Batey%20-%20The%20JVM%20and%20Docker%2C%20a%20good%20idea%3F%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-christopher-batey-the-jvm-and-docker-a-good-idea%20presented%20%40devoxxpl", "videos": [{"code": "Vt4G-pHXfs4", "type": "youtube"}], "views": "739"}