{"description": "Few topics in software architecture discussions yield as much heat as that of microservices. Monolithic applications have dominated the landscape for years, and a large number of monoliths run a great many critical processes used to this day. More recently, companies with requirements for rapid release cycles and key \"ilities\" (maintainability, scalability, reliability, flexibility, extensibility) have chosen another approach, deploying functionality in more granular, API-driven modules: microservices.\n\nIn this session, the presenter will strip away the hype and speak frankly of the upsides & downsides of adopting a microservices architecture and why, with certain exceptions, the pros far outweigh the cons. Topics include Domain Driven Design & bounded contexts, increasing quality & velocity, horizontal vs. vertical scaling, portability, & more. The presenter will then show how to build & integrate microservices applications using Spring Boot, various data sources, & REST resources built to task. Load balancers, circuit breakers, tests, & other risk mitigation mechanisms will be demonstrated & discussed.\n\nLeave this session knowing how and why to max out on microservices!", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-mark-heckler-microservices-minus-the-hype-how-to-build-and-why", "length": "51:24", "likes": "1", "recorded": "2016-06-22", "short_description": "Few topics in software architecture discussions yield as much heat as that of microservices. Monolithic applications have domina", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/0szo_FLDSRY/hqdefault.jpg", "title": "Devoxx Poland 2016 - Mark Heckler - Microservices Minus the Hype: How to Build and Why", "tweet_video": "Devoxx%20Poland%202016%20-%20Mark%20Heckler%20-%20Microservices%20Minus%20the%20Hype%3A%20How%20to%20Build%20and%20Why%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-mark-heckler-microservices-minus-the-hype-how-to-build-and-why%20presented%20%40devoxxpl", "videos": [{"code": "0szo_FLDSRY", "type": "youtube"}], "views": "203"}