{"description": "Cloud Native, Docker, DevOps, microservices, and more: we go to conferences and get excited about the potential of so many things that could revolutionize our development and change our organizational and professional lives! And then, we go home...and hit the wall. If you've ever asked yourself, \"This stuff is cool, but HOW CAN I GET MY COMPANY TO DO IT??!\", this is the session for you.\n\nLearn from an experienced software developer (who also happens to have an MBA) how to make your case to leadership, presenting management-ready justifications for changes in \"your world\" that will positively impact the business as a whole. Topics include:\n\n- How would this change affect your organization's/group's/team's work?\n- How would this change impact (positively and negatively) your tech stack (internal considerations)?\n- How would this change contribute to recruitment/retention (external considerations)?\n- Seeing beyond your borders: how could this change positively - and negatively - affect the business?\n- Putting numbers with it: pros, cons, and caveats\nCome to this session to dramatically boost your chances of making an actual, positive change to your organization!", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-mark-heckler-this-stuff-is-cool-but-how-can-i-get-my-company-to-do-it", "length": "49:14", "likes": "1", "recorded": "2016-06-22", "short_description": "Cloud Native, Docker, DevOps, microservices, and more: we go to conferences and get excited about the potential of so many thing", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/D4bwYrHlJEY/hqdefault.jpg", "title": "Devoxx Poland 2016 - Mark Heckler - This stuff is cool, but HOW CAN I GET MY COMPANY TO DO IT??!", "tweet_video": "Devoxx%20Poland%202016%20-%20Mark%20Heckler%20-%20This%20stuff%20is%20cool%2C%20but%20HOW%20CAN%20I%20GET%20MY%20COMPANY%20TO%20DO%20IT%3F%3F%21%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-mark-heckler-this-stuff-is-cool-but-how-can-i-get-my-company-to-do-it%20presented%20%40devoxxpl", "videos": [{"code": "D4bwYrHlJEY", "type": "youtube"}], "views": "97"}