{"description": "The way software is developed and run in production has changed dramatically over the past ten years. These changes are just now reaching the “mainstream” who are looking to respond to the idea that “software is eating the world” and use software like all the “unicorns” we read about in the market. Getting your advice strictly from unicorn companies can feel a lot like getting dieting advice from celebrities: it sure will work if you have unlimited resources, few constraints, and, well, are already successful. What can the rest of shlubs who actually work in “the real world do” to get closer to the benefits of being “cloud native”?\n\nThis talk answers that question by looking at the current state of IT and how the role of IT has changed in recent years: if around ⅔ of businesses think IT doesn’t help them innovate, how is IT going to be effective in an era where custom written software is key to surviving and thriving in a business world where competitive advantages are now highly transient?", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-michael-cote-better-ways-of-developing-software-or-coding-like-a-unicorn", "length": "51:09", "likes": "3", "recorded": "2016-06-22", "short_description": "The way software is developed and run in production has changed dramatically over the past ten years. These changes are just now", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/snsdZ5gViJU/hqdefault.jpg", "title": "Devoxx Poland 2016 - Michael Coté - Better ways of developing software or, coding like a unicorn", "tweet_video": "Devoxx%20Poland%202016%20-%20Michael%20Cot%C3%A9%20-%20Better%20ways%20of%20developing%20software%20or%2C%20coding%20like%20a%20unicorn%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-michael-cote-better-ways-of-developing-software-or-coding-like-a-unicorn%20presented%20%40devoxxpl", "videos": [{"code": "snsdZ5gViJU", "type": "youtube"}], "views": "136"}