{"description": "It is foretold that by 2020 more than three-quarters of the S&P 500 companies will be comprised of businesses that are yet known to us. The term “software is eating the world” is thus aptly coined. This is an enterprise transformation story, sprinkled liberally with devops principles, illustrating one important cog in the wheel for improving an antiquated and inefficient old school practices. At the core lies the a modern tale about ChatOps, build pipelines and continuous integration and deployment. Under the hood, the approach is grounded with Jenkins, Docker, AWS Elastic Beanstalk. and Jenkins Job Builder.\n\nThis toolchain enables our teams to ship fast. In addition, the build pipeline is templated, reusable, and testable. This significantly speed up the process of configuring complex Jenkins jobs and enable highly parameterised build pipelines. Ultimately, this translates to reliability and scalability that allows the team to better support the business units in a highly efficient manner.\n\nEnterprises are forced to operate as a software shop and this presentation aims to share the findings, lessons with some hands-on, and the macabre journey that is enterprise transformation.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-yves-hwang-enterprise-it-is-dead-long-live-enterprise-it", "length": "39:22", "likes": "4", "recorded": "2016-06-22", "short_description": "It is foretold that by 2020 more than three-quarters of the S&P 500 companies will be comprised of businesses that are yet known", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/eK5EOkDxALI/hqdefault.jpg", "title": "Devoxx Poland 2016 - Yves Hwang - ENTERPRISE I.T. IS DEAD, LONG LIVE ENTERPRISE I.T.!", "tweet_video": "Devoxx%20Poland%202016%20-%20Yves%20Hwang%20-%20ENTERPRISE%20I.T.%20IS%20DEAD%2C%20LONG%20LIVE%20ENTERPRISE%20I.T.%21%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-yves-hwang-enterprise-it-is-dead-long-live-enterprise-it%20presented%20%40devoxxpl", "videos": [{"code": "eK5EOkDxALI", "type": "youtube"}], "views": "233"}