{"description": "The ObjectLayout package provides a set of data structure classes designed with optimised memory layout in mind. In languages like C and C++, the use of structs and explicit pointers can deliver high performance for data access through hardware optimisations for caching and pre-fetching. Java's use of implicit pointers, mutable arrays and general inheritance forces the use of reference lookups whenever an object needs to be accessed.\n\nThis session will look at the ObjectLayout package (www.objectlayout.org), which provides a new set of APIs that are aimed at matching the natural speed benefits similar data structure constructs enable in most C-style languages while maintaining an idiomatic Java feel and a natural fit with existing code and libraries.\n\nThe session will talk through the need for these APIs then describe how they work in practice. We'll also look at how the JVM can further optimise the implementation of the API by making this intrinsic.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-simon-ritter-faster-java-by-adding-structs-sort-of", "length": "49:58", "likes": "3", "recorded": "2016-06-22", "short_description": "The ObjectLayout package provides a set of data structure classes designed with optimised memory layout in mind. In languages li", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/TE9yDsjNCOI/hqdefault.jpg", "title": "Devoxx Poland 2016 - Simon Ritter - Faster Java By Adding Structs (Sort Of)", "tweet_video": "Devoxx%20Poland%202016%20-%20Simon%20Ritter%20-%20Faster%20Java%20By%20Adding%20Structs%20%28Sort%20Of%29%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-simon-ritter-faster-java-by-adding-structs-sort-of%20presented%20%40devoxxpl", "videos": [{"code": "TE9yDsjNCOI", "type": "youtube"}], "views": "244"}