{"description": "NOW TV’s customer base has tripled year on year, and linear event streaming has become a greater and greater percentage of their viewing. This talk will take you through the lessons we learnt following one unfortunate event in 2014 which led NOW TV to catastrophic failure, and the improvements and scalability challenges we were faced with when preparing for the same event just 1 year later.\n\nHear how we turned our entire failure case behaviour on its head; from always failing in favour of NOW TV, to failing in favour of the customer. Learn how we ensure that high availability of video assets on the CDN ensures continued playout irrespective of the state of our application servers. Take away some tips of how NOT to scale, as well as how we reversed our fortunes and delivered stability during the biggest events on NOW TV.\n\nNo cover-ups or side-stepping our previous faults, hear about the rough with the smooth, along with the customer sentiment that has made us a far better service today. Get an insight into NOW TV platform and architecture from CDNs, through our Java/Groovy/Scala application servers, down to our Mongo databases, and learn how we will handle our ever-increasing load.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-tom-maule-now-tv-and-linear-streaming-the-unpredictable-scalability", "length": "36:02", "likes": "2", "recorded": "2016-06-22", "short_description": "NOW TV’s customer base has tripled year on year, and linear event streaming has become a greater and greater percentage of their", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/E7PGQJCGOPg/hqdefault.jpg", "title": "Devoxx Poland 2016 - Tom Maule - NOW TV and Linear Streaming: The unpredictable scalability...", "tweet_video": "Devoxx%20Poland%202016%20-%20Tom%20Maule%20-%20NOW%20TV%20and%20Linear%20Streaming%3A%20The%20unpredictable%20scalability...%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-tom-maule-now-tv-and-linear-streaming-the-unpredictable-scalability%20presented%20%40devoxxpl", "videos": [{"code": "E7PGQJCGOPg", "type": "youtube"}], "views": "210"}