{"description": "XTRF translation process management platform is a heavy weight JEE application hosted on JBoss AS servers and exposed to more than 250 customers all over the world. It is filled up with older and newer java libraries (JSF/SEAM/RF, Spring, Hibernate, RestAPI, AngularJS) backed by Postgresql/Oracle database.\n\nSo what’s the big deal? There are thousands of apps like these. They share same problems like large footprint or deployment clumsiness. But what do you do if your customers love your product and need more and more instances all over the world? How do you build an infrastructure for hosting hundred of these and not to go bankrupt at the same time? It is more than certain that you had already faced some of these problems in your career. What’s, more most likely you are already perfectly aware of miscellaneous cloud and contemporary virtualization solutions that are already available out of the box (ex. EC2, DigitalOcean etc). They are easy to integrate with, simple to scale up. However they usually give you much more that you may actually need which ends up with a monthly bill that may not fit into your budgeting plans particular well.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-michal-krzywucki-dominik-radziszowski-easily-scale-up-your-jee-stack-with", "length": "52:06", "likes": "1", "recorded": "2016-06-22", "short_description": "XTRF translation process management platform is a heavy weight JEE application hosted on JBoss AS servers and exposed to more th", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/NzCg2Sb-GRc/hqdefault.jpg", "title": "Devoxx Poland 2016 - Michał Krzywucki, Dominik Radziszowski - Easily scale up your JEE stack with...", "tweet_video": "Devoxx%20Poland%202016%20-%20Micha%C5%82%20Krzywucki%2C%20Dominik%20Radziszowski%20-%20Easily%20scale%20up%20your%20JEE%20stack%20with...%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-michal-krzywucki-dominik-radziszowski-easily-scale-up-your-jee-stack-with%20presented%20%40devoxxpl", "videos": [{"code": "NzCg2Sb-GRc", "type": "youtube"}], "views": "236"}