{"description": "Developers love Git for its raw speed, powerful history traversal, distributed nature, and the fact that it was built by uber developer Linus Torvalds. What we don't love is the fact that, out of the box, Git has terrible support for tracking large binary files!\n\nFortunately, developers from Atlassian, GitHub, and Visual Studio Online have teamed up to work on an open source (MIT licensed) project to solve this problem: Git LFS (Large File Support). This means researchers, web designers, game developers, multimedia producers and all other developers who need to work with large data and rich media can move off legacy centralized systems and start using modern version control.\n\nIn this session I'll cover the computer science behind Git LFS' internals & architecture, CLI usage and how to build an effective Git LFS workflow for a development team. Attendees will take away an understanding of how Git LFS works under the hood, and some practical advice on using Git LFS with their software projects and teams.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-steve-smith-tracking-huge-files-with-git-lfs", "length": "46:36", "likes": "1", "recorded": "2016-06-22", "short_description": "Developers love Git for its raw speed, powerful history traversal, distributed nature, and the fact that it was built by uber de", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/27FjXNTOiZ4/hqdefault.jpg", "title": "Devoxx Poland 2016 - Steve Smith - Tracking huge files with Git LFS", "tweet_video": "Devoxx%20Poland%202016%20-%20Steve%20Smith%20-%20Tracking%20huge%20files%20with%20Git%20LFS%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-steve-smith-tracking-huge-files-with-git-lfs%20presented%20%40devoxxpl", "videos": [{"code": "27FjXNTOiZ4", "type": "youtube"}], "views": "111"}