{"description": "Nowadays everyone wants to builds software that brings business value. We set focus on meeting requirements given by customer, obviously. The faster we deliver the better, as the fast feedback loop is crucial to successful delivery. We tend to forget, unfortunately, that apart from those shiny business features our system has to survive under unexpected conditions. We often don't consider what will happen if the system fails in production.\n\nResilience testing is an important aspect of each product that is supposed to operate continuously. We must remember that failure is an option. We must be prepared. A real challenge is to focus on the right piece of your system and keep your tests isolated. There are many tools to simulate a failure of resources or external services, but there are little tools that let you fully control internal parts of your product in a fully transparent way.\n\nThe talk will cover live coding, demo session, and practical guideline on tools and techniques for resilience testing, but first and foremost it will present a unique way of letting your tests control your system to simulate a failure while keeping test code fully decoupled from production code.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-bartosz-czerwinski-failure-is-an-option", "length": "46:08", "likes": "3", "recorded": "2016-06-22", "short_description": "Nowadays everyone wants to builds software that brings business value. We set focus on meeting requirements given by customer, o", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/d4siqCs_hQE/hqdefault.jpg", "title": "Devoxx Poland 2016 - Bartosz Czerwiński - Failure is an option", "tweet_video": "Devoxx%20Poland%202016%20-%20Bartosz%20Czerwi%C5%84ski%20-%20Failure%20is%20an%20option%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-bartosz-czerwinski-failure-is-an-option%20presented%20%40devoxxpl", "videos": [{"code": "d4siqCs_hQE", "type": "youtube"}], "views": "105"}