{"description": "You must have heard about Bitcoin. Publicly launched in 2009, it obtained massive public media attention a couple of years later. Besides a digital currency, the major innovation of Bitcoin is the blockchain, also known as a distributed ledger, a technology that uses cryptography to allow some systems that could only be modelled in a client-server fashion before to be modelled in a peer-to-peer fashion. Blockchain technology can be very useful outside the realm of digital currencies and finance, for example in the energy market, car maintenance history or international trade.\n\nWith my three years of experience with blockchains, I’m going to make sure there are a couple of takeaways for you in this presentation. You'll learn how blockchains works and see examples of blockchains in Java. You'll see how blockchain fits in a larger architecture, putting it in context with concepts like journals, event sourcing, CQRS. Finally, you will discover how to determine whether a blockchain may be appropriate for your project.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-mark-van-cuijk-blockchain-and-distributed-ledgers-for-developers", "length": "32:42", "likes": "4", "recorded": "2016-06-22", "short_description": "You must have heard about Bitcoin. Publicly launched in 2009, it obtained massive public media attention a couple of years later", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/3RN8bnNe-Is/hqdefault.jpg", "title": "Devoxx Poland 2016 - Mark van Cuijk - Blockchain and distributed ledgers for developers", "tweet_video": "Devoxx%20Poland%202016%20-%20Mark%20van%20Cuijk%20-%20Blockchain%20and%20distributed%20ledgers%20for%20developers%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-mark-van-cuijk-blockchain-and-distributed-ledgers-for-developers%20presented%20%40devoxxpl", "videos": [{"code": "3RN8bnNe-Is", "type": "youtube"}], "views": "251"}