{"description": "Czy zostałeś ostatnio awansowany z dewelopera na menedżera i czujesz się zagubiony? Albo zajmujesz się programowaniem w power poincie od lat i nadal jesteś zaskakiwany przez swój zespół? Nie martw się – też to przechodziliśmy i chętnie podzielimy się doświadczeniem. Mamy także dzieci…\n\nBycie managerem wiąże się z jednej strony z uczestnictwem w wielu kursach, setkami książek: rzeczy, które nauczyłeś się na studiach MBA, rzeczy których nie nauczysz się na MBA, psychologia w biznesie, zasoby ludzkie, coaching - lista tylko rośnie…\n\nZ drugiej strony, mówi się po prostu bądź dobra osobą, bądź spójny, uwierz w innych - to wystarczy. Zarządzanie ludźmi jest proste jak drut…\n\nKtóre podejście jest właściwe?\n\nPodczas spotkania dowiesz się, jak w praktyce zastosować kilka zasad zarządzania, które tworzą podstawy zarządzania deweloperami. Zweryfikujemy je na realnych przykładach z życia, czy sprawdziły się czy nie. Te zasady nie są lekiem na całe zło, one działają w pewnym kontekście, którego w naszych historiach nie zabraknie.\n\nCzy powyższe jest sekretem do uczynienia życia managera dużo bardziej prostym? Czy jesteś zainteresowany znalezieniem tego klucza?", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-bartek-nowakowski-kuba-marchwicki-nianczenie-programistow-vs-zarzadzanie", "length": "42:40", "likes": "7", "recorded": "2016-06-22", "short_description": "Czy zostałeś ostatnio awansowany z dewelopera na menedżera i czujesz się zagubiony? Albo zajmujesz się programowaniem w power po", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/RaXTXXEcjU0/hqdefault.jpg", "title": "Devoxx Poland 2016 - Bartek Nowakowski, Kuba Marchwicki - Niańczenie programistów vs. zarządzanie...", "tweet_video": "Devoxx%20Poland%202016%20-%20Bartek%20Nowakowski%2C%20Kuba%20Marchwicki%20-%20Nia%C5%84czenie%20programist%C3%B3w%20vs.%20zarz%C4%85dzanie...%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-bartek-nowakowski-kuba-marchwicki-nianczenie-programistow-vs-zarzadzanie%20presented%20%40devoxxpl", "videos": [{"code": "RaXTXXEcjU0", "type": "youtube"}], "views": "883"}