{"description": "What is fragile? Fragile things are easily broken, damaged, or destroyed. When faced with stressors, they crumble. Then what is the opposite of that? Many of us would answer something like “robust” or “resilient.” Things that maintain their integrity when faced with stressors. But it’s possible that we’re wrong.\n\nIn his book Antifragile, Nassim Nicholas Taleb challenges this idea by inventing the word that forms the book’s title. Antifragile is the true opposite of fragile. Whereas fragile things are easily broken, damaged, or destroyed when faced with stressors, antifragile things improve, become stronger, or become more powerful when faced with stressors.\n\nCan we build software systems like this? Dick Gabriel explores the idea of ultra-large scale systems that self-regulate (and in fact thrive) in the face of unexpected changes and stressors in his essay “Design Beyond Human Abilities,” and Russ Miles explicitly calls out the idea of Antifragile Software in his book by the same name. During this session we’ll explore these ideas and what they mean to us as developers and architects.", "event": {"name": "Devoxx Poland 2016", "nickname": "devoxx-poland-2016", "twitter": "devoxxpl", "url": "http://devoxx.pl/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "devoxx-poland-2016-matt-stine-antifragile-architectures", "length": "43:38", "likes": "4", "recorded": "2016-06-22", "short_description": "What is fragile? Fragile things are easily broken, damaged, or destroyed. When faced with stressors, they crumble. Then what is ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/GKQwzAVud60/hqdefault.jpg", "title": "Devoxx Poland 2016 - Matt Stine - Antifragile Architectures", "tweet_video": "Devoxx%20Poland%202016%20-%20Matt%20Stine%20-%20Antifragile%20Architectures%20https%3A//codeandtalk.com/v/devoxx-poland-2016/devoxx-poland-2016-matt-stine-antifragile-architectures%20presented%20%40devoxxpl", "videos": [{"code": "GKQwzAVud60", "type": "youtube"}], "views": "166"}