{
    "description": "Julia Velkova & Konstantin Dmitriev: Open animation projects: state of the art, problems and perspectives\n\nDownload video: http://videos.fscons.org/fscons/2012/miscellaneous/12SAT011515-open-animation-projects-state-art-problems-and-per.ogv\n\nIn the past few years there has been an increasing interest and effort by the free software community and independent artists in creating open animation films. Currently there are several active communities that develop such films using free software, and distributing the finished works under a Creative Commons license.\n\nDespite the increasing efforts and enthusiasm around such films, some of the active projects remain not so well known, sometimes even to the broader community itself. In this context, the aim of the talk is to make an overview of a few active open animation projects that are under development, and dive deeper in a Russian-driven such that aims at creating the first full-featured open animé - \"Marya Morevna\" (http://morevnaproject.org/).\n\nMuch like in the case of open movies developed by Blender Institute, the target of Morevna Project is to create open-movie giving a testing for open source tools. But unlike the other free culture films in the works, it focuses on different technology: most of Morevna Project will be 2D-animated, using Synfig (although Blender is used for 3D effects animation).\n\nSo Morevna Project is going to expand the portfolio of film tools and assets for creating open movies considerably. This talk also takes the opportunity to become the premiere and first official screening of the completed demo/trailer of the project.",
    "favorite": "0",
    "length": "52:19",
    "likes": "2",
    "recorded": "2012-11-09",
    "speakers": [
        "julia-velkova",
        "konstantin-dmitriev"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/yNGov5v6jpM/hqdefault.jpg",
    "title": "Julia Velkova & Konstantin Dmitriev: Open animation projects",
    "videos": [
        {
            "code": "yNGov5v6jpM",
            "type": "youtube"
        }
    ],
    "views": "147"
}