{"description": "Time to value is critical. Continuous delivery of containerized microservices is the best approach for developing better software and iterating fast to give more value to our customers. However, it can be challenging trying to figure out how to take the theory of continuous delivery and turn it into a reality; particularly with the large increase in the number of microservices projects and the rapid innovations happening in the container ecosystem.\n\nIn this talk, we'll show how to use Jenkins Pipeline together with Docker and Kubernetes to implement a complete end-to-end continuous delivery and continuous improvement system for microservices and monolithic applications using open source software. We'll demonstrate how to easily create new microservices projects or import existing projects, have them automatically built, system and integration tested, staged and then deployed. Once deployed, we will also see how to manage and update applications using continuous delivery practices along with integrated ChatOps - all completely automated!\n\nFinally, we'll walk through how to develop microservices-based applications to optimize features like service discovery, high availability, auto scaling, rolling upgrades, circuit breakers, tracing, logging and metrics. After this talk you should be ready to set up your own end-to-end continuous delivery platform easily, with lots of automation and tooling. Let's all go faster!", "event": {"name": "Jenkins World 2016", "nickname": "jenkinsworld-2016", "twitter": "jenkinsconf", "url": "https://www.cloudbees.com/jenkinsworld/home"}, "favorite": "0", "file_date": "2017-01-08", "filename": "jenkins-world-2016-how-to-do-continuous-delivery-with-jenkins-pipeline-docker-and-kubernetes", "length": "51:26", "likes": "7", "recorded": "2016-09-14", "short_description": "Time to value is critical. Continuous delivery of containerized microservices is the best approach for developing better softwar", "speaker_twitters": " @jstrachan", "speakers": {"james-strachan": {"episodes": [], "hosting": [], "info": {"country": "Mells, UK", "github": "jstrachan", "home": "https://medium.com/@jstrachan/", "name": "James Strachan", "twitter": "jstrachan"}, "videos": [{"event": {"name": "Jenkins World 2016", "nickname": "jenkinsworld-2016", "twitter": "jenkinsconf", "url": "https://www.cloudbees.com/jenkinsworld/home"}, "filename": "jenkins-world-2016-how-to-do-continuous-delivery-with-jenkins-pipeline-docker-and-kubernetes", "recorded": "2016-09-14", "thumbnail_url": "https://i.ytimg.com/vi/6g9pRcY-VH0/hqdefault.jpg", "title": "How to Do Continuous Delivery with Jenkins Pipeline, Docker and Kubernetes"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/6g9pRcY-VH0/hqdefault.jpg", "title": "How to Do Continuous Delivery with Jenkins Pipeline, Docker and Kubernetes", "tweet_video": "How%20to%20Do%20Continuous%20Delivery%20with%20Jenkins%20Pipeline%2C%20Docker%20and%20Kubernetes%20https%3A//codeandtalk.com/v/jenkinsworld-2016/jenkins-world-2016-how-to-do-continuous-delivery-with-jenkins-pipeline-docker-and-kubernetes%20presented%20%40jenkinsconf%20by%20%40jstrachan", "videos": [{"code": "6g9pRcY-VH0", "type": "youtube"}], "views": "1001"}