{
    "description": "Let’s talk developer programs, standards, scale, SDKs, REST, good and bad practices, documentation, business, security, and regulation. Let's talk APIs.\n\nTyson has been actively involved in both Online Payments and Mobile Payments for 15 Years, with extensive experience working with both traditional and next generation businesses. He has worked with many of these organisations through his time in Braintree, PayPal and Vodafone.\nHe is excited by projects and businesses that are trying to enhance ‘mobile’ experiences and drive commerce by using the ‘invisible payments’ like Uber, Hotel Quickly, Hailo and many others in the Asia region.\nCurrently expanding the Asia footprint of Braintree, is involved with expanding access to the traditional payment methods as well as the emerging payment technologies. Is an avid mentor and educationalist, spending much of his time explaining ‘payments’ and how they can be used to grow commerce. Related to this is his love of ‘start-up’ t- shirts and stickers.\n\nHemanth ...\nis a computer polyglot CLI, web and unix philosophy lover.\nworks as a Senior software engineer at PayPal Bangalore.\nblog's about his experiments and experiences in programming.\ncontributes to FOSS via Github and is a part of the Yeoman, Webpack and many other notable teams.\ncurates Node Module Of The Week, JSfeatures.in. Coordinates BangaloreJS meetups.\nmentors at GeeksKool.\nis a community leader at DuckDuckGo and\nis a Google Developer Expert.\n\n\nJSConf.Asia - Capitol Theatre, Singapore - 25+26 November 2016.\n\nSource: https://2016.jsconf.asia/\n\nLicense: For reuse of this video under a more permissive license please get in touch with us. The speakers retain the copyright for their performances.",
    "favorite": "0",
    "length": "30:48",
    "likes": 0,
    "recorded": "2016-11-25",
    "speakers": [
        "tyson-hackwood",
        "hemanth-madhavarao"
    ],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/bHaH1Trqa-4/hqdefault.jpg",
    "title": "The API in 2017",
    "videos": [
        {
            "code": "bHaH1Trqa-4",
            "type": "youtube"
        }
    ],
    "views": "71"
}