{"description": "Check out http://www.pgconf.us/2015/event/105/ for the full talk details.\n\nPostgreSQL 9.5 is far from done yet, and we are still in active development. However, a lot of things are already known - this talk will take a look at some of the things that are available in what will eventually become PostgreSQL 9.5.\n\nAbout the Speaker\nMagnus Hagander is a member of the PostgreSQL Core Team and a developer and code committer in the PostgreSQL Global Development Group.\nThese days, Magnus mostly works on other parts of the PostgreSQL backend, recently with a focus on security features, monitoring and backup/replication interfaces and tools.\nHe is also one of the core members of the postgresql.org infrastructure team, maintaining the servers that power the project, and one of the maintainers of the postgresql.org website. He also contributes to pgAdmin and other related projects.\nHe's been a PostgreSQL user since version 6 (with some non-serious use of Postgres 95 before that), and currently serves on the Core Team and as President of the Board for PostgreSQL Europe.\nTo pay the bills, he is a PostgreSQL and open source software consultant at Redpill Linpro in Stockholm, Sweden, where he works on consulting, support and training services, as well as custom development work.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "a-look-at-the-elephants-trunk-postgresql-95", "length": "50:42", "likes": "6", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/105/ for the full talk details. PostgreSQL 9.5 is far from done yet, and we are still ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/cX8twOs7xvM/hqdefault.jpg", "title": "A look at the Elephants trunk - PostgreSQL 9.5", "tweet_video": "A%20look%20at%20the%20Elephants%20trunk%20-%20PostgreSQL%209.5%20https%3A//codeandtalk.com/v/pgconfus-2015/a-look-at-the-elephants-trunk-postgresql-95%20presented%20%40pgconfus", "videos": [{"code": "cX8twOs7xvM", "type": "youtube"}], "views": "1282"}