{"description": "Check out http://www.pgconf.us/2015/event/60/ for the full talk details.\n\nWhat do you do when your requirements say you need to be able to reproduce the exact same results that a query did sometime in the past? Including to be able to reproduce incorrect statistics on data that has since been corrected? And being able to reproduce exactly which rows were returned by a query in the past?\n\nWell, you do like any time lord would do - break out the TARDIS. Or maybe just use PostgreSQL..\n\nThis talk will outline a technique to use some PostgreSQL features, including range types and exclusion contraints/indexes, to trick an ORM application to work with transparent time travel, with the goal of close to zero modifications to the application, while maintaining consistency.\n\nAbout the Speaker\nMagnus Hagander is a member of the PostgreSQL Core Team and a developer and code committer in the PostgreSQL Global Development Group.\n\nThese days, Magnus mostly works on other parts of the PostgreSQL backend, recently with a focus on security features, monitoring and backup/replication interfaces and tools.\n\nHe is also one of the core members of the postgresql.org infrastructure team, maintaining the servers that power the project, and one of the maintainers of the postgresql.org website. He also contributes to pgAdmin and other related projects.\n\nHe's been a PostgreSQL user since version 6 (with some non-serious use of Postgres 95 before that), and currently serves on the Core Team and as President of the Board for PostgreSQL Europe.\n\nTo pay the bills, he is a PostgreSQL and open source software consultant at Redpill Linpro in Stockholm, Sweden, where he works on consulting, support and training services, as well as custom development work.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "a-tardis-for-your-orm-application-level-time-travel-in-postgresql", "length": "51:28", "likes": "5", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/60/ for the full talk details. What do you do when your requirements say you need to b", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/TRgni5q0YM8/hqdefault.jpg", "title": "A TARDIS for your ORM - application level time travel in PostgreSQL", "tweet_video": "A%20TARDIS%20for%20your%20ORM%20-%20application%20level%20time%20travel%20in%20PostgreSQL%20https%3A//codeandtalk.com/v/pgconfus-2015/a-tardis-for-your-orm-application-level-time-travel-in-postgresql%20presented%20%40pgconfus", "videos": [{"code": "TRgni5q0YM8", "type": "youtube"}], "views": "624"}