{"description": "Check out http://www.pgconf.us/2015/event/97/ for the full talk details.\n\nIn this talk I'm going to touch different techniques and tools for managing changes inside PostgreSQL databases, including schema deployments, data changes and usage of stored procedures as a versioned API layer. Based on my experience of no-downtime deployments at Zalando SE, one of the biggest European fashion retailers, I'm going to highlight different approaches to database deployments and introduce some open-source tools used and developed by the Database Team at Zalando.\n\nAbout the Speaker\nAlexey started with PostgreSQL at 2003 as a C programmer. He learned how to debug the backend code before learning SQL, but caught up on the latter pretty quickly. He is now using both of those skills and years of experience as a database consultant to help his employer manage a growing number of PostgreSQL database clusters and deal with hundreds of database changes during weekly deployments. A native of Simferopol, Ukraine, he lives in Berlin and works as a Database Engineer at Zalando SE. Over the years, he contributed code and documentation to the PostgreSQL project.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "alter-database-add-more-sanity-af1c8b", "length": "57:40", "likes": "0", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/97/ for the full talk details. In this talk I'm going to touch different techniques an", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/y5pNMmJNsK8/hqdefault.jpg", "title": "ALTER DATABASE ADD more SANITY", "tweet_video": "ALTER%20DATABASE%20ADD%20more%20SANITY%20https%3A//codeandtalk.com/v/pgconfus-2015/alter-database-add-more-sanity-af1c8b%20presented%20%40pgconfus", "videos": [{"code": "y5pNMmJNsK8", "type": "youtube"}], "views": "92"}