{"description": "Check out http://www.pgconf.us/2015/event/82/ for the full talk details.\n\nPostgreSQL like any other classical database interacts with disks heavily and has dozens of disk-related settings. In order to keep an instance up and running under even moderate workloads, an average DBA needs to dig through PostgreSQL documentation, operating system documentation, hardware vendor manuals, a few books, plenty of blog posts, [HACKERS] and [PERFORM] mail lists archive and finally gain a couple years of experience. \n\nThis talk will guide DBAs through a checklist, that allows to maximize the disk performance of a PostgreSQL installations. I will concisely summarize typical DBA tasks on four levels: choosing and setting up hardware, operating system configuration, file system mounting with proper options, and PostgreSQL tuning itself. The talk will include but is not limited to such important topics as monitoring I/O-related metrics, checkpoint tuning, autovacuum tuning. \n\nAbout the Speaker\nIlya is a co-founder and DBA at PostgreSQL-Consulting.com. His previous experience encompasses such commercial databases as Oracle and DB2. Currently, Ilya works primarily with PostgreSQL with a focus on its performance and effective use in production. He sees the mission of PostgreSQL in substituting the commercial databases in high-performance mission-critical applications.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "how-does-postgresql-work-with-disks-a-dbas-checklist-in-detail", "length": "47:46", "likes": "10", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/82/ for the full talk details. PostgreSQL like any other classical database interacts ", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/Lbx-JVcGIFo/hqdefault.jpg", "title": "How does PostgreSQL work with disks: a DBA’s checklist in detail", "tweet_video": "How%20does%20PostgreSQL%20work%20with%20disks%3A%20a%20DBA%E2%80%99s%20checklist%20in%20detail%20https%3A//codeandtalk.com/v/pgconfus-2015/how-does-postgresql-work-with-disks-a-dbas-checklist-in-detail%20presented%20%40pgconfus", "videos": [{"code": "Lbx-JVcGIFo", "type": "youtube"}], "views": "1928"}