{"description": "Check out http://www.pgconf.us/2015/event/92/ for the full talk details.\n\nAre you tired of managing backup and recovery processes of your Postgres server using custom scripts? Are you worried about being called in the night or worse whilst on holiday to perform a recovery operation of your company's business critical PostgreSQL server?\n\nBarman, Backup and Recovery Manager, standardises backup and recovery operations, allowing database administrators and system administrators to easily integrate their PostgreSQL solutions in their disaster recovery plan.\n\nNew ideas, which will be part of version 2 of Barman, will be unveiled during the presentation.\nBarman is distributed as open source under GNU GPL 3 terms. Further information available at www.pgbarman.org.\n\nAbout the Speaker\nA long time open-source programmer, Gabriele has been writing Linux/Unix applications in C and C++ for over 15 years, specialising in search engines and web analytics with large databases.\nGabriele has a degree in Statistics from the University of Florence. His areas of expertise are data mining and data warehousing, having worked on web traffic analysis in Australia and Italy. Gabriele is a principal consultant with 2ndQuadrant and an active member of the international PostgreSQL community.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "postgresql-disaster-recovery-with-barman", "length": "01:04:23", "likes": "20", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/92/ for the full talk details. Are you tired of managing backup and recovery processes", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/SGZ_WRUZQGQ/hqdefault.jpg", "title": "PostgreSQL Disaster Recovery with Barman", "tweet_video": "PostgreSQL%20Disaster%20Recovery%20with%20Barman%20https%3A//codeandtalk.com/v/pgconfus-2015/postgresql-disaster-recovery-with-barman%20presented%20%40pgconfus", "videos": [{"code": "SGZ_WRUZQGQ", "type": "youtube"}], "views": "3068"}