{"description": "Check out http://www.pgconf.us/2015/event/88/ for the full talk details.\n\nDisaster recovery is perhaps the most ignored aspect of managing PostgreSQL in production systems, and its value is only realized in a moment of crisis. If not done right, absence of backup and recovery strategies can make one repent for days, if not months after. Even when catered to, majority of production systems only have at most one defined backup and recovery strategy, not realizing the benefits of using a hybrid solution or a combination of multiple types of backups and recovery approaches. Contrary to common perception of treating disaster management as a one model fits all philosophy, emphasis should be given on how various types of backups have been optimized for specific kinds of disaster scenarios.\n\nAbout the Speaker\nWorking as DBA at OmniTI since June 2013. Had previously interned here in 2012 and was introduced to the beautiful world of PostgreSQL. \nCS Master's student at University of Maryland, Baltimore County. \nDid my B.E in CS at Panjab University, India.", "event": {"name": "PGConf US 2015", "nickname": "pgconfus-2015", "twitter": "pgconfus", "url": "http://www.pgconf.us/2015/"}, "favorite": "0", "file_date": "2016-12-03", "filename": "think-your-postgres-backups-and-disaster-recovery-are-safe-lets-talk", "length": "42:46", "likes": "5", "recorded": "2015-03-25", "short_description": "Check out http://www.pgconf.us/2015/event/88/ for the full talk details. Disaster recovery is perhaps the most ignored aspect of", "speaker_twitters": "", "speakers": {}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/9ceRXMqPyJQ/hqdefault.jpg", "title": "Think Your Postgres Backups And Disaster Recovery Are Safe? Let's talk.", "tweet_video": "Think%20Your%20Postgres%20Backups%20And%20Disaster%20Recovery%20Are%20Safe%3F%20Let%27s%20talk.%20https%3A//codeandtalk.com/v/pgconfus-2015/think-your-postgres-backups-and-disaster-recovery-are-safe-lets-talk%20presented%20%40pgconfus", "videos": [{"code": "9ceRXMqPyJQ", "type": "youtube"}], "views": "206"}