{
    "description": "Check out http://www.pgconf.us/2015/event/95/ for the full talk details.\n\nSince TripAdvisor’s early days as a scrappy start up, Postgres has been at the core of our infrastructure. We’ve grown up with Postgres from our early 7.x series single database setup, to our current mix of 9.1+ installed across over 100 dedicated Postgres servers in 4 datacenters. Postgres’ flexibility and sheer resilience to whatever we throw at it has served us well. This means:\n\n* 2 core-site datacenters with Postgres infrastructure tested to be capable of handling well over 1,100,000 database queries per minute.\n* Replication between those data centers running in a master-slave model with a scheduled role-reversal every 3 months.\n* Distinct core-site SLA’s for read only availability, and read write availability. No scheduled outages; less than 30 minutes per year of scheduled read only time.\n* 3 different flavors of replications with at least 5-6 distinct types of replication topologies.\n* 3 distinct development environments for engineers complete with full database snapshots that refresh from production every week.\n* Varying different workloads including:\n* Servers with 768GB of RAM so everything fits in memory.\n* Multi terabyte databases where only 5% can fit in RAM.\n* A sharded core site (not warehouse!) table with over 2,600,000,000 tuples.\n* Real time main site anomaly detection database that ingests 87,000 tuples per second.\n* All of this is maintained by a a team of 1 person full time and 4 people part time.\n\nThis talk will be a look at how Postgres can form the backbone of a site at the scale of 315 million unique visitors a month.\n\nAbout the Speaker\nMatt Kelly has been working with TripAdvisor for the past 3.5 years, starting as a general software engineer. Last year he switched over to the operations team to be the person focused on advancing the Postgres infrastructure at TripAdvisor.",
    "recorded": "2015-03-25",
    "speakers": [],
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/YquXmwZNnfg/hqdefault.jpg",
    "title": "At The Heart Of A Giant: Postgres At TripAdvisor",
    "videos": [
        {
            "code": "YquXmwZNnfg",
            "type": "youtube"
        }
    ]
}