{"abstract": "https://www.linuxfestnorthwest.org/2016/sessions/openstack-vs-ganeti", "description": "OpenStack has gained a lot of prominence in the cloud ecosystem, but it can be a difficult platform to setup and maintain. Ganeti is software developed at Google which can be used to manage physical hardware in order to host virtualization workloads.\n\nThis presentation will cover the primary differences between the two platforms including a summary of how each are implemented and their history. This session will also discuss many of the pros and cons of each platform and best practices for both platforms.\n\nAt the OSU Open Source Lab, we have been long time users and promoters of Ganeti since 2009. It’s enabled the lab to better serve its FOSS hosting activities in a stable yet easy to use manner. Over the past year we have been also building and using OpenStack clusters to fill other computing needs that Ganeti doesn’t fill very well such as elastic computing needs.\n\nGaneti is software developed at Google which can be used to manage physical hardware in order to host virtualization workloads. Its not nearly as wide known as other VM platforms, mainly because their goal isn’t to provide a cloud platform, but as an IaaS platform that’s easy to use and maintain. Being a no-frills platform with no built-in web GUI interface, Ganeti is often overlooked. However its simplicity is one of its strengths and has been proven time and time again by system admins.\n\nGaneti is used worldwide, primarily by educational institutions and has been proven to be cheap and easy platform to use and maintain. The Ganeti architecture makes it easy to install, maintain, extend and use. Compared to other platforms, Ganeti is a great fit for medium to small organizations that need a simple virtualization cluster.", "event": {"name": "Linuxfest Northwest 2016", "nickname": "linuxfest-northwest-2016", "twitter": "", "url": "https://www.linuxfestnorthwest.org/2016"}, "favorite": "0", "file_date": "2016-12-03", "filename": "linuxfest-northwest-2016-openstack-vs-ganeti", "length": "58:27", "likes": "2", "recorded": "2016-04-23", "short_description": "OpenStack has gained a lot of prominence in the cloud ecosystem, but it can be a difficult platform to setup and maintain. Ganet", "speaker_twitters": " @ramereth", "speakers": {"lance-albertson": {"episodes": [], "hosting": [], "info": {"country": "Corvallis, OR, USA", "github": "ramereth", "home": "http://www.lancealbertson.com/", "name": "Lance Albertson", "twitter": "ramereth"}, "videos": [{"event": {"name": "Linuxfest Northwest 2016", "nickname": "linuxfest-northwest-2016", "twitter": "", "url": "https://www.linuxfestnorthwest.org/2016"}, "filename": "linuxfest-northwest-2016-openstack-vs-ganeti", "recorded": "2016-04-23", "thumbnail_url": "https://i.ytimg.com/vi/ww50iW313H4/hqdefault.jpg", "title": "OpenStack vs. Ganeti"}, {"event": {"name": "Linuxfest Northwest 2016", "nickname": "linuxfest-northwest-2016", "twitter": "", "url": "https://www.linuxfestnorthwest.org/2016"}, "filename": "linuxfest-northwest-2016-project-hosting-30", "recorded": "2016-04-23", "thumbnail_url": "https://i.ytimg.com/vi/a5RZTwr58sc/hqdefault.jpg", "title": "Project Hosting 3.0"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/ww50iW313H4/hqdefault.jpg", "title": "OpenStack vs. Ganeti", "tweet_video": "OpenStack%20vs.%20Ganeti%20https%3A//codeandtalk.com/v/linuxfest-northwest-2016/linuxfest-northwest-2016-openstack-vs-ganeti%20by%20%40ramereth", "videos": [{"code": "ww50iW313H4", "type": "youtube"}], "views": "281"}