{"abstract": "https://www.linuxfestnorthwest.org/2016/sessions/improving-computer-science-education-foss-style-projects", "description": "The software development landscape has transformed in the last 20 years, but computer science education has not necessarily kept up. Many computer science courses, even upper division courses, continue to focus on individual student effort to the exclusion of collaboration such as has become the norm in modern FOSS and commercial software development projects. In my role as an Adjunct Instructor at Wright State University teaching \"Introduction to the Design of Information Technology Systems\" I have taken what I believe to be a novel approach to educating computer science students.\n\nMy approach to the course requires extensive collaboration for students within their small teams and also between teams. The students are introduced to numerous modern software development concepts centered around collaboration within teams and among teams of teams.\n\nThis talk expects no specific prior knowledge on the part of the attendee. The talk will cover:\n\nthe way in which I manage the introduction of numerous collaboration techniques and technologies to the students\nthe way I have evolved the course over the last several semesters\nhow I balance the academic catalog requirements for topics that the course must cover with the project-centered focus I have tried to create\nThis talk would be of interest to:\n\ncomputer science/engineering educators who would like to take the educational experience they create for their students to the next level\nFOSS developers who might be interested in partnering with an educator as a means of helping students to gain real world development experience and building a community of potential future FOSS contributors\nstudent trailblazers who could help to promote a similar approach within their own educational institution", "event": {"name": "Linuxfest Northwest 2016", "nickname": "linuxfest-northwest-2016", "twitter": "", "url": "https://www.linuxfestnorthwest.org/2016"}, "favorite": "0", "file_date": "2016-12-03", "filename": "linuxfest-northwest-2016-improving-computer-science-education-with-foss-style-projects", "length": "01:01:44", "likes": "1", "recorded": "2016-04-23", "short_description": "The software development landscape has transformed in the last 20 years, but computer science education has not necessarily kept", "speaker_twitters": "", "speakers": {"roberto-sanchez": {"episodes": [], "hosting": [], "info": {"country": "Dayton, OH, USA", "github": "rsanchez-wsu", "home": "https://www.linkedin.com/in/robertocsanchez", "name": "Roberto Sanchez"}, "videos": [{"event": {"name": "Linuxfest Northwest 2016", "nickname": "linuxfest-northwest-2016", "twitter": "", "url": "https://www.linuxfestnorthwest.org/2016"}, "filename": "linuxfest-northwest-2016-improving-computer-science-education-with-foss-style-projects", "recorded": "2016-04-23", "thumbnail_url": "https://i.ytimg.com/vi/oBJHHtD9iVA/hqdefault.jpg", "title": "LinuxFest Northwest 2016: Improving Computer Science Education with FOSS-style Projects"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/oBJHHtD9iVA/hqdefault.jpg", "title": "LinuxFest Northwest 2016: Improving Computer Science Education with FOSS-style Projects", "tweet_video": "LinuxFest%20Northwest%202016%3A%20Improving%20Computer%20Science%20Education%20with%20FOSS-style%20Projects%20https%3A//codeandtalk.com/v/linuxfest-northwest-2016/linuxfest-northwest-2016-improving-computer-science-education-with-foss-style-projects", "videos": [{"code": "oBJHHtD9iVA", "type": "youtube"}], "views": "63"}