{"description": "Wie man die 10 häufigsten Bildbearbeitungs-Aufgaben auch auf der Kommandozeile erledigen kann\n\nBeschreibung:\nEin einfaches ImageMagick-Kommando kann aus einem JPEG ein PNG machen, oder aus mehreren TIFFs ein animiertes GIF.\n\nEs kann aber noch viel mehr: Bilder, Grafiken und Illustrationen erzeugen, verändern, beschriften, mit Wasserzeichen versehen, modifizieren, skalieren, aneinanderhängen, analysieren, beschneiden, vergleichen, verzerren, schärfen, verwischen und noch so manches mehr.\n\nDer Vortrag ist geeignet für Anfänger und fortgeschrittene Computer-Benutzer: hierbei kommt es auf das Betriebssystem nicht unbedingt an. ImageMagick funktioniert auf Linux, Mac OSX, BSD-Unix oder Windows gleichermassen.\n\nViele Anwender haben vermutlich bereits mal ein einfaches ImageMagick-Kommando wie:\n\n`convert photo.jpeg photo.png`\n\ndurchgeführt, um eine JPEG-Datei in eine PNG-Datei zu konvertieren.\n\nDer Funktionsumfang von ImageMagick ist allerdings noch viel umfangreicher: es kann Bilder, Grafiken und Illustrationen erzeugen, verändern, beschriften, mit Wasserzeichen versehen, modifizieren, skalieren, aneinanderhängen, analysieren, beschneiden, vergleichen, verzerren, animieren, schärfen, verwischen und noch so manches mehr.\n\nDabei kann ImageMagick innerhalb ein- und desselben Kommandos nicht nur eine einzige Operation durchführen sondern beinahe beliebig viele und sehr komplexe.\n\nDer Vortrag wird kaum Folien verwenden. Stattdessen führt er ImageMagick vorwiegend 'live' vor. Hierbei zeigt er einige der am häufigsten benötigten Bild-Bearbeitungen:\n\n* Bilder beschneiden, rahmen, aufteilen oder aneinanderhängen; \n* Photos beschriften, in einen anderen Farbraum überführen und schärfen; \n* Grafiken skalieren, aneinanderhängen und verwischen; \n* Illustrationen verzerren, rotieren und analysieren; \n* Farben konvertieren, verbessern oder verfälschen; \n* Bild-Hintergründe transparent machen\n\nAuch einige \"komplexe\" Operationen sind darunter, bei welchen innerhalb ein- und derselbe Kommando-Pipeline mehrere voneinander unabhängige Änderungen an den Eingangs-Bildern durchführt bevor das End-Resultat sichtbar wird.\n\nNicht zuletzt wird auch der visuelle Vergleich von zwei ähnlichen (jedoch unterschiedlichen) Bilder besprochen und vorgezeigt.\n\nVortragender: @pdfkungfoo", "event": {"name": "Grazer LinuxTage 2015", "nickname": "grazer-linuxtage-2015", "twitter": "linuxtage", "url": "https://glt15.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "grafik-kungfoo-mit-imagemagick-pdfkungfoo", "length": "54:16", "likes": "1", "recorded": "2015-04-24", "short_description": "Wie man die 10 häufigsten Bildbearbeitungs-Aufgaben auch auf der Kommandozeile erledigen kann Beschreibung: Ein einfaches ImageM", "speaker_twitters": " @pdfkungfoo", "speakers": {"kurt-pfeifle": {"episodes": [], "hosting": [], "info": {"country": "Stuttgart, Germany", "github": "KurtPfeifle", "home": "http://stackoverflow.com/users/359307/kurt-pfeifle", "name": "Kurt Pfeifle", "twitter": "pdfkungfoo"}, "videos": [{"event": {"name": "Grazer LinuxTage 2015", "nickname": "grazer-linuxtage-2015", "twitter": "linuxtage", "url": "https://glt15.linuxtage.at/"}, "filename": "grafik-kungfoo-mit-imagemagick-pdfkungfoo", "recorded": "2015-04-24", "thumbnail_url": "https://i.ytimg.com/vi/DMKqXM_yUHQ/hqdefault.jpg", "title": "Grafik Kungfoo mit Imagemagick"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/DMKqXM_yUHQ/hqdefault.jpg", "title": "Grafik Kungfoo mit Imagemagick", "tweet_video": "Grafik%20Kungfoo%20mit%20Imagemagick%20https%3A//codeandtalk.com/v/grazer-linuxtage-2015/grafik-kungfoo-mit-imagemagick-pdfkungfoo%20presented%20%40linuxtage%20by%20%40pdfkungfoo", "videos": [{"code": "DMKqXM_yUHQ", "type": "youtube"}], "views": "37"}