{"description": "Dezentrale Namen in der Blockchain\n\nBeschreibung:\nMit Namecoin lässt sich ein komplett dezentrales DNS-System umsetzen - Zertifikatsprüfung für TLS inklusive. Aber es gibt auch noch viel Potential für zukünftige Innovationen.\n\nNamecoin implementiert eine Name/Value-Datenbank, die komplett dezentral in einem Peer-to-Peer-Netzwerk umgesetzt ist. Namen können nicht beschlagnahmt oder zensiert werden, nur der rechtmäßige Besitzer kann ihre zugehörigen Werte ändern.\n\nDamit lässt sich, zum Beispiel, ein dezentrales DNS-System umsetzen. Zusätzlich zur IP-Adresse, die zu einer Domain gehört, kann man dort auch gleich das Server-TLS-Zertifikat hinterlegen - und somit eine alternative zum sehr problematischen CA-System schaffen. Im Gegensatz zu anderen Lösungen, die so etwas ermöglichen (zum Beispiel Onion-Adressen) sind die Namen jedoch frei wählbar und nicht zufällig generiert. (Zum Beispiel https://www.domob.bit/ für meine eigene Webseite.)\n\nAber auch abseits des DNS-Systems gibt es Anwendungsmöglichkeiten - zum Beispiel für Online-Identitäten, die einen sicheren Austausch kryptographischer Schlüssel ermöglichen. Und es besteht natürlich die Möglichkeit für zukünftige, innovative Anwendungsbeispiele.\n\nIn meinem Vortrag möchte ich einen Überblick über die Funktionsweise und die Anwendungsmöglichkeiten geben.\n\nVortragender: Daniel Kraft", "event": {"name": "Grazer LinuxTage 2015", "nickname": "grazer-linuxtage-2015", "twitter": "linuxtage", "url": "https://glt15.linuxtage.at/"}, "favorite": "0", "file_date": "2016-12-26", "filename": "namecoin-daniel-kraft", "length": "32:50", "likes": "0", "recorded": "2015-04-24", "short_description": "Dezentrale Namen in der Blockchain Beschreibung: Mit Namecoin lässt sich ein komplett dezentrales DNS-System umsetzen - Zertifik", "speaker_twitters": "", "speakers": {"daniel-kraft": {"episodes": [], "hosting": [], "info": {"github": "domob1812", "home": "https://www.domob.eu/", "name": "Daniel Kraft"}, "videos": [{"event": {"name": "Grazer LinuxTage 2015", "nickname": "grazer-linuxtage-2015", "twitter": "linuxtage", "url": "https://glt15.linuxtage.at/"}, "filename": "namecoin-daniel-kraft", "recorded": "2015-04-24", "thumbnail_url": "https://i.ytimg.com/vi/bp2V281-AnE/hqdefault.jpg", "title": "Namecoin"}]}}, "tags": [], "thumbnail_url": "https://i.ytimg.com/vi/bp2V281-AnE/hqdefault.jpg", "title": "Namecoin", "tweet_video": "Namecoin%20https%3A//codeandtalk.com/v/grazer-linuxtage-2015/namecoin-daniel-kraft%20presented%20%40linuxtage", "videos": [{"code": "bp2V281-AnE", "type": "youtube"}], "views": "47"}